[
  {
    "id": "gdp2-1",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un funcionario propone compartir una base de datos tributaria con una entidad externa sin revisar las políticas vigentes. ¿Qué debe indicar el Gestor II como medida inicial?",
    "opciones": [
      "Validar que exista una política de acceso y compartir solo si hay respaldo legal.",
      "Aceptar la solicitud si la entidad externa pertenece al Estado.",
      "Compartir parcialmente la base para agilizar el proceso."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La política de acceso regula cómo y bajo qué condiciones se comparte la información. El Gestor II debe garantizar el cumplimiento de la normativa para proteger la seguridad de los datos."
  },
  {
    "id": "gdp2-2",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La DIAN actualiza su arquitectura de datos y se identifican datos sin metadatos normalizados. ¿Qué estándar debe implementarse para garantizar metadatos coherentes?",
    "opciones": [
      "Dublin Core, por su estructura para describir metadatos de forma estandarizada.",
      "ISO 27001, porque regula la seguridad de la información.",
      "DAMA-DMBOK, porque define el uso de servidores federados."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "Dublin Core es un estándar internacional para la descripción de metadatos, esencial para la interoperabilidad y documentación del dato."
  },
  {
    "id": "gdp2-3",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un reporte institucional es generado por una dependencia con datos no certificados por el Data Owner. ¿Qué principio está siendo vulnerado según la política de gobierno de datos?",
    "opciones": [
      "Principio de integridad y responsabilidad sobre la fuente.",
      "Principio de eficiencia operativa.",
      "Principio de almacenamiento flexible."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "Los datos deben ser verificados y validados por los responsables asignados para garantizar su integridad y responsabilidad. El uso de fuentes no certificadas compromete este principio."
  },
  {
    "id": "gdp2-4",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un ciudadano solicita eliminar sus datos personales del DATAR. ¿Qué política aplica en este caso?",
    "opciones": [
      "Política de Retención y Archivo.",
      "Política de Privacidad, basada en la Ley 1581.",
      "Política de Calidad del Dato."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Política de Privacidad, enmarcada en la Ley 1581 de 2012, rige el tratamiento de los datos personales, incluyendo su rectificación o eliminación."
  },

  {
    "id": "gdp2-5",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II, en su rol de monitoreo, detecta que una base de datos crítica para fiscalización presenta un 8% de registros con valores nulos en un campo que, según la política de calidad de datos, debería ser obligatorio. El Data Owner del área de Fiscalización exige una solución que no comprometa la integridad de los datos existentes ni el cronograma de auditorías en curso. ¿Qué acción debe priorizar el Gestor II en coordinación con el Data Steward?",
    "opciones": [
      "Proceder a llenar los valores nulos con un valor por defecto o un valor estimado para cumplir con la completitud de la política de datos.",
      "Identificar la causa raíz del error de captura, documentar los registros afectados, y proponer un proceso de corrección de datos para los registros futuros, mientras se notifica la limitación de la información a los analistas de fiscalización.",
      "Informar al Data Owner que la corrección de los valores nulos tomará tiempo y que los analistas de fiscalización deberán esperar la corrección para realizar las auditorías."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La política de calidad de datos no permite llenar valores nulos con valores por defecto o estimados, ya que esto compromete la integridad y la precisión de la información. La acción más estratégica es identificar la causa raíz, documentar el problema y proponer un plan de corrección sin afectar la integridad, mientras se notifica la limitación de la información para la toma de decisiones."
  },
  {
    "id": "gdp2-6",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Como Gestor II, usted participa en la implementación de una nueva herramienta de seguridad para el repositorio de datos. La herramienta detecta un patrón de acceso no autorizado a información sensible. ¿Qué política de gobierno de datos se está defendiendo activamente con la implementación de esta herramienta y la detección de este patrón?",
    "opciones": [
      "La Política de Nomenclatura, ya que la herramienta previene cambios en los nombres de los campos de la base de datos de la entidad.",
      "La Política de Calidad de Datos, ya que la herramienta protege la precisión y la completitud de la información en el repositorio.",
      "La Política de Seguridad de la Información, ya que la herramienta protege la confidencialidad, la integridad y la disponibilidad de los datos de la entidad."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "Una herramienta de seguridad para el repositorio de datos defiende activamente la Política de Seguridad de la Información. Esta política se encarga de proteger la confidencialidad, la integridad y la disponibilidad de la información contra el acceso no autorizado, el uso indebido o la alteración."
  },
  {
    "id": "gdp2-7",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un analista de la Dirección de Gestión de Aduanas solicita un reporte a la Dirección de Gestión de Tecnología y Telecomunicaciones. El reporte requiere combinar información de la base de datos de aduanas con una base de datos de la Dirección de Gestión de Impuestos. La solicitud es rechazada porque no cumple con la política de estandarización y nomenclatura de datos de la entidad. ¿Cuál es el principal efecto negativo de esta inconsistencia en los datos en la misionalidad de la DIAN?",
    "opciones": [
      "La lentitud del sistema de información, ya que la falta de estandarización ralentiza el procesamiento de datos de la entidad.",
      "La baja calidad de los datos, ya que la falta de estandarización compromete la precisión de la información en los reportes.",
      "La falta de interoperabilidad entre sistemas, lo que impide la consolidación de información clave para la toma de decisiones misionales, como la detección de contrabando."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La falta de estandarización y nomenclatura de datos genera una falta de interoperabilidad entre los sistemas de la DIAN. Esto impide la combinación de información de diferentes bases de datos, lo que es crítico para la toma de decisiones misionales, como la detección de contrabando, y afecta la capacidad de la entidad para cumplir con sus objetivos."
  },
  {
    "id": "gdp2-8",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "En una Oficina Seccional de la DIAN, un funcionario del área de fiscalización, al revisar el historial de un contribuyente, identifica que los registros de sus declaraciones tributarias presentan inconsistencias y que no se están actualizando en tiempo real. Esta falta de oportunidad en la información afecta la validez de la auditoría. ¿Qué política de calidad de datos se está violando en esta situación?",
    "opciones": [
      "La política de Precisión de los datos, ya que la información del historial de declaraciones no es veraz.",
      "La política de Consistencia de los datos, ya que los datos de las declaraciones tributarias no son iguales en todos los sistemas.",
      "La política de Oportunidad de los datos, ya que la información no está disponible en tiempo real para la toma de decisiones, lo que afecta la validez de las auditorías."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La política de Oportunidad de los datos se encarga de asegurar que la información esté disponible en tiempo real o en el momento en que se necesite para la toma de decisiones. La falta de actualización en tiempo real de los registros de declaraciones tributarias viola esta política y afecta la validez de las auditorías, comprometiendo la misionalidad de la DIAN."
  },
  {
    "id": "gdp2-9",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II está desarrollando un proceso para la anonimización de datos tributarios para un reporte público. La política de privacidad de la DIAN, basada en el Habeas Data, es estricta al respecto. Si el proceso de anonimización falla y la identidad de un contribuyente se revela, ¿qué principio de la política de privacidad se ha vulnerado, y cuál es la consecuencia más grave para la entidad?",
    "opciones": [
      "El principio de Calidad de Datos, ya que la información no es precisa y completa en el reporte público.",
      "El principio de Confidencialidad, ya que se reveló la identidad de un contribuyente, lo que compromete la confianza ciudadana en la DIAN.",
      "El principio de Oportunidad, ya que la información no fue anonimizada en tiempo real para el reporte público."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El principio de Confidencialidad de la política de privacidad se encarga de proteger la información personal de los contribuyentes. Una falla en el proceso de anonimización que revela la identidad de un contribuyente vulnera este principio, comprometiendo la confianza de los ciudadanos en la DIAN, lo que es la consecuencia más grave para la misionalidad de la entidad."
  },
  {
    "id": "gdp2-10",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Como Gestor II, usted recibe un informe de la Dirección de Gestión Jurídica que solicita eliminar ciertos registros de una base de datos de aduanas que han sido objeto de una sentencia judicial que anula una sanción. ¿Qué política del gobierno de datos debe aplicar para atender esta solicitud, y qué principio se busca proteger en esta situación?",
    "opciones": [
      "La Política de Retención y Archivo, ya que la sentencia judicial anula la sanción y la información debe ser eliminada para cumplir con la normativa legal.",
      "La Política de Calidad de Datos, ya que la sentencia judicial anula la sanción y la información no es precisa y debe ser eliminada para cumplir con la política de calidad.",
      "La Política de Privacidad, ya que la sentencia judicial anula la sanción y la información del contribuyente debe ser eliminada para proteger su privacidad."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La Política de Retención y Archivo establece por cuánto tiempo se deben conservar los datos y cómo deben ser eliminados de forma segura. En este caso, la sentencia judicial anula la sanción y la información debe ser eliminada para cumplir con la normativa legal, lo que se enmarca en esta política del gobierno de datos."
  },
  {
    "id": "gdp2-11",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección General de la DIAN ha establecido una nueva política para la creación de reportes. La política exige que todos los reportes deben tener un campo que identifique la fuente de los datos, la fecha de extracción y la persona que generó el reporte. ¿Qué principio del gobierno de datos se busca proteger con esta política, y qué beneficio estratégico tiene para la DIAN?",
    "opciones": [
      "El principio de Disponibilidad, ya que la política garantiza que los reportes estén disponibles para todos los usuarios de la entidad.",
      "El principio de Integridad, ya que la política garantiza la trazabilidad y la fiabilidad de los datos en los reportes, lo que permite a la DIAN tomar decisiones basadas en información confiable.",
      "El principio de Usabilidad, ya que la política garantiza que los reportes sean útiles y fáciles de entender para todos los usuarios."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La política de creación de reportes con información de la fuente, la fecha de extracción y la persona que lo generó busca proteger el principio de Integridad. Esta política garantiza la trazabilidad y la fiabilidad de los datos en los reportes, lo que permite a la DIAN tomar decisiones basadas en información confiable, lo que es un beneficio estratégico para la entidad."
  },
  {
    "id": "gdp2-12",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II es parte de un equipo que está desarrollando una nueva aplicación para la fiscalización tributaria. La política de estandarización de datos de la DIAN exige que se utilice una convención de nombres estándar para todas las tablas y campos de la base de datos. ¿Qué pilar del gobierno de datos se está aplicando en esta situación, y qué beneficio tiene para la entidad?",
    "opciones": [
      "El pilar de Roles y Responsabilidades, ya que la convención de nombres define quién puede acceder a los datos según su rol.",
      "El pilar de Políticas y Estándares de Datos, ya que la convención de nombres estandariza los datos y facilita la interoperabilidad entre los sistemas de la entidad.",
      "El pilar de Tecnología y Herramientas, ya que la convención de nombres es una característica de la base de datos de la entidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La aplicación de una convención de nombres estándar para las tablas y campos de la base de datos es una manifestación del pilar de Políticas y Estándares de Datos del gobierno de datos. Esta estandarización de los datos facilita la interoperabilidad entre los sistemas de la entidad y la colaboración entre los equipos de la DIAN."
  },
  {
    "id": "gdp2-13",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Como Gestor II, usted es notificado sobre un incidente de seguridad que ha comprometido la confidencialidad de la información. El incidente fue mitigado, pero se requiere un análisis de la causa raíz. ¿Qué política de gobierno de datos le brinda las reglas y directrices para realizar este análisis, y qué principio se busca proteger en esta situación?",
    "opciones": [
      "La Política de Calidad de Datos, ya que se busca identificar la causa raíz de la falta de calidad de los datos de la entidad.",
      "La Política de Seguridad de la Información, ya que se busca identificar la causa raíz de la violación de la confidencialidad de la información de la entidad.",
      "La Política de Retención y Archivo, ya que se busca identificar la causa raíz de la falta de retención de los datos de la entidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Política de Seguridad de la Información es la que brinda las reglas y directrices para proteger la confidencialidad de la información. En este caso, el análisis de la causa raíz de la violación de la confidencialidad se enmarca en esta política del gobierno de datos, ya que se busca proteger la información de la entidad."
  },
  {
    "id": "gdp2-14",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II, en el desarrollo de sus funciones, identifica que la política de retención de datos para los registros de declaraciones aduaneras no ha sido actualizada en cinco años. Este hecho contraviene las nuevas regulaciones legales, lo que podría exponer a la DIAN a riesgos jurídicos. ¿Qué componente del gobierno de datos debe ser activado urgentemente para corregir esta situación?",
    "opciones": [
      "El componente de Tecnología y Herramientas, ya que es la plataforma la que no se ha actualizado con la nueva retención.",
      "El componente de Políticas y Estándares de Datos, ya que se debe actualizar la política de retención de datos para alinearla con la normativa legal vigente.",
      "El componente de Procesos y Procedimientos, ya que se debe modificar el flujo de trabajo para que los registros se borren o se archiven de acuerdo con la nueva retención."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El problema principal es que la 'política de retención de datos' está desactualizada y contraviene las regulaciones legales. El componente de Políticas y Estándares de Datos es el que define estas reglas. Por lo tanto, la acción más urgente es actualizar esta política, para luego modificar los procesos y procedimientos que la apliquen, y la tecnología que la soporte."
  },
  {
    "id": "gdp2-15",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Para la implementación de un nuevo sistema de información tributaria, se está documentando el 'Diccionario de Datos', que contendrá los metadatos de las bases de datos (definición de campos, tipos de datos, relaciones, etc.). ¿Qué principio fundamental del gobierno de datos se busca asegurar con esta documentación?",
    "opciones": [
      "El principio de Seguridad de la Información, al proteger los nombres de los campos de la base de datos de un posible acceso no autorizado.",
      "El principio de Disponibilidad, al hacer que la información esté disponible y accesible para todos los usuarios de la entidad.",
      "El principio de Usabilidad y Calidad de Datos, al asegurar que los datos sean comprensibles y consistentes para los desarrolladores y los usuarios finales."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "Documentar un 'Diccionario de Datos' asegura la Usabilidad y la Calidad de la información. Al definir los metadatos de las bases de datos, se garantiza que los datos sean comprensibles y que se utilicen de manera consistente en toda la entidad, lo que facilita la interoperabilidad entre sistemas y evita errores."
  },
  {
    "id": "gdp2-16",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II, en colaboración con el área de Legal de la DIAN, está definiendo una política para el uso de datos tributarios con fines de investigación académica, garantizando la anonimización de la información. ¿Qué pilar del gobierno de datos se está abordando, y qué principio se busca proteger principalmente?",
    "opciones": [
      "El pilar de Roles y Responsabilidades, ya que se están definiendo quiénes pueden usar los datos, protegiendo la confidencialidad.",
      "El pilar de Políticas y Estándares, ya que se está definiendo una regla para el uso de datos, protegiendo el principio de privacidad y confidencialidad.",
      "El pilar de Procesos y Procedimientos, ya que se está definiendo el flujo de trabajo para que los investigadores accedan a la información, protegiendo la seguridad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La definición de una 'política para el uso de datos' se enmarca en el pilar de Políticas y Estándares de Datos. Al mismo tiempo, el propósito de la anonimización es proteger el principio de privacidad y confidencialidad de la información tributaria, lo que es fundamental en la misionalidad de la DIAN."
  },
  {
    "id": "gdp2-17",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Impuestos, como Data Owner de la información tributaria, ha detectado que la nomenclatura de algunos campos en la base de datos no es consistente con el estándar institucional, lo que genera confusión en los analistas. ¿Qué rol, bajo el marco de gobierno de datos, es el encargado de asegurar que se implemente la estandarización de la nomenclatura en las bases de datos?",
    "opciones": [
      "El Data Custodian, porque es el responsable técnico de la infraestructura y debe realizar las correcciones.",
      "El Data Owner, porque al ser el dueño de los datos, es el que tiene la máxima autoridad para realizar la estandarización.",
      "El Data Steward, ya que es el rol que implementa las políticas del Data Owner y es responsable de velar por la estandarización y calidad de los datos."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "El Data Steward es el rol que se encarga de la implementación de las políticas definidas por el Data Owner. Aunque el Data Custodian puede realizar la corrección, el rol del Data Steward es el que supervisa y asegura que la estandarización se cumpla a nivel operativo, velando por la calidad y consistencia de los datos."
  },
  {
    "id": "gdp2-18",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II, en sus funciones de generación de reportes, observa que el mismo indicador de desempeño de la Dirección de Aduanas tiene dos valores diferentes en dos sistemas de información. Esta inconsistencia podría llevar a decisiones incorrectas. ¿Qué principio fundamental del gobierno de datos se está violando en esta situación?",
    "opciones": [
      "El principio de Disponibilidad, al no poder acceder al valor real del indicador de la entidad.",
      "El principio de Usabilidad, ya que la información del indicador no es útil para la toma de decisiones de la Dirección.",
      "El principio de Integridad y Consistencia, ya que la misma información tiene valores diferentes en dos sistemas, lo que compromete su confiabilidad."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La Integridad y la Consistencia son principios fundamentales del gobierno de datos. La integridad se refiere a la fiabilidad de los datos, mientras que la consistencia significa que el mismo dato debe ser igual en todas las fuentes. Dos valores diferentes para el mismo indicador violan directamente este principio, lo que compromete la confiabilidad de la información."
  },
  {
    "id": "gdp2-19",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Impuestos, como Data Owner, necesita tener una visión completa de todos los datos que posee en un solo lugar. ¿Qué principio fundamental del gobierno de datos permite la consolidación de todos los datos en un solo repositorio, asegurando su fiabilidad para la toma de decisiones?",
    "opciones": [
      "El principio de Usabilidad, al hacer que los datos sean útiles para la Dirección de Gestión de Impuestos.",
      "El principio de Disponibilidad, al garantizar que los datos estén siempre accesibles para la Dirección de Gestión de Impuestos.",
      "El principio de Integridad, al garantizar que los datos sean veraces, completos y consistentes en un solo repositorio."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "El principio de Integridad se refiere a que los datos sean veraces, completos y consistentes. La consolidación de datos en un solo repositorio, para que el Data Owner tenga una visión completa y fiable, se basa en la integridad de la información, ya que un repositorio con datos inconsistentes no sería útil para la toma de decisiones."
  },

  
  {
    "id": "gdp2-20",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II, en el marco de la implementación de una nueva política de calidad de datos, identifica que un proceso de captura manual de declaraciones aduaneras en una seccional está generando un 15% de errores en un campo crítico. La Dirección de Aduanas, como dueña de los datos, exige una solución rápida. ¿Qué acción debe priorizar el Gestor II en coordinación con el Data Steward?",
    "opciones": [
      "Proceder a llenar los valores nulos con un valor por defecto o un valor estimado para cumplir con la completitud de la política de datos.",
      "Identificar la causa raíz del error de captura, documentar los registros afectados, y proponer un proceso de corrección de datos para los registros futuros, mientras se notifica la limitación de la información a los analistas de fiscalización.",
      "Informar al Data Owner que la corrección de los valores nulos tomará tiempo y que los analistas de fiscalización deberán esperar la corrección para realizar las auditorías."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La política de calidad de datos no permite llenar valores nulos con valores por defecto o estimados, ya que esto compromete la integridad y la precisión de la información. La acción más estratégica es identificar la causa raíz, documentar el problema y proponer un plan de corrección sin afectar la integridad, mientras se notifica la limitación de la información para la toma de decisiones."
  },
  {
    "id": "gdp2-21",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Fiscalización, al desarrollar un modelo predictivo de evasión, requiere acceder a datos sensibles de contribuyentes de la Dirección de Gestión de Impuestos. La política de privacidad establece que el acceso debe ser justificado y aprobado. ¿Qué componente del gobierno de datos, más allá del permiso del Data Owner, garantiza que este acceso se realice de forma controlada, segura y auditable?",
    "opciones": [
      "Los Roles y Responsabilidades, que definen quién puede acceder a los datos según su cargo.",
      "Los Procesos y Procedimientos, que establecen los flujos de trabajo detallados para la solicitud, aprobación y registro de accesos a datos sensibles.",
      "La Tecnología y Herramientas, que proveen la infraestructura para el acceso seguro a los datos de la entidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Aunque la tecnología provee la infraestructura y los roles definen las responsabilidades, los Procesos y Procedimientos son el componente que establece el flujo de trabajo controlado, seguro y auditable para la solicitud y registro del acceso a datos sensibles. Esto asegura que cada paso sea rastreable y que se cumplan las políticas establecidas."
  },
  {
    "id": "gdp2-22",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II, en el desarrollo de un reporte analítico para la Dirección de Gestión de Aduanas, identifica que una variable clave no cumple con la Política de Estandarización de Nomenclatura. Cambiarla afectaría la compatibilidad con reportes históricos, pero no hacerlo generaría inconsistencia con los nuevos estándares. ¿Qué acción debe tomar el Gestor II para conciliar la necesidad de estandarización con la utilidad de los datos históricos?",
    "opciones": [
      "Continuar usando la nomenclatura antigua en el nuevo reporte para mantener la compatibilidad con los datos históricos.",
      "Aplicar la nueva nomenclatura en el reporte y crear una tabla de referencia que mapee los valores antiguos y nuevos, documentando la decisión para futuras consultas.",
      "Generar dos versiones del reporte, una con la nomenclatura antigua para datos históricos y otra con la nueva para datos actuales."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La mejor práctica de gobierno de datos es aplicar los nuevos estándares y gestionar la compatibilidad a través de herramientas de mapeo o tablas de referencia. Crear una tabla que asocie los valores antiguos con los nuevos permite mantener la estandarización sin perder la trazabilidad de la información histórica, lo cual demuestra un manejo diligente de la política de datos."
  },
  {
    "id": "gdp2-23",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Aduanas, como Dueña de los Datos, requiere acceso en tiempo real a la información de declaraciones de exportación. La Dirección de Gestión de Tecnología y Telecomunicaciones (Custodio) señala que la infraestructura actual solo permite una actualización cada 24 horas, lo que compromete la oportunidad de los datos. ¿Qué principio de la Política de Calidad de Datos es el más afectado en este escenario?",
    "opciones": [
      "El principio de Precisión, ya que la información del reporte no es 100% veraz debido al retraso.",
      "El principio de Validez, ya que la información no cumple con las reglas de negocio de la Dirección de Aduanas.",
      "El principio de Oportunidad, ya que la información no está disponible en tiempo real, lo cual es crítico para la toma de decisiones en la fiscalización de aduanas."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "El principio de Oportunidad de la Política de Calidad de Datos se refiere a que la información debe estar disponible en el momento en que se necesite para la toma de decisiones. Un retraso de 24 horas compromete directamente este principio, lo cual es crítico para el control aduanero que requiere información en tiempo real para ser efectivo."
  },
  {
    "id": "gdp2-24",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II, en su rol de mantenimiento de la arquitectura de datos, identifica que un proceso de borrado de información en un sistema de impuestos no cumple con la Política de Retención y Archivo de la DIAN. En lugar de archivar los datos, el sistema los elimina permanentemente. ¿Cuál es el riesgo más grave para la misionalidad de la DIAN si no se corrige este proceso?",
    "opciones": [
      "El riesgo de que la información eliminada no pueda ser restaurada para el cumplimiento de una auditoría interna en la entidad.",
      "El riesgo de que la información eliminada pueda ser usada por terceros para fines maliciosos, comprometiendo la confidencialidad de la información.",
      "El riesgo de que se violen los requisitos legales y regulatorios de retención de datos, lo que podría afectar la capacidad de la DIAN de defenderse en litigios o de responder a requerimientos judiciales."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La Política de Retención y Archivo de datos busca garantizar el cumplimiento de los requisitos legales y regulatorios. Si un proceso de borrado no cumple con esta política, la DIAN podría perder información que, por ley, debe conservar para fines de auditoría, investigación o defensa en litigios. La violación de estos requisitos es el riesgo más grave para la entidad, ya que podría afectar su capacidad de operar legalmente."
  },
  {
    "id": "gdp2-25",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II debe crear un reporte para la Dirección General que combine información de recaudo tributario con datos de fiscalización. Los datos de ambas fuentes han sido validados y cumplen con las políticas de calidad de datos, pero no se pueden combinar debido a inconsistencias en el formato de los identificadores de contribuyentes. ¿Qué política se debe priorizar para resolver este problema y permitir la generación del reporte?",
    "opciones": [
      "La Política de Seguridad, para proteger los identificadores de los contribuyentes y evitar su alteración.",
      "La Política de Privacidad, para garantizar que los identificadores de los contribuyentes no sean usados para fines no autorizados.",
      "La Política de Estandarización y Nomenclatura, para definir un formato único de identificadores y asegurar la coherencia de los datos entre los sistemas de la entidad."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La inconsistencia en el formato de los identificadores de los contribuyentes es un problema de estandarización. La Política de Estandarización y Nomenclatura es la que define las reglas para la creación y el uso de un formato único de identificadores. La aplicación de esta política es la clave para resolver el problema de interoperabilidad y permitir la generación del reporte, fortaleciendo la misionalidad de la DIAN."
  },
  {
    "id": "gdp2-26",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II, en su rol de mantenimiento de la integridad de los datos, identifica una anomalía en un registro de una declaración aduanera. El registro tiene un campo 'Fecha de importación' que es posterior a un campo 'Fecha de pago' relacionado. Esta inconsistencia lógica podría ser un indicio de fraude. ¿Qué política de calidad de datos se está violando en esta situación?",
    "opciones": [
      "La política de Completitud, ya que el registro tiene valores que no son coherentes con las reglas de negocio de la entidad.",
      "La política de Consistencia, ya que los datos del registro no son iguales en todos los sistemas de la entidad.",
      "La política de Validez, ya que los datos del registro no cumplen con las reglas del negocio de la entidad y su lógica es incorrecta."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La política de Validez de los datos se encarga de asegurar que los datos cumplan con las reglas del negocio. Una fecha de importación posterior a una fecha de pago es una inconsistencia lógica que viola esta política. La corrección de este problema es fundamental para detectar fraudes y para que la DIAN cumpla con su misionalidad de control aduanero y fiscalización."
  },
  {
    "id": "gdp2-27",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Impuestos, como Data Owner de la información tributaria, solicita a la Dirección de Gestión de Tecnología y Telecomunicaciones, como Data Custodian, la creación de un nuevo repositorio de datos para un proyecto piloto. El Gestor II debe liderar el proyecto. ¿Qué política de gobierno de datos, además de las de seguridad, debe ser priorizada en el diseño de este nuevo repositorio para garantizar su fiabilidad y usabilidad?",
    "opciones": [
      "La Política de Retención y Archivo, para asegurar que los datos del proyecto piloto se eliminen al finalizar la iniciativa.",
      "La Política de Calidad de Datos, para asegurar que los datos del proyecto piloto sean veraces, completos y consistentes para la toma de decisiones.",
      "La Política de Privacidad, para asegurar que los datos del proyecto piloto sean anonimizados para proteger la privacidad de los contribuyentes."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La fiabilidad y la usabilidad de un nuevo repositorio de datos dependen directamente de la calidad de los datos que contiene. La Política de Calidad de Datos es la que define las reglas para asegurar que los datos sean veraces, completos y consistentes. Priorizar esta política en el diseño del repositorio garantiza que la información del proyecto piloto sea confiable y útil para la toma de decisiones de la entidad."
  },
  {
    "id": "gdp2-28",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II, en el marco de la implementación de la Política de Privacidad, está definiendo los procedimientos de anonimización para un conjunto de datos tributarios que será usado para un reporte estadístico. Se presenta un conflicto entre la necesidad de anonimización y la necesidad de mantener cierta granularidad de la información para la validez del análisis. ¿Qué acción debe tomar el Gestor II para resolver este conflicto?",
    "opciones": [
      "Priorizar la anonimización completa de los datos, ya que la política de privacidad es la más importante en la entidad.",
      "Priorizar la granularidad de los datos, ya que el reporte estadístico debe ser válido y la anonimización podría comprometer la misionalidad de la DIAN.",
      "Consultar con el Data Owner de la información tributaria para encontrar un equilibrio entre la anonimización de los datos y la granularidad necesaria para el análisis, asegurando que se cumpla con la política de privacidad sin comprometer la misionalidad."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La política de privacidad y la necesidad de granularidad para el análisis son dos principios del gobierno de datos que pueden entrar en conflicto. La acción correcta es consultar con el Data Owner de la información para encontrar un equilibrio entre ambos principios. El Data Owner, como responsable máximo, tiene la autoridad para definir cómo se debe manejar la información en esta situación, asegurando que se cumpla con la política de privacidad sin comprometer la misionalidad de la DIAN."
  },
  {
    "id": "gdp2-29",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II, en sus funciones de generación de reportes, observa que el mismo indicador de desempeño de la Dirección de Aduanas tiene dos valores diferentes en dos sistemas de información. Esta inconsistencia podría llevar a decisiones incorrectas. ¿Qué principio fundamental del gobierno de datos se está violando en esta situación?",
    "opciones": [
      "El principio de Disponibilidad, al no poder acceder al valor real del indicador de la entidad.",
      "El principio de Usabilidad, ya que la información del indicador no es útil para la toma de decisiones de la Dirección.",
      "El principio de Integridad y Consistencia, ya que la misma información tiene valores diferentes en dos sistemas, lo que compromete su confiabilidad."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La Integridad y la Consistencia son principios fundamentales del gobierno de datos. La integridad se refiere a la fiabilidad de los datos, mientras que la consistencia significa que el mismo dato debe ser igual en todas las fuentes. Dos valores diferentes para el mismo indicador violan directamente este principio, lo que compromete la confiabilidad de la información."
  },
  {
    "id": "gdp2-30",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Impuestos, como Data Owner, necesita tener una visión completa de todos los datos que posee en un solo lugar. ¿Qué principio fundamental del gobierno de datos permite la consolidación de todos los datos en un solo repositorio, asegurando su fiabilidad para la toma de decisiones?",
    "opciones": [
      "El principio de Usabilidad, al hacer que los datos sean útiles para la Dirección de Gestión de Impuestos.",
      "El principio de Disponibilidad, al garantizar que los datos estén siempre accesibles para la Dirección de Gestión de Impuestos.",
      "El principio de Integridad, al garantizar que los datos sean veraces, completos y consistentes en un solo repositorio."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "El principio de Integridad se refiere a que los datos sean veraces, completos y consistentes. La consolidación de datos en un solo repositorio, para que el Data Owner tenga una visión completa y fiable, se basa en la integridad de la información, ya que un repositorio con datos inconsistentes no sería útil para la toma de decisiones."
  },
  {
    "id": "gdp2-31",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Se ha detectado una fuga de información sensible de la DIAN, que ha afectado a miles de contribuyentes. Un auditor externo ha señalado que la fuga se debió a un error humano y a la falta de procedimientos de seguridad robustos. ¿Qué componente del gobierno de datos, de ser implementado correctamente, podría haber evitado este incidente, y por qué es una falla grave para la DIAN?",
    "opciones": [
      "Los Roles y Responsabilidades, ya que la falta de un rol específico para la seguridad de la información fue la causa del incidente.",
      "Las Políticas y Estándares de Datos, ya que la falta de una política de seguridad robusta fue la causa principal del incidente.",
      "Los Procesos y Procedimientos, ya que la falta de un flujo de trabajo claro para el manejo de la información sensible fue la causa del incidente, lo que compromete la confidencialidad de la información."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La falta de 'procedimientos de seguridad robustos' es la causa principal del incidente. El componente de Procesos y Procedimientos es el que define los flujos de trabajo para el manejo de la información sensible. Una fuga de información es una falla grave para la DIAN porque compromete la confidencialidad de la información y la confianza de los contribuyentes, lo que afecta directamente la misionalidad de seguridad fiscal."
  },
  {
    "id": "gdp2-32",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección General de la DIAN ha ordenado la creación de un 'Comité de Gobernanza de Datos' para supervisar la gestión de la información en la entidad. Este comité estará compuesto por un representante de cada Dirección de Gestión. ¿Qué rol de gobierno de datos debe tener el representante de la Dirección de Gestión de Impuestos en este comité, y cuál es su principal responsabilidad?",
    "opciones": [
      "El rol de Data Custodian, y su responsabilidad es asegurar la infraestructura tecnológica y la seguridad de los datos de la Dirección de Impuestos.",
      "El rol de Data Steward, y su responsabilidad es implementar las políticas de calidad y estandarización de los datos de la Dirección de Impuestos.",
      "El rol de Data Owner, y su responsabilidad es la de velar por la gestión de la información de la Dirección de Impuestos, definiendo las políticas y las reglas de uso de los datos."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La Dirección de Gestión de Impuestos es la responsable máxima de la información tributaria. Por lo tanto, su representante en el 'Comité de Gobernanza de Datos' tiene el rol de Data Owner, y su principal responsabilidad es la de velar por la gestión de la información de su Dirección, definiendo las políticas y las reglas de uso de los datos en la entidad."
  },
  {
    "id": "gdp2-33",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II se encuentra en un debate con un colega sobre la importancia del gobierno de datos en la DIAN. El colega argumenta que es una iniciativa 'burocrática' que solo ralentiza los procesos. ¿Cuál es el principal argumento que el Gestor II debería usar para rebatir esta afirmación, y qué beneficio estratégico tiene para la DIAN?",
    "opciones": [
      "El gobierno de datos es un marco de gestión que genera burocracia, pero es necesario para cumplir con la normativa legal de la entidad.",
      "El gobierno de datos, aunque puede parecer burocrático, es un marco de gestión que asegura la calidad, la integridad y la seguridad de los datos, lo que permite la toma de decisiones estratégicas y la eficiencia operativa.",
      "El gobierno de datos es un marco de gestión que solo se aplica a los datos sensibles de la entidad, y no a los datos de uso común, por lo que no genera burocracia en todos los procesos de la DIAN."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El gobierno de datos no es burocracia, es una disciplina de gestión que asegura la calidad, la integridad y la seguridad de los datos. Aunque puede parecer que ralentiza los procesos, en realidad los hace más eficientes al evitar errores, inconsistencias y problemas de seguridad. Este marco permite a la DIAN tomar decisiones estratégicas basadas en información confiable y de alta calidad."
  },
  {
    "id": "gdp2-34",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Fiscalización ha detectado que la información de una de sus bases de datos no es coherente con la información del Repositorio Único de Datos. Esta inconsistencia podría afectar el proceso de auditoría y la imposición de sanciones. ¿Qué pilar del gobierno de datos es el que se ha violado en esta situación, y qué rol o persona es la que debe liderar la corrección?",
    "opciones": [
      "El pilar de Tecnología y Herramientas, y el rol del Data Custodian es el que debe liderar la corrección.",
      "El pilar de Políticas y Estándares de Datos, y el rol del Data Steward es el que debe liderar la corrección.",
      "El pilar de Roles y Responsabilidades, y el rol del Data Owner es el que debe liderar la corrección."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La inconsistencia de la información viola el pilar de Políticas y Estándares de Datos. El rol que se encarga de la implementación de estas políticas y de la estandarización de los datos es el Data Steward, por lo que es el que debe liderar la corrección en la organización, bajo la supervisión del Data Owner."
  },
  {
    "id": "gdp2-35",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II es notificado de que un ataque cibernético ha afectado la integridad de una base de datos de comercio exterior. Se han alterado los registros y se han borrado algunos. La Dirección General exige una respuesta inmediata. ¿Qué pilar del gobierno de datos se ha comprometido en esta situación, y qué es lo que se busca proteger con la implementación de un plan de recuperación de datos?",
    "opciones": [
      "El pilar de Usabilidad, y se busca proteger la integridad y la consistencia de los datos en la entidad.",
      "El pilar de Seguridad de la Información, y se busca proteger la integridad y la disponibilidad de los datos en la entidad.",
      "El pilar de Disponibilidad, y se busca proteger la confidencialidad de la información en la entidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Un ataque cibernético que afecta la integridad de una base de datos y borra algunos registros compromete el pilar de Seguridad de la Información. La implementación de un plan de recuperación de datos busca proteger la integridad y la disponibilidad de la información, para que la DIAN pueda seguir operando y cumpliendo con su misionalidad de control aduanero."
  },
  {
    "id": "gdp2-36",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Aduanas, como Dueña de los Datos de su área, ha solicitado a la Dirección de Gestión de Tecnología y Telecomunicaciones, como Custodio de los Datos, la implementación de un nuevo sistema de monitoreo de la calidad de los datos. ¿Qué rol o persona es la que debe liderar este proyecto, y qué componente del gobierno de datos se busca fortalecer?",
    "opciones": [
      "El Gestor II, y se busca fortalecer el pilar de Tecnología y Herramientas del gobierno de datos.",
      "El Data Steward, y se busca fortalecer el pilar de Roles y Responsabilidades del gobierno de datos.",
      "El Data Owner, y se busca fortalecer el pilar de Políticas y Estándares de Datos del gobierno de datos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La implementación de un sistema de monitoreo de la calidad de los datos es una iniciativa tecnológica. Por lo tanto, el Gestor II, en su rol en la Dirección de Tecnología, es el que debe liderar el proyecto. Esta iniciativa busca fortalecer el pilar de Tecnología y Herramientas del gobierno de datos, ya que es la infraestructura que soporta la gestión de la información."
  },
  {
    "id": "gdp2-37",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II, en colaboración con el área de Legal de la DIAN, está definiendo una política de retención de datos para los registros de contribuyentes. ¿Qué componente del gobierno de datos es el que se está desarrollando, y qué principio se busca proteger principalmente en esta situación?",
    "opciones": [
      "El componente de Políticas y Estándares de Datos, y se busca proteger el principio de privacidad y confidencialidad.",
      "El componente de Procesos y Procedimientos, y se busca proteger el principio de seguridad de la información.",
      "El componente de Roles y Responsabilidades, y se busca proteger el principio de integridad."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La definición de una 'política de retención de datos' se enmarca en el componente de Políticas y Estándares de Datos. Al mismo tiempo, al definir cuánto tiempo se deben conservar los datos de los contribuyentes, se busca proteger el principio de privacidad y confidencialidad de la información, lo que es fundamental en la misionalidad de la DIAN."
  },
  {
    "id": "gdp2-38",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección General de la DIAN ha ordenado la creación de un 'Comité de Gobernanza de Datos' para supervisar la gestión de la información en la entidad. Este comité estará compuesto por un representante de cada Dirección de Gestión. ¿Qué rol de gobierno de datos debe tener el representante de la Dirección de Gestión de Impuestos en este comité, y cuál es su principal responsabilidad?",
    "opciones": [
      "El rol de Data Custodian, y su responsabilidad es asegurar la infraestructura tecnológica y la seguridad de los datos de la Dirección de Impuestos.",
      "El rol de Data Steward, y su responsabilidad es implementar las políticas de calidad y estandarización de los datos de la Dirección de Impuestos.",
      "El rol de Data Owner, y su responsabilidad es la de velar por la gestión de la información de la Dirección de Impuestos, definiendo las políticas y las reglas de uso de los datos."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La Dirección de Gestión de Impuestos es la responsable máxima de la información tributaria. Por lo tanto, su representante en el 'Comité de Gobernanza de Datos' tiene el rol de Data Owner, y su principal responsabilidad es la de velar por la gestión de la información de su Dirección, definiendo las políticas y las reglas de uso de los datos en la entidad."
  },
  {
    "id": "gdp2-39",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II se encuentra en un debate con un colega sobre la importancia del gobierno de datos en la DIAN. El colega argumenta que es una iniciativa 'burocrática' que solo ralentiza los procesos. ¿Cuál es el principal argumento que el Gestor II debería usar para rebatir esta afirmación, y qué beneficio estratégico tiene para la DIAN?",
    "opciones": [
      "El gobierno de datos es un marco de gestión que genera burocracia, pero es necesario para cumplir con la normativa legal de la entidad.",
      "El gobierno de datos, aunque puede parecer burocrático, es un marco de gestión que asegura la calidad, la integridad y la seguridad de los datos, lo que permite la toma de decisiones estratégicas y la eficiencia operativa.",
      "El gobierno de datos es un marco de gestión que solo se aplica a los datos sensibles de la entidad, y no a los datos de uso común, por lo que no genera burocracia en todos los procesos de la DIAN."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El gobierno de datos no es burocracia, es una disciplina de gestión que asegura la calidad, la integridad y la seguridad de los datos. Aunque puede parecer que ralentiza los procesos, en realidad los hace más eficientes al evitar errores, inconsistencias y problemas de seguridad. Este marco permite a la DIAN tomar decisiones estratégicas basadas en información confiable y de alta calidad."
  },
  {
    "id": "gdp2-40",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Fiscalización ha detectado que la información de una de sus bases de datos no es coherente con la información del Repositorio Único de Datos. Esta inconsistencia podría afectar el proceso de auditoría y la imposición de sanciones. ¿Qué pilar del gobierno de datos es el que se ha violado en esta situación, y qué rol o persona es la que debe liderar la corrección?",
    "opciones": [
      "El pilar de Tecnología y Herramientas, y el rol del Data Custodian es el que debe liderar la corrección.",
      "El pilar de Políticas y Estándares de Datos, y el rol del Data Steward es el que debe liderar la corrección.",
      "El pilar de Roles y Responsabilidades, y el rol del Data Owner es el que debe liderar la corrección."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La inconsistencia de la información viola el pilar de Políticas y Estándares de Datos. El rol que se encarga de la implementación de estas políticas y de la estandarización de los datos es el Data Steward, por lo que es el que debe liderar la corrección en la organización, bajo la supervisión del Data Owner."
  },
  {
    "id": "gdp2-41",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II es notificado de que un ataque cibernético ha afectado la integridad de una base de datos de comercio exterior. Se han alterado los registros y se han borrado algunos. La Dirección General exige una respuesta inmediata. ¿Qué pilar del gobierno de datos se ha comprometido en esta situación, y qué es lo que se busca proteger con la implementación de un plan de recuperación de datos?",
    "opciones": [
      "El pilar de Usabilidad, y se busca proteger la integridad y la consistencia de los datos en la entidad.",
      "El pilar de Seguridad de la Información, y se busca proteger la integridad y la disponibilidad de los datos en la entidad.",
      "El pilar de Disponibilidad, y se busca proteger la confidencialidad de la información en la entidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Un ataque cibernético que afecta la integridad de una base de datos y borra algunos registros compromete el pilar de Seguridad de la Información. La implementación de un plan de recuperación de datos busca proteger la integridad y la disponibilidad de la información, para que la DIAN pueda seguir operando y cumpliendo con su misionalidad de control aduanero."
  },
  {
    "id": "gdp2-42",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Aduanas, como Dueña de los Datos de su área, ha solicitado a la Dirección de Gestión de Tecnología y Telecomunicaciones, como Custodio de los Datos, la implementación de un nuevo sistema de monitoreo de la calidad de los datos. ¿Qué rol o persona es la que debe liderar este proyecto, y qué componente del gobierno de datos se busca fortalecer?",
    "opciones": [
      "El Gestor II, y se busca fortalecer el pilar de Tecnología y Herramientas del gobierno de datos.",
      "El Data Steward, y se busca fortalecer el pilar de Roles y Responsabilidades del gobierno de datos.",
      "El Data Owner, y se busca fortalecer el pilar de Políticas y Estándares de Datos del gobierno de datos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La implementación de un sistema de monitoreo de la calidad de los datos es una iniciativa tecnológica. Por lo tanto, el Gestor II, en su rol en la Dirección de Tecnología, es el que debe liderar el proyecto. Esta iniciativa busca fortalecer el pilar de Tecnología y Herramientas del gobierno de datos, ya que es la infraestructura que soporta la gestión de la información."
  },
  {
    "id": "gdp2-43",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II, en colaboración con el área de Legal de la DIAN, está definiendo una política de retención de datos para los registros de contribuyentes. ¿Qué componente del gobierno de datos es el que se está desarrollando, y qué principio se busca proteger principalmente en esta situación?",
    "opciones": [
      "El componente de Políticas y Estándares de Datos, y se busca proteger el principio de privacidad y confidencialidad.",
      "El componente de Procesos y Procedimientos, y se busca proteger el principio de seguridad de la información.",
      "El componente de Roles y Responsabilidades, y se busca proteger el principio de integridad."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La definición de una 'política de retención de datos' se enmarca en el componente de Políticas y Estándares de Datos. Al mismo tiempo, al definir cuánto tiempo se deben conservar los datos de los contribuyentes, se busca proteger el principio de privacidad y confidencialidad de la información, lo que es fundamental en la misionalidad de la DIAN."
  },
  {
    "id": "gdp2-44",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección General de la DIAN ha ordenado la creación de un 'Comité de Gobernanza de Datos' para supervisar la gestión de la información en la entidad. Este comité estará compuesto por un representante de cada Dirección de Gestión. ¿Qué rol de gobierno de datos debe tener el representante de la Dirección de Gestión de Impuestos en este comité, y cuál es su principal responsabilidad?",
    "opciones": [
      "El rol de Data Custodian, y su responsabilidad es asegurar la infraestructura tecnológica y la seguridad de los datos de la Dirección de Impuestos.",
      "El rol de Data Steward, y su responsabilidad es implementar las políticas de calidad y estandarización de los datos de la Dirección de Impuestos.",
      "El rol de Data Owner, y su responsabilidad es la de velar por la gestión de la información de la Dirección de Impuestos, definiendo las políticas y las reglas de uso de los datos."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La Dirección de Gestión de Impuestos es la responsable máxima de la información tributaria. Por lo tanto, su representante en el 'Comité de Gobernanza de Datos' tiene el rol de Data Owner, y su principal responsabilidad es la de velar por la gestión de la información de su Dirección, definiendo las políticas y las reglas de uso de los datos en la entidad."
  },
  {
    "id": "gdp2-45",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II se encuentra en un debate con un colega sobre la importancia del gobierno de datos en la DIAN. El colega argumenta que es una iniciativa 'burocrática' que solo ralentiza los procesos. ¿Cuál es el principal argumento que el Gestor II debería usar para rebatir esta afirmación, y qué beneficio estratégico tiene para la DIAN?",
    "opciones": [
      "El gobierno de datos es un marco de gestión que genera burocracia, pero es necesario para cumplir con la normativa legal de la entidad.",
      "El gobierno de datos, aunque puede parecer burocrático, es un marco de gestión que asegura la calidad, la integridad y la seguridad de los datos, lo que permite la toma de decisiones estratégicas y la eficiencia operativa.",
      "El gobierno de datos es un marco de gestión que solo se aplica a los datos sensibles de la entidad, y no a los datos de uso común, por lo que no genera burocracia en todos los procesos de la DIAN."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El gobierno de datos no es burocracia, es una disciplina de gestión que asegura la calidad, la integridad y la seguridad de los datos. Aunque puede parecer que ralentiza los procesos, en realidad los hace más eficientes al evitar errores, inconsistencias y problemas de seguridad. Este marco permite a la DIAN tomar decisiones estratégicas basadas en información confiable y de alta calidad."
  },
  {
    "id": "gdp2-46",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Fiscalización ha detectado que la información de una de sus bases de datos no es coherente con la información del Repositorio Único de Datos. Esta inconsistencia podría afectar el proceso de auditoría y la imposición de sanciones. ¿Qué pilar del gobierno de datos es el que se ha violado en esta situación, y qué rol o persona es la que debe liderar la corrección?",
    "opciones": [
      "El pilar de Tecnología y Herramientas, y el rol del Data Custodian es el que debe liderar la corrección.",
      "El pilar de Políticas y Estándares de Datos, y el rol del Data Steward es el que debe liderar la corrección.",
      "El pilar de Roles y Responsabilidades, y el rol del Data Owner es el que debe liderar la corrección."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La inconsistencia de la información viola el pilar de Políticas y Estándares de Datos. El rol que se encarga de la implementación de estas políticas y de la estandarización de los datos es el Data Steward, por lo que es el que debe liderar la corrección en la organización, bajo la supervisión del Data Owner."
  },
  {
    "id": "gdp2-47",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II es notificado de que un ataque cibernético ha afectado la integridad de una base de datos de comercio exterior. Se han alterado los registros y se han borrado algunos. La Dirección General exige una respuesta inmediata. ¿Qué pilar del gobierno de datos se ha comprometido en esta situación, y qué es lo que se busca proteger con la implementación de un plan de recuperación de datos?",
    "opciones": [
      "El pilar de Usabilidad, y se busca proteger la integridad y la consistencia de los datos en la entidad.",
      "El pilar de Seguridad de la Información, y se busca proteger la integridad y la disponibilidad de los datos en la entidad.",
      "El pilar de Disponibilidad, y se busca proteger la confidencialidad de la información en la entidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Un ataque cibernético que afecta la integridad de una base de datos y borra algunos registros compromete el pilar de Seguridad de la Información. La implementación de un plan de recuperación de datos busca proteger la integridad y la disponibilidad de la información, para que la DIAN pueda seguir operando y cumpliendo con su misionalidad de control aduanero."
  },
  {
    "id": "gdp2-48",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Aduanas, como Dueña de los Datos de su área, ha solicitado a la Dirección de Gestión de Tecnología y Telecomunicaciones, como Custodio de los Datos, la implementación de un nuevo sistema de monitoreo de la calidad de los datos. ¿Qué rol o persona es la que debe liderar este proyecto, y qué componente del gobierno de datos se busca fortalecer?",
    "opciones": [
      "El Gestor II, y se busca fortalecer el pilar de Tecnología y Herramientas del gobierno de datos.",
      "El Data Steward, y se busca fortalecer el pilar de Roles y Responsabilidades del gobierno de datos.",
      "El Data Owner, y se busca fortalecer el pilar de Políticas y Estándares de Datos del gobierno de datos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La implementación de un sistema de monitoreo de la calidad de los datos es una iniciativa tecnológica. Por lo tanto, el Gestor II, en su rol en la Dirección de Tecnología, es el que debe liderar el proyecto. Esta iniciativa busca fortalecer el pilar de Tecnología y Herramientas del gobierno de datos, ya que es la infraestructura que soporta la gestión de la información."
  },
  {
    "id": "gdp2-49",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II, en colaboración con el área de Legal de la DIAN, está definiendo una política de retención de datos para los registros de contribuyentes. ¿Qué componente del gobierno de datos es el que se está desarrollando, y qué principio se busca proteger principalmente en esta situación?",
    "opciones": [
      "El componente de Políticas y Estándares de Datos, y se busca proteger el principio de privacidad y confidencialidad.",
      "El componente de Procesos y Procedimientos, y se busca proteger el principio de seguridad de la información.",
      "El componente de Roles y Responsabilidades, y se busca proteger el principio de integridad."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La definición de una 'política de retención de datos' se enmarca en el componente de Políticas y Estándares de Datos. Al mismo tiempo, al definir cuánto tiempo se deben conservar los datos de los contribuyentes, se busca proteger el principio de privacidad y confidencialidad de la información, lo que es fundamental en la misionalidad de la DIAN."
  },
  {
    "id": "gdp2-50",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección General de la DIAN ha ordenado la creación de un 'Comité de Gobernanza de Datos' para supervisar la gestión de la información en la entidad. Este comité estará compuesto por un representante de cada Dirección de Gestión. ¿Qué rol de gobierno de datos debe tener el representante de la Dirección de Gestión de Impuestos en este comité, y cuál es su principal responsabilidad?",
    "opciones": [
      "El rol de Data Custodian, y su responsabilidad es asegurar la infraestructura tecnológica y la seguridad de los datos de la Dirección de Impuestos.",
      "El rol de Data Steward, y su responsabilidad es implementar las políticas de calidad y estandarización de los datos de la Dirección de Impuestos.",
      "El rol de Data Owner, y su responsabilidad es la de velar por la gestión de la información de la Dirección de Impuestos, definiendo las políticas y las reglas de uso de los datos."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La Dirección de Gestión de Impuestos es la responsable máxima de la información tributaria. Por lo tanto, su representante en el 'Comité de Gobernanza de Datos' tiene el rol de Data Owner, y su principal responsabilidad es la de velar por la gestión de la información de su Dirección, definiendo las políticas y las reglas de uso de los datos en la entidad."
  },
  {
    "id": "gdp2-51",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II se encuentra en un debate con un colega sobre la importancia del gobierno de datos en la DIAN. El colega argumenta que es una iniciativa 'burocrática' que solo ralentiza los procesos. ¿Cuál es el principal argumento que el Gestor II debería usar para rebatir esta afirmación, y qué beneficio estratégico tiene para la DIAN?",
    "opciones": [
      "El gobierno de datos es un marco de gestión que genera burocracia, pero es necesario para cumplir con la normativa legal de la entidad.",
      "El gobierno de datos, aunque puede parecer burocrático, es un marco de gestión que asegura la calidad, la integridad y la seguridad de los datos, lo que permite la toma de decisiones estratégicas y la eficiencia operativa.",
      "El gobierno de datos es un marco de gestión que solo se aplica a los datos sensibles de la entidad, y no a los datos de uso común, por lo que no genera burocracia en todos los procesos de la DIAN."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El gobierno de datos no es burocracia, es una disciplina de gestión que asegura la calidad, la integridad y la seguridad de los datos. Aunque puede parecer que ralentiza los procesos, en realidad los hace más eficientes al evitar errores, inconsistencias y problemas de seguridad. Este marco permite a la DIAN tomar decisiones estratégicas basadas en información confiable y de alta calidad."
  },
  {
    "id": "gdp2-52",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Fiscalización ha detectado que la información de una de sus bases de datos no es coherente con la información del Repositorio Único de Datos. Esta inconsistencia podría afectar el proceso de auditoría y la imposición de sanciones. ¿Qué pilar del gobierno de datos es el que se ha violado en esta situación, y qué rol o persona es la que debe liderar la corrección?",
    "opciones": [
      "El pilar de Tecnología y Herramientas, y el rol del Data Custodian es el que debe liderar la corrección.",
      "El pilar de Políticas y Estándares de Datos, y el rol del Data Steward es el que debe liderar la corrección.",
      "El pilar de Roles y Responsabilidades, y el rol del Data Owner es el que debe liderar la corrección."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La inconsistencia de la información viola el pilar de Políticas y Estándares de Datos. El rol que se encarga de la implementación de estas políticas y de la estandarización de los datos es el Data Steward, por lo que es el que debe liderar la corrección en la organización, bajo la supervisión del Data Owner."
  },
  {
    "id": "gdp2-53",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II es notificado de que un ataque cibernético ha afectado la integridad de una base de datos de comercio exterior. Se han alterado los registros y se han borrado algunos. La Dirección General exige una respuesta inmediata. ¿Qué pilar del gobierno de datos se ha comprometido en esta situación, y qué es lo que se busca proteger con la implementación de un plan de recuperación de datos?",
    "opciones": [
      "El pilar de Usabilidad, y se busca proteger la integridad y la consistencia de los datos en la entidad.",
      "El pilar de Seguridad de la Información, y se busca proteger la integridad y la disponibilidad de los datos en la entidad.",
      "El pilar de Disponibilidad, y se busca proteger la confidencialidad de la información en la entidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Un ataque cibernético que afecta la integridad de una base de datos y borra algunos registros compromete el pilar de Seguridad de la Información. La implementación de un plan de recuperación de datos busca proteger la integridad y la disponibilidad de la información, para que la DIAN pueda seguir operando y cumpliendo con su misionalidad de control aduanero."
  },
  {
    "id": "gdp2-54",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Aduanas, como Dueña de los Datos de su área, ha solicitado a la Dirección de Gestión de Tecnología y Telecomunicaciones, como Custodio de los Datos, la implementación de un nuevo sistema de monitoreo de la calidad de los datos. ¿Qué rol o persona es la que debe liderar este proyecto, y qué componente del gobierno de datos se busca fortalecer?",
    "opciones": [
      "El Gestor II, y se busca fortalecer el pilar de Tecnología y Herramientas del gobierno de datos.",
      "El Data Steward, y se busca fortalecer el pilar de Roles y Responsabilidades del gobierno de datos.",
      "El Data Owner, y se busca fortalecer el pilar de Políticas y Estándares de Datos del gobierno de datos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La implementación de un sistema de monitoreo de la calidad de los datos es una iniciativa tecnológica. Por lo tanto, el Gestor II, en su rol en la Dirección de Tecnología, es el que debe liderar el proyecto. Esta iniciativa busca fortalecer el pilar de Tecnología y Herramientas del gobierno de datos, ya que es la infraestructura que soporta la gestión de la información."
  },
  {
    "id": "gdp2-55",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II, en colaboración con el área de Legal de la DIAN, está definiendo una política de retención de datos para los registros de contribuyentes. ¿Qué componente del gobierno de datos es el que se está desarrollando, y qué principio se busca proteger principalmente en esta situación?",
    "opciones": [
      "El componente de Políticas y Estándares de Datos, y se busca proteger el principio de privacidad y confidencialidad.",
      "El componente de Procesos y Procedimientos, y se busca proteger el principio de seguridad de la información.",
      "El componente de Roles y Responsabilidades, y se busca proteger el principio de integridad."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La definición de una 'política de retención de datos' se enmarca en el componente de Políticas y Estándares de Datos. Al mismo tiempo, al definir cuánto tiempo se deben conservar los datos de los contribuyentes, se busca proteger el principio de privacidad y confidencialidad de la información, lo que es fundamental en la misionalidad de la DIAN."
  },
  {
    "id": "gdp2-56",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección General de la DIAN ha ordenado la creación de un 'Comité de Gobernanza de Datos' para supervisar la gestión de la información en la entidad. Este comité estará compuesto por un representante de cada Dirección de Gestión. ¿Qué rol de gobierno de datos debe tener el representante de la Dirección de Gestión de Impuestos en este comité, y cuál es su principal responsabilidad?",
    "opciones": [
      "El rol de Data Custodian, y su responsabilidad es asegurar la infraestructura tecnológica y la seguridad de los datos de la Dirección de Impuestos.",
      "El rol de Data Steward, y su responsabilidad es implementar las políticas de calidad y estandarización de los datos de la Dirección de Impuestos.",
      "El rol de Data Owner, y su responsabilidad es la de velar por la gestión de la información de la Dirección de Impuestos, definiendo las políticas y las reglas de uso de los datos."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La Dirección de Gestión de Impuestos es la responsable máxima de la información tributaria. Por lo tanto, su representante en el 'Comité de Gobernanza de Datos' tiene el rol de Data Owner, y su principal responsabilidad es la de velar por la gestión de la información de su Dirección, definiendo las políticas y las reglas de uso de los datos en la entidad."
  },
  {
    "id": "gdp2-57",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II se encuentra en un debate con un colega sobre la importancia del gobierno de datos en la DIAN. El colega argumenta que es una iniciativa 'burocrática' que solo ralentiza los procesos. ¿Cuál es el principal argumento que el Gestor II debería usar para rebatir esta afirmación, y qué beneficio estratégico tiene para la DIAN?",
    "opciones": [
      "El gobierno de datos es un marco de gestión que genera burocracia, pero es necesario para cumplir con la normativa legal de la entidad.",
      "El gobierno de datos, aunque puede parecer burocrático, es un marco de gestión que asegura la calidad, la integridad y la seguridad de los datos, lo que permite la toma de decisiones estratégicas y la eficiencia operativa.",
      "El gobierno de datos es un marco de gestión que solo se aplica a los datos sensibles de la entidad, y no a los datos de uso común, por lo que no genera burocracia en todos los procesos de la DIAN."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El gobierno de datos no es burocracia, es una disciplina de gestión que asegura la calidad, la integridad y la seguridad de los datos. Aunque puede parecer que ralentiza los procesos, en realidad los hace más eficientes al evitar errores, inconsistencias y problemas de seguridad. Este marco permite a la DIAN tomar decisiones estratégicas basadas en información confiable y de alta calidad."
  },
  {
    "id": "gdp2-58",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Fiscalización ha detectado que la información de una de sus bases de datos no es coherente con la información del Repositorio Único de Datos. Esta inconsistencia podría afectar el proceso de auditoría y la imposición de sanciones. ¿Qué pilar del gobierno de datos es el que se ha violado en esta situación, y qué rol o persona es la que debe liderar la corrección?",
    "opciones": [
      "El pilar de Tecnología y Herramientas, y el rol del Data Custodian es el que debe liderar la corrección.",
      "El pilar de Políticas y Estándares de Datos, y el rol del Data Steward es el que debe liderar la corrección.",
      "El pilar de Roles y Responsabilidades, y el rol del Data Owner es el que debe liderar la corrección."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La inconsistencia de la información viola el pilar de Políticas y Estándares de Datos. El rol que se encarga de la implementación de estas políticas y de la estandarización de los datos es el Data Steward, por lo que es el que debe liderar la corrección en la organización, bajo la supervisión del Data Owner."
  },
  {
    "id": "gdp2-59",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II es notificado de que un ataque cibernético ha afectado la integridad de una base de datos de comercio exterior. Se han alterado los registros y se han borrado algunos. La Dirección General exige una respuesta inmediata. ¿Qué pilar del gobierno de datos se ha comprometido en esta situación, y qué es lo que se busca proteger con la implementación de un plan de recuperación de datos?",
    "opciones": [
      "El pilar de Usabilidad, y se busca proteger la integridad y la consistencia de los datos en la entidad.",
      "El pilar de Seguridad de la Información, y se busca proteger la integridad y la disponibilidad de los datos en la entidad.",
      "El pilar de Disponibilidad, y se busca proteger la confidencialidad de la información en la entidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Un ataque cibernético que afecta la integridad de una base de datos y borra algunos registros compromete el pilar de Seguridad de la Información. La implementación de un plan de recuperación de datos busca proteger la integridad y la disponibilidad de la información, para que la DIAN pueda seguir operando y cumpliendo con su misionalidad de control aduanero."
  },
  {
    "id": "gdp2-60",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Aduanas, como Dueña de los Datos de su área, ha solicitado a la Dirección de Gestión de Tecnología y Telecomunicaciones, como Custodio de los Datos, la implementación de un nuevo sistema de monitoreo de la calidad de los datos. ¿Qué rol o persona es la que debe liderar este proyecto, y qué componente del gobierno de datos se busca fortalecer?",
    "opciones": [
      "El Gestor II, y se busca fortalecer el pilar de Tecnología y Herramientas del gobierno de datos.",
      "El Data Steward, y se busca fortalecer el pilar de Roles y Responsabilidades del gobierno de datos.",
      "El Data Owner, y se busca fortalecer el pilar de Políticas y Estándares de Datos del gobierno de datos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La implementación de un sistema de monitoreo de la calidad de los datos es una iniciativa tecnológica. Por lo tanto, el Gestor II, en su rol en la Dirección de Tecnología, es el que debe liderar el proyecto. Esta iniciativa busca fortalecer el pilar de Tecnología y Herramientas del gobierno de datos, ya que es la infraestructura que soporta la gestión de la información."
  },

  {
    "id": "gdp2-61",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II detecta que la política de retención de datos para los registros de declaraciones de aduanas, que por normativa legal deben conservarse por 10 años, ha sido modificada internamente a solo 5 años. Esta modificación se hizo sin la aprobación de la Dirección de Gestión Jurídica. ¿Qué tipo de riesgo institucional está generando esta acción y qué política es la más directamente comprometida?",
    "opciones": [
      "Un riesgo operativo, ya que la modificación no tiene el aval de la Dirección de Aduanas, lo cual puede generar inconsistencias en los registros de la entidad.",
      "Un riesgo legal y de cumplimiento, ya que la política de retención contraviene la normativa legal, lo que compromete la capacidad de la DIAN para responder a requerimientos judiciales o regulatorios.",
      "Un riesgo tecnológico, porque la modificación de la política de retención afecta la infraestructura de almacenamiento y la disponibilidad de los datos históricos de la entidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Política de Retención y Archivo de datos se rige por los requisitos legales y regulatorios. Si la política interna de la DIAN contraviene la normativa legal (ej. Ley General de Archivos), se genera un riesgo legal y de cumplimiento. Este riesgo es grave para la misionalidad de la DIAN, ya que podría enfrentar sanciones o la imposibilidad de defenderse en un litigio por la falta de información."
  },
  {
    "id": "gdp2-62",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Impuestos, como Data Owner de la información tributaria, ha ordenado la creación de un reporte que requiere un campo que identifica el 'Tipo de Contribuyente' como 'Persona Natural' o 'Persona Jurídica'. Sin embargo, al crear el reporte, el Gestor II identifica que el campo en la base de datos solo permite valores como '01' y '02', sin una descripción. ¿Qué tipo de política de calidad de datos es la que se está violando en esta situación, y qué es lo que se busca proteger con su corrección?",
    "opciones": [
      "La política de Consistencia, ya que la información del campo no es coherente con el resto de los datos de la entidad.",
      "La política de Completitud, ya que el campo no tiene una descripción y no se puede entender su significado.",
      "La política de Usabilidad, ya que la falta de un diccionario de datos que explique el significado del campo dificulta que los analistas de la entidad utilicen la información de manera correcta."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La Usabilidad es un principio de la política de calidad de datos que asegura que la información sea comprensible y útil para todos los usuarios. La falta de una descripción para los valores de un campo (como '01' y '02') hace que la información no sea usable y podría llevar a errores en los reportes y en la toma de decisiones. La corrección de este problema protege la usabilidad de la información."
  },
  {
    "id": "gdp2-63",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II detecta que el sistema de auditoría de acceso a bases de datos de la DIAN no está registrando de forma completa las consultas realizadas por ciertos usuarios. Aunque se registra el acceso, no se registra el detalle de los campos consultados, lo que podría dificultar una investigación en caso de una fuga de información. ¿Qué política de seguridad de la información es la más directamente comprometida por esta falla de registro?",
    "opciones": [
      "La política de Disponibilidad, ya que la falta de registro podría hacer que la información no esté disponible para una investigación.",
      "La política de Integridad, ya que la falta de registro podría hacer que los datos sean alterados sin que se pueda detectar.",
      "La política de Confidencialidad, ya que la falta de un registro completo dificulta la trazabilidad de la información y la identificación de responsables en caso de una fuga."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La política de Confidencialidad se encarga de proteger la información sensible de un acceso no autorizado o de su divulgación. Una falla en el sistema de auditoría que no registra de forma completa las consultas dificulta la trazabilidad de la información y la identificación de los responsables en caso de una fuga, lo que compromete la confidencialidad de la información y la confianza de los contribuyentes."
  },
  {
    "id": "gdp2-64",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II, en el marco de la implementación de la Arquitectura Digital de la DIAN, se encuentra con una base de datos que tiene un campo 'NIT' con valores numéricos y alfanuméricos. El nuevo estándar de la Arquitectura Digital establece que el NIT debe ser un valor numérico. ¿Qué acción debe tomar el Gestor II para conciliar la necesidad de estandarización con la validez de los datos históricos?",
    "opciones": [
      "Modificar todos los valores alfanuméricos a un valor numérico por defecto, ya que el estándar de la Arquitectura Digital es prioritario en la entidad.",
      "Proponer al Data Owner de la información una estrategia para migrar los datos históricos y definir un proceso de validación para los nuevos registros, asegurando que se cumpla con el estándar de la Arquitectura Digital sin comprometer la integridad de la información.",
      "Eliminar todos los registros con valores alfanuméricos en el campo 'NIT', ya que no cumplen con el nuevo estándar y no se pueden utilizar para la toma de decisiones de la entidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Arquitectura Digital de la DIAN se basa en la interoperabilidad de los sistemas y la consistencia de los datos. El Gestor II debe proponer una estrategia que concilie la necesidad de estandarización con la validez de los datos históricos. La migración de los datos históricos y la validación de los nuevos registros es la acción más adecuada para asegurar que se cumpla con el estándar de la Arquitectura Digital sin comprometer la integridad de la información."
  },
  {
    "id": "gdp2-65",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Aduanas, como Dueña de los Datos de su área, ha solicitado un reporte analítico que requiere combinar información de las bases de datos de aduanas con datos de terceros (ej. información de transporte y logística). El reporte es crucial para la detección de contrabando. ¿Qué política de gobierno de datos se debe priorizar al integrar estos datos de terceros en los sistemas de la DIAN?",
    "opciones": [
      "La Política de Nomenclatura, para asegurar que los nombres de los campos de los datos de terceros sean consistentes con los de la DIAN.",
      "La Política de Calidad de Datos, para asegurar que los datos de terceros sean veraces, completos y consistentes antes de ser integrados en el repositorio.",
      "La Política de Seguridad de la Información, para proteger la confidencialidad de la información de los terceros y evitar que se divulgue de forma no autorizada."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La calidad de los datos de terceros es fundamental para la fiabilidad de un reporte analítico. Si se integran datos de terceros que no cumplen con la política de calidad de la DIAN, el reporte podría llevar a decisiones incorrectas. Por lo tanto, la Política de Calidad de Datos es la que se debe priorizar al integrar estos datos en los sistemas de la DIAN."
  },
  {
    "id": "gdp2-66",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II, en su rol de mantenimiento de la integridad de los datos, identifica una inconsistencia lógica en un registro de una declaración de impuestos. El registro tiene una fecha de pago anterior a la fecha de la declaración. Esta anomalía no es un error de digitación, sino un indicio de un posible fraude. ¿Qué rol de gobierno de datos debe ser el primero en tomar una decisión de alto nivel sobre la investigación de esta inconsistencia?",
    "opciones": [
      "El Data Custodian, porque es la persona que se encarga de la custodia y el almacenamiento de los datos de la entidad.",
      "El Data Steward, porque es el rol que implementa las políticas y la estandarización de los datos de la entidad.",
      "El Data Owner, porque es la máxima autoridad responsable de la gestión de la información, y tiene la autoridad para definir las acciones a seguir en caso de un posible fraude."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La inconsistencia lógica en un registro que podría ser un indicio de un posible fraude requiere una decisión de alto nivel. El Data Owner, como responsable máximo del conjunto de datos, es el que tiene la autoridad para definir las acciones a seguir en esta situación, como iniciar una investigación o notificar a la Dirección de Gestión de Fiscalización."
  },
  {
    "id": "gdp2-67",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II es parte de un equipo que está diseñando la 'Arquitectura Digital de la DIAN'. El equipo discute sobre la necesidad de definir los flujos de trabajo para la recolección de datos de los contribuyentes, desde su captura hasta su almacenamiento en el Repositorio Único de Datos. ¿Qué componente del gobierno de datos se está desarrollando con esta iniciativa?",
    "opciones": [
      "Las Políticas y Estándares de Datos, ya que se están definiendo las reglas para la recolección de los datos de la entidad.",
      "Los Procesos y Procedimientos, que establecen el flujo de trabajo para la recolección y el almacenamiento de los datos de la entidad.",
      "Los Roles y Responsabilidades, ya que se están asignando las responsabilidades de la recolección de los datos de la entidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Los Procesos y Procedimientos son los flujos de trabajo definidos para la gestión de los datos a lo largo de su ciclo de vida. El diseño de los flujos de trabajo para la recolección de los datos de los contribuyentes se enmarca en este componente del gobierno de datos, ya que establece el paso a paso para la recolección y el almacenamiento de la información."
  },
  {
    "id": "gdp2-68",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Impuestos, como Data Owner de la información tributaria, ha detectado que una de sus bases de datos no es consistente con el resto de los sistemas de la DIAN. Esta inconsistencia podría afectar la toma de decisiones estratégicas. ¿Qué política de calidad de datos se está violando en esta situación, y qué es lo que se busca proteger con su corrección?",
    "opciones": [
      "La política de Consistencia, ya que la información de la base de datos no es igual en todos los sistemas de la entidad, lo que compromete la fiabilidad de la información.",
      "La política de Completitud, ya que la base de datos no tiene la información completa de la entidad, lo que afecta la toma de decisiones.",
      "La política de Precisión, ya que la información de la base de datos no es veraz, lo que compromete la validez de los reportes."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La política de Consistencia se encarga de asegurar que el mismo dato tenga el mismo valor en todos los sistemas de la entidad. La inconsistencia de la información de la base de datos con el resto de los sistemas viola esta política y compromete la fiabilidad de la información, lo que podría llevar a decisiones estratégicas incorrectas."
  },
  {
    "id": "gdp2-69",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II es parte de un equipo que está diseñando un nuevo sistema de información para la gestión de aduanas. La política de seguridad de la DIAN exige que se implemente un control de acceso basado en roles para el sistema. ¿Qué principio del gobierno de datos se busca proteger con esta política, y qué beneficio estratégico tiene para la DIAN?",
    "opciones": [
      "El principio de Integridad, ya que el control de acceso basado en roles protege la integridad de los datos de la entidad.",
      "El principio de Confidencialidad, ya que el control de acceso basado en roles protege la información de un acceso no autorizado, lo que fortalece la seguridad fiscal de la entidad.",
      "El principio de Disponibilidad, ya que el control de acceso basado en roles garantiza que los datos estén disponibles para los usuarios de la entidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El control de acceso basado en roles es una política de seguridad de la información que protege la confidencialidad de la información, ya que solo el personal autorizado puede acceder a los datos. La implementación de esta política fortalece la seguridad fiscal de la DIAN, lo que es un beneficio estratégico para la misionalidad de la entidad."
  },
  {
    "id": "gdp2-70",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Fiscalización ha solicitado al Subproceso de Procesamiento de Datos un reporte que requiere combinar información de las bases de datos de aduanas y de impuestos para la detección de contrabando. La política de estandarización de datos de la DIAN exige que los identificadores de contribuyentes sean consistentes en todos los sistemas. ¿Qué principio del gobierno de datos se está aplicando en esta situación, y qué beneficio estratégico tiene para la DIAN?",
    "opciones": [
      "El principio de Usabilidad, ya que la estandarización de los identificadores de los contribuyentes hace que los reportes sean útiles para la toma de decisiones.",
      "El principio de Integridad, ya que la estandarización de los identificadores de los contribuyentes garantiza la fiabilidad y la consistencia de los datos en todos los sistemas, lo que permite la toma de decisiones estratégicas.",
      "El principio de Disponibilidad, ya que la estandarización de los identificadores de los contribuyentes garantiza que los datos estén disponibles para la toma de decisiones."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La estandarización de los identificadores de los contribuyentes en todos los sistemas de la DIAN es una manifestación del principio de Integridad. Esta estandarización garantiza la fiabilidad y la consistencia de los datos, lo que permite a la DIAN combinar información de diferentes fuentes y tomar decisiones estratégicas basadas en información confiable, como la detección de contrabando."
  },
  {
    "id": "gdp2-71",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II, en su rol de mantenimiento de la integridad de los datos, identifica que un proceso de anonimización de datos para un reporte público no cumple con la política de privacidad de la DIAN, ya que la información del género y la edad de los contribuyentes sigue siendo visible. La política exige que esta información sea eliminada. ¿Qué rol de gobierno de datos debe ser el primero en tomar una decisión de alto nivel sobre la corrección de este proceso?",
    "opciones": [
      "El Data Custodian, porque es el responsable técnico de la base de datos y su modificación.",
      "El Data Steward, porque es el rol que implementa las políticas y la estandarización de los datos de la entidad.",
      "El Data Owner, porque es la máxima autoridad responsable de la gestión de la información, y tiene la autoridad para definir las acciones a seguir en caso de una violación de la política de privacidad."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "Una violación de la política de privacidad de los datos de los contribuyentes es una situación grave que requiere una decisión de alto nivel. El Data Owner, como responsable máximo del conjunto de datos, es el que tiene la autoridad para definir las acciones a seguir en esta situación, como ordenar la corrección del proceso de anonimización o notificar a la Dirección de Gestión Jurídica para que tome acciones legales."
  },
  {
    "id": "gdp2-72",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II, en colaboración con el área de Legal de la DIAN, está definiendo una política de retención de datos para los registros de contribuyentes. La política establece que los registros de declaraciones de impuestos deben conservarse por 5 años, lo que contraviene la normativa legal que exige 10 años. ¿Qué rol de gobierno de datos debe ser el primero en tomar una decisión de alto nivel sobre la corrección de esta política?",
    "opciones": [
      "El Data Custodian, porque es el responsable técnico de la base de datos y su modificación.",
      "El Data Steward, porque es el rol que implementa las políticas y la estandarización de los datos de la entidad.",
      "El Data Owner, porque es la máxima autoridad responsable de la gestión de la información, y tiene la autoridad para definir las acciones a seguir en caso de una violación de la normativa legal."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "Una política de retención de datos que contraviene la normativa legal es una situación grave que requiere una decisión de alto nivel. El Data Owner, como responsable máximo del conjunto de datos, es el que tiene la autoridad para definir las acciones a seguir en esta situación, como ordenar la corrección de la política o notificar a la Dirección de Gestión Jurídica para que tome acciones legales."
  },
  {
    "id": "gdp2-73",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección General de la DIAN ha ordenado la creación de un 'Comité de Gobernanza de Datos' para supervisar la gestión de la información en la entidad. Este comité estará compuesto por un representante de cada Dirección de Gestión. ¿Qué rol de gobierno de datos debe tener el representante de la Dirección de Gestión de Impuestos en este comité, y cuál es su principal responsabilidad?",
    "opciones": [
      "El rol de Data Custodian, y su responsabilidad es asegurar la infraestructura tecnológica y la seguridad de los datos de la Dirección de Impuestos.",
      "El rol de Data Steward, y su responsabilidad es implementar las políticas de calidad y estandarización de los datos de la Dirección de Impuestos.",
      "El rol de Data Owner, y su responsabilidad es la de velar por la gestión de la información de la Dirección de Gestión de Impuestos, definiendo las políticas y las reglas de uso de los datos."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La Dirección de Gestión de Impuestos es la responsable máxima de la información tributaria. Por lo tanto, su representante en el 'Comité de Gobernanza de Datos' tiene el rol de Data Owner, y su principal responsabilidad es la de velar por la gestión de la información de su Dirección, definiendo las políticas y las reglas de uso de los datos en la entidad."
  },
  {
    "id": "gdp2-74",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II, en el desarrollo de sus funciones, identifica que el sistema de auditoría de acceso a bases de datos de la DIAN no está registrando de forma completa las consultas realizadas por ciertos usuarios. Aunque se registra el acceso, no se registra el detalle de los campos consultados, lo que podría dificultar una investigación en caso de una fuga de información. ¿Qué política de seguridad de la información es la más directamente comprometida por esta falla de registro?",
    "opciones": [
      "La política de Disponibilidad, ya que la falta de registro podría hacer que la información no esté disponible para una investigación.",
      "La política de Integridad, ya que la falta de registro podría hacer que los datos sean alterados sin que se pueda detectar.",
      "La política de Confidencialidad, ya que la falta de un registro completo dificulta la trazabilidad de la información y la identificación de responsables en caso de una fuga."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La política de Confidencialidad se encarga de proteger la información sensible de un acceso no autorizado o de su divulgación. Una falla en el sistema de auditoría que no registra de forma completa las consultas dificulta la trazabilidad de la información y la identificación de los responsables en caso de una fuga, lo que compromete la confidencialidad de la información y la confianza de los contribuyentes."
  },
  {
    "id": "gdp2-75",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II, en el marco de la implementación de la Arquitectura Digital de la DIAN, se encuentra con una base de datos que tiene un campo 'NIT' con valores numéricos y alfanuméricos. El nuevo estándar de la Arquitectura Digital establece que el NIT debe ser un valor numérico. ¿Qué acción debe tomar el Gestor II para conciliar la necesidad de estandarización con la validez de los datos históricos?",
    "opciones": [
      "Modificar todos los valores alfanuméricos a un valor numérico por defecto, ya que el estándar de la Arquitectura Digital es prioritario en la entidad.",
      "Proponer al Data Owner de la información una estrategia para migrar los datos históricos y definir un proceso de validación para los nuevos registros, asegurando que se cumpla con el estándar de la Arquitectura Digital sin comprometer la integridad de la información.",
      "Eliminar todos los registros con valores alfanuméricos en el campo 'NIT', ya que no cumplen con el nuevo estándar y no se pueden utilizar para la toma de decisiones de la entidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Arquitectura Digital de la DIAN se basa en la interoperabilidad de los sistemas y la consistencia de los datos. El Gestor II debe proponer una estrategia que concilie la necesidad de estandarización con la validez de los datos históricos. La migración de los datos históricos y la validación de los nuevos registros es la acción más adecuada para asegurar que se cumpla con el estándar de la Arquitectura Digital sin comprometer la integridad de la información."
  },
  {
    "id": "gdp2-76",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Aduanas, como Dueña de los Datos de su área, ha solicitado un reporte analítico que requiere combinar información de las bases de datos de aduanas con datos de terceros (ej. información de transporte y logística). El reporte es crucial para la detección de contrabando. ¿Qué política de gobierno de datos se debe priorizar al integrar estos datos de terceros en los sistemas de la DIAN?",
    "opciones": [
      "La Política de Nomenclatura, para asegurar que los nombres de los campos de los datos de terceros sean consistentes con los de la DIAN.",
      "La Política de Calidad de Datos, para asegurar que los datos de terceros sean veraces, completos y consistentes antes de ser integrados en el repositorio.",
      "La Política de Seguridad de la Información, para proteger la confidencialidad de la información de los terceros y evitar que se divulgue de forma no autorizada."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La calidad de los datos de terceros es fundamental para la fiabilidad de un reporte analítico. Si se integran datos de terceros que no cumplen con la política de calidad de la DIAN, el reporte podría llevar a decisiones incorrectas. Por lo tanto, la Política de Calidad de Datos es la que se debe priorizar al integrar estos datos en los sistemas de la DIAN."
  },
  {
    "id": "gdp2-77",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II, en su rol de mantenimiento de la integridad de los datos, identifica una inconsistencia lógica en un registro de una declaración de impuestos. El registro tiene una fecha de pago anterior a la fecha de la declaración. Esta anomalía no es un error de digitación, sino un indicio de un posible fraude. ¿Qué rol de gobierno de datos debe ser el primero en tomar una decisión de alto nivel sobre la investigación de esta inconsistencia?",
    "opciones": [
      "El Data Custodian, porque es la persona que se encarga de la custodia y el almacenamiento de los datos de la entidad.",
      "El Data Steward, porque es el rol que implementa las políticas y la estandarización de los datos de la entidad.",
      "El Data Owner, porque es la máxima autoridad responsable de la gestión de la información, y tiene la autoridad para definir las acciones a seguir en caso de un posible fraude."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La inconsistencia lógica en un registro que podría ser un indicio de un posible fraude requiere una decisión de alto nivel. El Data Owner, como responsable máximo del conjunto de datos, es el que tiene la autoridad para definir las acciones a seguir en esta situación, como iniciar una investigación o notificar a la Dirección de Gestión de Fiscalización."
  },
  {
    "id": "gdp2-78",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Aduanas, como Dueña de los Datos de su área, ha solicitado la creación de un nuevo repositorio de datos para un proyecto piloto. El Gestor II debe liderar el proyecto. ¿Qué política de gobierno de datos, además de las de seguridad, debe ser priorizada en el diseño de este nuevo repositorio para garantizar su fiabilidad y usabilidad?",
    "opciones": [
      "La Política de Retención y Archivo, para asegurar que los datos del proyecto piloto se eliminen al finalizar la iniciativa.",
      "La Política de Calidad de Datos, para asegurar que los datos del proyecto piloto sean veraces, completos y consistentes para la toma de decisiones.",
      "La Política de Privacidad, para asegurar que los datos del proyecto piloto sean anonimizados para proteger la privacidad de los contribuyentes."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La fiabilidad y la usabilidad de un nuevo repositorio de datos dependen directamente de la calidad de los datos que contiene. La Política de Calidad de Datos es la que define las reglas para asegurar que los datos sean veraces, completos y consistentes. Priorizar esta política en el diseño del repositorio garantiza que la información del proyecto piloto sea confiable y útil para la toma de decisiones de la entidad."
  },
  {
    "id": "gdp2-79",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II, en el marco de la implementación de la Política de Privacidad, está definiendo los procedimientos de anonimización para un conjunto de datos tributarios que será usado para un reporte estadístico. Se presenta un conflicto entre la necesidad de anonimización y la necesidad de mantener cierta granularidad de la información para la validez del análisis. ¿Qué acción debe tomar el Gestor II para resolver este conflicto?",
    "opciones": [
      "Priorizar la anonimización completa de los datos, ya que la política de privacidad es la más importante en la entidad.",
      "Priorizar la granularidad de los datos, ya que el reporte estadístico debe ser válido y la anonimización podría comprometer la misionalidad de la DIAN.",
      "Consultar con el Data Owner de la información tributaria para encontrar un equilibrio entre la anonimización de los datos y la granularidad necesaria para el análisis, asegurando que se cumpla con la política de privacidad sin comprometer la misionalidad."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La política de privacidad y la necesidad de granularidad para el análisis son dos principios del gobierno de datos que pueden entrar en conflicto. La acción correcta es consultar con el Data Owner de la información para encontrar un equilibrio entre ambos principios. El Data Owner, como responsable máximo, tiene la autoridad para definir cómo se debe manejar la información en esta situación, asegurando que se cumpla con la política de privacidad sin comprometer la misionalidad de la DIAN."
  },
  {
    "id": "gdp2-80",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II, en el desarrollo de un reporte, identifica que un campo en una base de datos de aduanas que debería contener un valor numérico, tiene valores alfanuméricos. Esta inconsistencia genera errores en la generación de reportes y afecta la toma de decisiones. ¿Qué pilar del gobierno de datos se está violando en esta situación, y qué es lo que se busca proteger con la corrección de este problema?",
    "opciones": [
      "El pilar de Roles y Responsabilidades, y se busca proteger la integridad del sistema de información de la entidad.",
      "El pilar de Políticas y Estándares de Datos, y se busca proteger la integridad y la calidad de la información para la toma de decisiones de la entidad.",
      "El pilar de Procesos y Procedimientos, y se busca proteger la disponibilidad de los datos en el repositorio de la entidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La inconsistencia en el tipo de datos de un campo viola el pilar de Políticas y Estándares de Datos. La corrección de este problema busca proteger la integridad y la calidad de la información para que los reportes generados sean fiables y no afecten la toma de decisiones en la DIAN, lo que es fundamental para el cumplimiento de la misionalidad."
  },
  {
    "id": "gdp2-81",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La DIAN ha implementado un nuevo sistema de trazabilidad de mercancías en tiempo real. Un Gestor II, en el desarrollo de un reporte, identifica que la latencia del sistema es alta, lo que afecta la oportunidad de la información para la fiscalización. ¿Qué principio fundamental del gobierno de datos se está comprometiendo en esta situación, y cómo afecta a la misionalidad de la DIAN?",
    "opciones": [
      "El principio de Usabilidad, porque la latencia del sistema hace que el reporte no sea útil para los analistas de datos de la entidad.",
      "El principio de Disponibilidad, porque la latencia del sistema hace que la información no esté disponible de manera oportuna para la toma de decisiones de la DIAN.",
      "El principio de Integridad, porque la latencia del sistema afecta la fiabilidad y la consistencia de la información en el reporte."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Disponibilidad es el principio que asegura que los datos estén disponibles de manera oportuna para los usuarios. Una alta latencia en un sistema de trazabilidad de mercancías afecta la disponibilidad de la información en tiempo real, lo que compromete la misionalidad de la DIAN de control aduanero y fiscalización, ya que las decisiones se deben tomar de forma oportuna."
  },
  {
    "id": "gdp2-82",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Se ha detectado una fuga de información sensible de la DIAN, que ha afectado a miles de contribuyentes. Un auditor externo ha señalado que la fuga se debió a un error humano y a la falta de procedimientos de seguridad robustos. ¿Qué componente del gobierno de datos, de ser implementado correctamente, podría haber evitado este incidente, y por qué es una falla grave para la DIAN?",
    "opciones": [
      "Los Roles y Responsabilidades, ya que la falta de un rol específico para la seguridad de la información fue la causa del incidente.",
      "Las Políticas y Estándares de Datos, ya que la falta de una política de seguridad robusta fue la causa principal del incidente.",
      "Los Procesos y Procedimientos, ya que la falta de un flujo de trabajo claro para el manejo de la información sensible fue la causa del incidente, lo que compromete la confidencialidad de la información."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La falta de 'procedimientos de seguridad robustos' es la causa principal del incidente. El componente de Procesos y Procedimientos es el que define los flujos de trabajo para el manejo de la información sensible. Una fuga de información es una falla grave para la DIAN porque compromete la confidencialidad de la información y la confianza de los contribuyentes, lo que afecta directamente la misionalidad de seguridad fiscal."
  },
  {
    "id": "gdp2-83",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección General de la DIAN ha ordenado la creación de un 'Comité de Gobernanza de Datos' para supervisar la gestión de la información en la entidad. Este comité estará compuesto por un representante de cada Dirección de Gestión. ¿Qué rol de gobierno de datos debe tener el representante de la Dirección de Gestión de Impuestos en este comité, y cuál es su principal responsabilidad?",
    "opciones": [
      "El rol de Data Custodian, y su responsabilidad es asegurar la infraestructura tecnológica y la seguridad de los datos de la Dirección de Impuestos.",
      "El rol de Data Steward, y su responsabilidad es implementar las políticas de calidad y estandarización de los datos de la Dirección de Impuestos.",
      "El rol de Data Owner, y su responsabilidad es la de velar por la gestión de la información de la Dirección de Gestión de Impuestos, definiendo las políticas y las reglas de uso de los datos."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La Dirección de Gestión de Impuestos es la responsable máxima de la información tributaria. Por lo tanto, su representante en el 'Comité de Gobernanza de Datos' tiene el rol de Data Owner, y su principal responsabilidad es la de velar por la gestión de la información de su Dirección, definiendo las políticas y las reglas de uso de los datos en la entidad."
  },
  {
    "id": "gdp2-84",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II, en el desarrollo de sus funciones, identifica que la política de retención de datos para los registros de declaraciones aduaneras no ha sido actualizada en cinco años. Este hecho contraviene las nuevas regulaciones legales, lo que podría exponer a la DIAN a riesgos jurídicos. ¿Qué componente del gobierno de datos debe ser activado urgentemente para corregir esta situación?",
    "opciones": [
      "El componente de Tecnología y Herramientas, ya que es la plataforma la que no se ha actualizado con la nueva retención.",
      "El componente de Políticas y Estándares de Datos, ya que se debe actualizar la política de retención de datos para alinearla con la normativa legal vigente.",
      "El componente de Procesos y Procedimientos, ya que se debe modificar el flujo de trabajo para que los registros se borren o se archiven de acuerdo con la nueva retención."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El problema principal es que la 'política de retención de datos' está desactualizada y contraviene las regulaciones legales. El componente de Políticas y Estándares de Datos es el que define estas reglas. Por lo tanto, la acción más urgente es actualizar esta política, para luego modificar los procesos y procedimientos que la apliquen, y la tecnología que la soporte."
  },
  {
    "id": "gdp2-85",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Para la implementación de un nuevo sistema de información tributaria, se está documentando el 'Diccionario de Datos', que contendrá los metadatos de las bases de datos (definición de campos, tipos de datos, relaciones, etc.). ¿Qué principio fundamental del gobierno de datos se busca asegurar con esta documentación?",
    "opciones": [
      "El principio de Seguridad de la Información, al proteger los nombres de los campos de la base de datos de un posible acceso no autorizado.",
      "El principio de Disponibilidad, al hacer que la información esté disponible y accesible para todos los usuarios de la entidad.",
      "El principio de Usabilidad y Calidad de Datos, al asegurar que los datos sean comprensibles y consistentes para los desarrolladores y los usuarios finales."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "Documentar un 'Diccionario de Datos' asegura la Usabilidad y la Calidad de la información. Al definir los metadatos de las bases de datos, se garantiza que los datos sean comprensibles y que se utilicen de manera consistente en toda la entidad, lo que facilita la interoperabilidad entre sistemas y evita errores."
  },
  {
    "id": "gdp2-86",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II, en colaboración con el área de Legal de la DIAN, está definiendo una política para el uso de datos tributarios con fines de investigación académica, garantizando la anonimización de la información. ¿Qué pilar del gobierno de datos se está abordando, y qué principio se busca proteger principalmente?",
    "opciones": [
      "El pilar de Roles y Responsabilidades, ya que se están definiendo quiénes pueden usar los datos, protegiendo la confidencialidad.",
      "El pilar de Políticas y Estándares, ya que se está definiendo una regla para el uso de datos, protegiendo el principio de privacidad y confidencialidad.",
      "El pilar de Procesos y Procedimientos, ya que se está definiendo el flujo de trabajo para que los investigadores accedan a la información, protegiendo la seguridad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La definición de una 'política para el uso de datos' se enmarca en el pilar de Políticas y Estándares de Datos. Al mismo tiempo, el propósito de la anonimización es proteger el principio de privacidad y confidencialidad de la información tributaria, lo que es fundamental en la misionalidad de la DIAN."
  },
  {
    "id": "gdp2-87",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Impuestos, como Data Owner de la información tributaria, ha detectado que la nomenclatura de algunos campos en la base de datos no es consistente con el estándar institucional, lo que genera confusión en los analistas. ¿Qué rol, bajo el marco de gobierno de datos, es el encargado de asegurar que se implemente la estandarización de la nomenclatura en las bases de datos?",
    "opciones": [
      "El Data Custodian, porque es el responsable técnico de la infraestructura y debe realizar las correcciones.",
      "El Data Owner, porque al ser el dueño de los datos, es el que tiene la máxima autoridad para realizar la estandarización.",
      "El Data Steward, ya que es el rol que implementa las políticas del Data Owner y es responsable de velar por la estandarización y calidad de los datos."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "El Data Steward es el rol que se encarga de la implementación de las políticas definidas por el Data Owner. Aunque el Data Custodian puede realizar la corrección, el rol del Data Steward es el que supervisa y asegura que la estandarización se cumpla a nivel operativo, velando por la calidad y consistencia de los datos."
  },
  {
    "id": "gdp2-88",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II, en sus funciones de generación de reportes, observa que el mismo indicador de desempeño de la Dirección de Aduanas tiene dos valores diferentes en dos sistemas de información. Esta inconsistencia podría llevar a decisiones incorrectas. ¿Qué principio fundamental del gobierno de datos se está violando en esta situación?",
    "opciones": [
      "El principio de Disponibilidad, al no poder acceder al valor real del indicador de la entidad.",
      "El principio de Usabilidad, ya que la información del indicador no es útil para la toma de decisiones de la Dirección.",
      "El principio de Integridad y Consistencia, ya que la misma información tiene valores diferentes en dos sistemas, lo que compromete su confiabilidad."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La Integridad y la Consistencia son principios fundamentales del gobierno de datos. La integridad se refiere a la fiabilidad de los datos, mientras que la consistencia significa que el mismo dato debe ser igual en todas las fuentes. Dos valores diferentes para el mismo indicador violan directamente este principio, lo que compromete la confiabilidad de la información."
  },
  {
    "id": "gdp2-89",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Impuestos, como Data Owner, necesita tener una visión completa de todos los datos que posee en un solo lugar. ¿Qué principio fundamental del gobierno de datos permite la consolidación de todos los datos en un solo repositorio, asegurando su fiabilidad para la toma de decisiones?",
    "opciones": [
      "El principio de Usabilidad, al hacer que los datos sean útiles para la Dirección de Gestión de Impuestos.",
      "El principio de Disponibilidad, al garantizar que los datos estén siempre accesibles para la Dirección de Gestión de Impuestos.",
      "El principio de Integridad, al garantizar que los datos sean veraces, completos y consistentes en un solo repositorio."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "El principio de Integridad se refiere a que los datos sean veraces, completos y consistentes. La consolidación de datos en un solo repositorio, para que el Data Owner tenga una visión completa y fiable, se basa en la integridad de la información, ya que un repositorio con datos inconsistentes no sería útil para la toma de decisiones."
  },
  {
    "id": "gdp2-90",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Fiscalización ha detectado que la información de una de sus bases de datos no es coherente con la información del Repositorio Único de Datos. Esta inconsistencia podría afectar el proceso de auditoría y la imposición de sanciones. ¿Qué pilar del gobierno de datos es el que se ha violado en esta situación, y qué rol o persona es la que debe liderar la corrección?",
    "opciones": [
      "El pilar de Tecnología y Herramientas, y el rol del Data Custodian es el que debe liderar la corrección.",
      "El pilar de Políticas y Estándares de Datos, y el rol del Data Steward es el que debe liderar la corrección.",
      "El pilar de Roles y Responsabilidades, y el rol del Data Owner es el que debe liderar la corrección."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La inconsistencia de la información viola el pilar de Políticas y Estándares de Datos. El rol que se encarga de la implementación de estas políticas y de la estandarización de los datos es el Data Steward, por lo que es el que debe liderar la corrección en la organización, bajo la supervisión del Data Owner."
  },
  {
    "id": "gdp2-91",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II es notificado de que un ataque cibernético ha afectado la integridad de una base de datos de comercio exterior. Se han alterado los registros y se han borrado algunos. La Dirección General exige una respuesta inmediata. ¿Qué pilar del gobierno de datos se ha comprometido en esta situación, y qué es lo que se busca proteger con la implementación de un plan de recuperación de datos?",
    "opciones": [
      "El pilar de Usabilidad, y se busca proteger la integridad y la consistencia de los datos en la entidad.",
      "El pilar de Seguridad de la Información, y se busca proteger la integridad y la disponibilidad de los datos en la entidad.",
      "El pilar de Disponibilidad, y se busca proteger la confidencialidad de la información en la entidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Un ataque cibernético que afecta la integridad de una base de datos y borra algunos registros compromete el pilar de Seguridad de la Información. La implementación de un plan de recuperación de datos busca proteger la integridad y la disponibilidad de la información, para que la DIAN pueda seguir operando y cumpliendo con su misionalidad de control aduanero."
  },
  {
    "id": "gdp2-92",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Aduanas, como Dueña de los Datos de su área, ha solicitado a la Dirección de Gestión de Tecnología y Telecomunicaciones, como Custodio de los Datos, la implementación de un nuevo sistema de monitoreo de la calidad de los datos. ¿Qué rol o persona es la que debe liderar este proyecto, y qué componente del gobierno de datos se busca fortalecer?",
    "opciones": [
      "El Gestor II, y se busca fortalecer el pilar de Tecnología y Herramientas del gobierno de datos.",
      "El Data Steward, y se busca fortalecer el pilar de Roles y Responsabilidades del gobierno de datos.",
      "El Data Owner, y se busca fortalecer el pilar de Políticas y Estándares de Datos del gobierno de datos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La implementación de un sistema de monitoreo de la calidad de los datos es una iniciativa tecnológica. Por lo tanto, el Gestor II, en su rol en la Dirección de Tecnología, es el que debe liderar el proyecto. Esta iniciativa busca fortalecer el pilar de Tecnología y Herramientas del gobierno de datos, ya que es la infraestructura que soporta la gestión de la información."
  },
  {
    "id": "gdp2-93",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II, en colaboración con el área de Legal de la DIAN, está definiendo una política de retención de datos para los registros de contribuyentes. ¿Qué componente del gobierno de datos es el que se está desarrollando, y qué principio se busca proteger principalmente en esta situación?",
    "opciones": [
      "El componente de Políticas y Estándares de Datos, y se busca proteger el principio de privacidad y confidencialidad.",
      "El componente de Procesos y Procedimientos, y se busca proteger el principio de seguridad de la información.",
      "El componente de Roles y Responsabilidades, y se busca proteger el principio de integridad."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La definición de una 'política de retención de datos' se enmarca en el componente de Políticas y Estándares de Datos. Al mismo tiempo, al definir cuánto tiempo se deben conservar los datos de los contribuyentes, se busca proteger el principio de privacidad y confidencialidad de la información, lo que es fundamental en la misionalidad de la DIAN."
  },
  {
    "id": "gdp2-94",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección General de la DIAN ha ordenado la creación de un 'Comité de Gobernanza de Datos' para supervisar la gestión de la información en la entidad. Este comité estará compuesto por un representante de cada Dirección de Gestión. ¿Qué rol de gobierno de datos debe tener el representante de la Dirección de Gestión de Impuestos en este comité, y cuál es su principal responsabilidad?",
    "opciones": [
      "El rol de Data Custodian, y su responsabilidad es asegurar la infraestructura tecnológica y la seguridad de los datos de la Dirección de Impuestos.",
      "El rol de Data Steward, y su responsabilidad es implementar las políticas de calidad y estandarización de los datos de la Dirección de Impuestos.",
      "El rol de Data Owner, y su responsabilidad es la de velar por la gestión de la información de la Dirección de Gestión de Impuestos, definiendo las políticas y las reglas de uso de los datos."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La Dirección de Gestión de Impuestos es la responsable máxima de la información tributaria. Por lo tanto, su representante en el 'Comité de Gobernanza de Datos' tiene el rol de Data Owner, y su principal responsabilidad es la de velar por la gestión de la información de su Dirección, definiendo las políticas y las reglas de uso de los datos en la entidad."
  },
  {
    "id": "gdp2-95",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II se encuentra en un debate con un colega sobre la importancia del gobierno de datos en la DIAN. El colega argumenta que es una iniciativa 'burocrática' que solo ralentiza los procesos. ¿Cuál es el principal argumento que el Gestor II debería usar para rebatir esta afirmación, y qué beneficio estratégico tiene para la DIAN?",
    "opciones": [
      "El gobierno de datos es un marco de gestión que genera burocracia, pero es necesario para cumplir con la normativa legal de la entidad.",
      "El gobierno de datos, aunque puede parecer burocrático, es un marco de gestión que asegura la calidad, la integridad y la seguridad de los datos, lo que permite la toma de decisiones estratégicas y la eficiencia operativa.",
      "El gobierno de datos es un marco de gestión que solo se aplica a los datos sensibles de la entidad, y no a los datos de uso común, por lo que no genera burocracia en todos los procesos de la DIAN."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El gobierno de datos no es burocracia, es una disciplina de gestión que asegura la calidad, la integridad y la seguridad de los datos. Aunque puede parecer que ralentiza los procesos, en realidad los hace más eficientes al evitar errores, inconsistencias y problemas de seguridad. Este marco permite a la DIAN tomar decisiones estratégicas basadas en información confiable y de alta calidad."
  },
  {
    "id": "gdp2-96",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Fiscalización ha detectado que la información de una de sus bases de datos no es coherente con la información del Repositorio Único de Datos. Esta inconsistencia podría afectar el proceso de auditoría y la imposición de sanciones. ¿Qué pilar del gobierno de datos es el que se ha violado en esta situación, y qué rol o persona es la que debe liderar la corrección?",
    "opciones": [
      "El pilar de Tecnología y Herramientas, y el rol del Data Custodian es el que debe liderar la corrección.",
      "El pilar de Políticas y Estándares de Datos, y el rol del Data Steward es el que debe liderar la corrección.",
      "El pilar de Roles y Responsabilidades, y el rol del Data Owner es el que debe liderar la corrección."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La inconsistencia de la información viola el pilar de Políticas y Estándares de Datos. El rol que se encarga de la implementación de estas políticas y de la estandarización de los datos es el Data Steward, por lo que es el que debe liderar la corrección en la organización, bajo la supervisión del Data Owner."
  },
  {
    "id": "gdp2-97",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II es notificado de que un ataque cibernético ha afectado la integridad de una base de datos de comercio exterior. Se han alterado los registros y se han borrado algunos. La Dirección General exige una respuesta inmediata. ¿Qué pilar del gobierno de datos se ha comprometido en esta situación, y qué es lo que se busca proteger con la implementación de un plan de recuperación de datos?",
    "opciones": [
      "El pilar de Usabilidad, y se busca proteger la integridad y la consistencia de los datos en la entidad.",
      "El pilar de Seguridad de la Información, y se busca proteger la integridad y la disponibilidad de los datos en la entidad.",
      "El pilar de Disponibilidad, y se busca proteger la confidencialidad de la información en la entidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Un ataque cibernético que afecta la integridad de una base de datos y borra algunos registros compromete el pilar de Seguridad de la Información. La implementación de un plan de recuperación de datos busca proteger la integridad y la disponibilidad de la información, para que la DIAN pueda seguir operando y cumpliendo con su misionalidad de control aduanero."
  },
  {
    "id": "gdp2-98",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Aduanas, como Dueña de los Datos de su área, ha solicitado a la Dirección de Gestión de Tecnología y Telecomunicaciones, como Custodio de los Datos, la implementación de un nuevo sistema de monitoreo de la calidad de los datos. ¿Qué rol o persona es la que debe liderar este proyecto, y qué componente del gobierno de datos se busca fortalecer?",
    "opciones": [
      "El Gestor II, y se busca fortalecer el pilar de Tecnología y Herramientas del gobierno de datos.",
      "El Data Steward, y se busca fortalecer el pilar de Roles y Responsabilidades del gobierno de datos.",
      "El Data Owner, y se busca fortalecer el pilar de Políticas y Estándares de Datos del gobierno de datos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La implementación de un sistema de monitoreo de la calidad de los datos es una iniciativa tecnológica. Por lo tanto, el Gestor II, en su rol en la Dirección de Tecnología, es el que debe liderar el proyecto. Esta iniciativa busca fortalecer el pilar de Tecnología y Herramientas del gobierno de datos, ya que es la infraestructura que soporta la gestión de la información."
  },
  {
    "id": "gdp2-99",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II, en colaboración con el área de Legal de la DIAN, está definiendo una política de retención de datos para los registros de contribuyentes. ¿Qué componente del gobierno de datos es el que se está desarrollando, y qué principio se busca proteger principalmente en esta situación?",
    "opciones": [
      "El componente de Políticas y Estándares de Datos, y se busca proteger el principio de privacidad y confidencialidad.",
      "El componente de Procesos y Procedimientos, y se busca proteger el principio de seguridad de la información.",
      "El componente de Roles y Responsabilidades, y se busca proteger el principio de integridad."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La definición de una 'política de retención de datos' se enmarca en el componente de Políticas y Estándares de Datos. Al mismo tiempo, al definir cuánto tiempo se deben conservar los datos de los contribuyentes, se busca proteger el principio de privacidad y confidencialidad de la información, lo que es fundamental en la misionalidad de la DIAN."
  },
  {
    "id": "gdp2-100",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección General de la DIAN ha ordenado la creación de un 'Comité de Gobernanza de Datos' para supervisar la gestión de la información en la entidad. Este comité estará compuesto por un representante de cada Dirección de Gestión. ¿Qué rol de gobierno de datos debe tener el representante de la Dirección de Gestión de Impuestos en este comité, y cuál es su principal responsabilidad?",
    "opciones": [
      "El rol de Data Custodian, y su responsabilidad es asegurar la infraestructura tecnológica y la seguridad de los datos de la Dirección de Impuestos.",
      "El rol de Data Steward, y su responsabilidad es implementar las políticas de calidad y estandarización de los datos de la Dirección de Impuestos.",
      "El rol de Data Owner, y su responsabilidad es la de velar por la gestión de la información de la Dirección de Gestión de Impuestos, definiendo las políticas y las reglas de uso de los datos."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La Dirección de Gestión de Impuestos es la responsable máxima de la información tributaria. Por lo tanto, su representante en el 'Comité de Gobernanza de Datos' tiene el rol de Data Owner, y su principal responsabilidad es la de velar por la gestión de la información de su Dirección, definiendo las políticas y las reglas de uso de los datos en la entidad."
  },
  {
    "id": "gdp2-101",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II se encuentra en un debate con un colega sobre la importancia del gobierno de datos en la DIAN. El colega argumenta que es una iniciativa 'burocrática' que solo ralentiza los procesos. ¿Cuál es el principal argumento que el Gestor II debería usar para rebatir esta afirmación, y qué beneficio estratégico tiene para la DIAN?",
    "opciones": [
      "El gobierno de datos es un marco de gestión que genera burocracia, pero es necesario para cumplir con la normativa legal de la entidad.",
      "El gobierno de datos, aunque puede parecer burocrático, es un marco de gestión que asegura la calidad, la integridad y la seguridad de los datos, lo que permite la toma de decisiones estratégicas y la eficiencia operativa.",
      "El gobierno de datos es un marco de gestión que solo se aplica a los datos sensibles de la entidad, y no a los datos de uso común, por lo que no genera burocracia en todos los procesos de la DIAN."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El gobierno de datos no es burocracia, es una disciplina de gestión que asegura la calidad, la integridad y la seguridad de los datos. Aunque puede parecer que ralentiza los procesos, en realidad los hace más eficientes al evitar errores, inconsistencias y problemas de seguridad. Este marco permite a la DIAN tomar decisiones estratégicas basadas en información confiable y de alta calidad."
  },
  {
    "id": "gdp2-102",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Fiscalización ha detectado que la información de una de sus bases de datos no es coherente con la información del Repositorio Único de Datos. Esta inconsistencia podría afectar el proceso de auditoría y la imposición de sanciones. ¿Qué pilar del gobierno de datos es el que se ha violado en esta situación, y qué rol o persona es la que debe liderar la corrección?",
    "opciones": [
      "El pilar de Tecnología y Herramientas, y el rol del Data Custodian es el que debe liderar la corrección.",
      "El pilar de Políticas y Estándares de Datos, y el rol del Data Steward es el que debe liderar la corrección.",
      "El pilar de Roles y Responsabilidades, y el rol del Data Owner es el que debe liderar la corrección."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La inconsistencia de la información viola el pilar de Políticas y Estándares de Datos. El rol que se encarga de la implementación de estas políticas y de la estandarización de los datos es el Data Steward, por lo que es el que debe liderar la corrección en la organización, bajo la supervisión del Data Owner."
  },
  {
    "id": "gdp2-103",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II es notificado de que un ataque cibernético ha afectado la integridad de una base de datos de comercio exterior. Se han alterado los registros y se han borrado algunos. La Dirección General exige una respuesta inmediata. ¿Qué pilar del gobierno de datos se ha comprometido en esta situación, y qué es lo que se busca proteger con la implementación de un plan de recuperación de datos?",
    "opciones": [
      "El pilar de Usabilidad, y se busca proteger la integridad y la consistencia de los datos en la entidad.",
      "El pilar de Seguridad de la Información, y se busca proteger la integridad y la disponibilidad de los datos en la entidad.",
      "El pilar de Disponibilidad, y se busca proteger la confidencialidad de la información en la entidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Un ataque cibernético que afecta la integridad de una base de datos y borra algunos registros compromete el pilar de Seguridad de la Información. La implementación de un plan de recuperación de datos busca proteger la integridad y la disponibilidad de la información, para que la DIAN pueda seguir operando y cumpliendo con su misionalidad de control aduanero."
  },
  {
    "id": "gdp2-104",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Aduanas, como Dueña de los Datos de su área, ha solicitado a la Dirección de Gestión de Tecnología y Telecomunicaciones, como Custodio de los Datos, la implementación de un nuevo sistema de monitoreo de la calidad de los datos. ¿Qué rol o persona es la que debe liderar este proyecto, y qué componente del gobierno de datos se busca fortalecer?",
    "opciones": [
      "El Gestor II, y se busca fortalecer el pilar de Tecnología y Herramientas del gobierno de datos.",
      "El Data Steward, y se busca fortalecer el pilar de Roles y Responsabilidades del gobierno de datos.",
      "El Data Owner, y se busca fortalecer el pilar de Políticas y Estándares de Datos del gobierno de datos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La implementación de un sistema de monitoreo de la calidad de los datos es una iniciativa tecnológica. Por lo tanto, el Gestor II, en su rol en la Dirección de Tecnología, es el que debe liderar el proyecto. Esta iniciativa busca fortalecer el pilar de Tecnología y Herramientas del gobierno de datos, ya que es la infraestructura que soporta la gestión de la información."
  },
  {
    "id": "gdp2-105",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II, en colaboración con el área de Legal de la DIAN, está definiendo una política de retención de datos para los registros de contribuyentes. ¿Qué componente del gobierno de datos es el que se está desarrollando, y qué principio se busca proteger principalmente en esta situación?",
    "opciones": [
      "El componente de Políticas y Estándares de Datos, y se busca proteger el principio de privacidad y confidencialidad.",
      "El componente de Procesos y Procedimientos, y se busca proteger el principio de seguridad de la información.",
      "El componente de Roles y Responsabilidades, y se busca proteger el principio de integridad."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La definición de una 'política de retención de datos' se enmarca en el componente de Políticas y Estándares de Datos. Al mismo tiempo, al definir cuánto tiempo se deben conservar los datos de los contribuyentes, se busca proteger el principio de privacidad y confidencialidad de la información, lo que es fundamental en la misionalidad de la DIAN."
  },
  {
    "id": "gdp2-106",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección General de la DIAN ha ordenado la creación de un 'Comité de Gobernanza de Datos' para supervisar la gestión de la información en la entidad. Este comité estará compuesto por un representante de cada Dirección de Gestión. ¿Qué rol de gobierno de datos debe tener el representante de la Dirección de Gestión de Impuestos en este comité, y cuál es su principal responsabilidad?",
    "opciones": [
      "El rol de Data Custodian, y su responsabilidad es asegurar la infraestructura tecnológica y la seguridad de los datos de la Dirección de Impuestos.",
      "El rol de Data Steward, y su responsabilidad es implementar las políticas de calidad y estandarización de los datos de la Dirección de Impuestos.",
      "El rol de Data Owner, y su responsabilidad es la de velar por la gestión de la información de la Dirección de Gestión de Impuestos, definiendo las políticas y las reglas de uso de los datos."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La Dirección de Gestión de Impuestos es la responsable máxima de la información tributaria. Por lo tanto, su representante en el 'Comité de Gobernanza de Datos' tiene el rol de Data Owner, y su principal responsabilidad es la de velar por la gestión de la información de su Dirección, definiendo las políticas y las reglas de uso de los datos en la entidad."
  },
  {
    "id": "gdp2-107",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II se encuentra en un debate con un colega sobre la importancia del gobierno de datos en la DIAN. El colega argumenta que es una iniciativa 'burocrática' que solo ralentiza los procesos. ¿Cuál es el principal argumento que el Gestor II debería usar para rebatir esta afirmación, y qué beneficio estratégico tiene para la DIAN?",
    "opciones": [
      "El gobierno de datos es un marco de gestión que genera burocracia, pero es necesario para cumplir con la normativa legal de la entidad.",
      "El gobierno de datos, aunque puede parecer burocrático, es un marco de gestión que asegura la calidad, la integridad y la seguridad de los datos, lo que permite la toma de decisiones estratégicas y la eficiencia operativa.",
      "El gobierno de datos es un marco de gestión que solo se aplica a los datos sensibles de la entidad, y no a los datos de uso común, por lo que no genera burocracia en todos los procesos de la DIAN."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El gobierno de datos no es burocracia, es una disciplina de gestión que asegura la calidad, la integridad y la seguridad de los datos. Aunque puede parecer que ralentiza los procesos, en realidad los hace más eficientes al evitar errores, inconsistencias y problemas de seguridad. Este marco permite a la DIAN tomar decisiones estratégicas basadas en información confiable y de alta calidad."
  },
  {
    "id": "gdp2-108",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Fiscalización ha detectado que la información de una de sus bases de datos no es coherente con la información del Repositorio Único de Datos. Esta inconsistencia podría afectar el proceso de auditoría y la imposición de sanciones. ¿Qué pilar del gobierno de datos es el que se ha violado en esta situación, y qué rol o persona es la que debe liderar la corrección?",
    "opciones": [
      "El pilar de Tecnología y Herramientas, y el rol del Data Custodian es el que debe liderar la corrección.",
      "El pilar de Políticas y Estándares de Datos, y el rol del Data Steward es el que debe liderar la corrección.",
      "El pilar de Roles y Responsabilidades, y el rol del Data Owner es el que debe liderar la corrección."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La inconsistencia de la información viola el pilar de Políticas y Estándares de Datos. El rol que se encarga de la implementación de estas políticas y de la estandarización de los datos es el Data Steward, por lo que es el que debe liderar la corrección en la organización, bajo la supervisión del Data Owner."
  },
  {
    "id": "gdp2-109",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II es notificado de que un ataque cibernético ha afectado la integridad de una base de datos de comercio exterior. Se han alterado los registros y se han borrado algunos. La Dirección General exige una respuesta inmediata. ¿Qué pilar del gobierno de datos se ha comprometido en esta situación, y qué es lo que se busca proteger con la implementación de un plan de recuperación de datos?",
    "opciones": [
      "El pilar de Usabilidad, y se busca proteger la integridad y la consistencia de los datos en la entidad.",
      "El pilar de Seguridad de la Información, y se busca proteger la integridad y la disponibilidad de los datos en la entidad.",
      "El pilar de Disponibilidad, y se busca proteger la confidencialidad de la información en la entidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Un ataque cibernético que afecta la integridad de una base de datos y borra algunos registros compromete el pilar de Seguridad de la Información. La implementación de un plan de recuperación de datos busca proteger la integridad y la disponibilidad de la información, para que la DIAN pueda seguir operando y cumpliendo con su misionalidad de control aduanero."
  },
  {
    "id": "gdp2-110",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Aduanas, como Dueña de los Datos de su área, ha solicitado a la Dirección de Gestión de Tecnología y Telecomunicaciones, como Custodio de los Datos, la implementación de un nuevo sistema de monitoreo de la calidad de los datos. ¿Qué rol o persona es la que debe liderar este proyecto, y qué componente del gobierno de datos se busca fortalecer?",
    "opciones": [
      "El Gestor II, y se busca fortalecer el pilar de Tecnología y Herramientas del gobierno de datos.",
      "El Data Steward, y se busca fortalecer el pilar de Roles y Responsabilidades del gobierno de datos.",
      "El Data Owner, y se busca fortalecer el pilar de Políticas y Estándares de Datos del gobierno de datos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La implementación de un sistema de monitoreo de la calidad de los datos es una iniciativa tecnológica. Por lo tanto, el Gestor II, en su rol en la Dirección de Tecnología, es el que debe liderar el proyecto. Esta iniciativa busca fortalecer el pilar de Tecnología y Herramientas del gobierno de datos, ya que es la infraestructura que soporta la gestión de la información."
  },
  {
    "id": "gdp2-111",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II, en colaboración con el área de Legal de la DIAN, está definiendo una política de retención de datos para los registros de contribuyentes. ¿Qué componente del gobierno de datos es el que se está desarrollando, y qué principio se busca proteger principalmente en esta situación?",
    "opciones": [
      "El componente de Políticas y Estándares de Datos, y se busca proteger el principio de privacidad y confidencialidad.",
      "El componente de Procesos y Procedimientos, y se busca proteger el principio de seguridad de la información.",
      "El componente de Roles y Responsabilidades, y se busca proteger el principio de integridad."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La definición de una 'política de retención de datos' se enmarca en el componente de Políticas y Estándares de Datos. Al mismo tiempo, al definir cuánto tiempo se deben conservar los datos de los contribuyentes, se busca proteger el principio de privacidad y confidencialidad de la información, lo que es fundamental en la misionalidad de la DIAN."
  },
  {
    "id": "gdp2-112",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección General de la DIAN ha ordenado la creación de un 'Comité de Gobernanza de Datos' para supervisar la gestión de la información en la entidad. Este comité estará compuesto por un representante de cada Dirección de Gestión. ¿Qué rol de gobierno de datos debe tener el representante de la Dirección de Gestión de Impuestos en este comité, y cuál es su principal responsabilidad?",
    "opciones": [
      "El rol de Data Custodian, y su responsabilidad es asegurar la infraestructura tecnológica y la seguridad de los datos de la Dirección de Impuestos.",
      "El rol de Data Steward, y su responsabilidad es implementar las políticas de calidad y estandarización de los datos de la Dirección de Impuestos.",
      "El rol de Data Owner, y su responsabilidad es la de velar por la gestión de la información de la Dirección de Gestión de Impuestos, definiendo las políticas y las reglas de uso de los datos."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La Dirección de Gestión de Impuestos es la responsable máxima de la información tributaria. Por lo tanto, su representante en el 'Comité de Gobernanza de Datos' tiene el rol de Data Owner, y su principal responsabilidad es la de velar por la gestión de la información de su Dirección, definiendo las políticas y las reglas de uso de los datos en la entidad."
  },
  {
    "id": "gdp2-113",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II se encuentra en un debate con un colega sobre la importancia del gobierno de datos en la DIAN. El colega argumenta que es una iniciativa 'burocrática' que solo ralentiza los procesos. ¿Cuál es el principal argumento que el Gestor II debería usar para rebatir esta afirmación, y qué beneficio estratégico tiene para la DIAN?",
    "opciones": [
      "El gobierno de datos es un marco de gestión que genera burocracia, pero es necesario para cumplir con la normativa legal de la entidad.",
      "El gobierno de datos, aunque puede parecer burocrático, es un marco de gestión que asegura la calidad, la integridad y la seguridad de los datos, lo que permite la toma de decisiones estratégicas y la eficiencia operativa.",
      "El gobierno de datos es un marco de gestión que solo se aplica a los datos sensibles de la entidad, y no a los datos de uso común, por lo que no genera burocracia en todos los procesos de la DIAN."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El gobierno de datos no es burocracia, es una disciplina de gestión que asegura la calidad, la integridad y la seguridad de los datos. Aunque puede parecer que ralentiza los procesos, en realidad los hace más eficientes al evitar errores, inconsistencias y problemas de seguridad. Este marco permite a la DIAN tomar decisiones estratégicas basadas en información confiable y de alta calidad."
  },
  {
    "id": "gdp2-114",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Fiscalización ha detectado que la información de una de sus bases de datos no es coherente con la información del Repositorio Único de Datos. Esta inconsistencia podría afectar el proceso de auditoría y la imposición de sanciones. ¿Qué pilar del gobierno de datos es el que se ha violado en esta situación, y qué rol o persona es la que debe liderar la corrección?",
    "opciones": [
      "El pilar de Tecnología y Herramientas, y el rol del Data Custodian es el que debe liderar la corrección.",
      "El pilar de Políticas y Estándares de Datos, y el rol del Data Steward es el que debe liderar la corrección.",
      "El pilar de Roles y Responsabilidades, y el rol del Data Owner es el que debe liderar la corrección."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La inconsistencia de la información viola el pilar de Políticas y Estándares de Datos. El rol que se encarga de la implementación de estas políticas y de la estandarización de los datos es el Data Steward, por lo que es el que debe liderar la corrección en la organización, bajo la supervisión del Data Owner."
  },
  {
    "id": "gdp2-115",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II es notificado de que un ataque cibernético ha afectado la integridad de una base de datos de comercio exterior. Se han alterado los registros y se han borrado algunos. La Dirección General exige una respuesta inmediata. ¿Qué pilar del gobierno de datos se ha comprometido en esta situación, y qué es lo que se busca proteger con la implementación de un plan de recuperación de datos?",
    "opciones": [
      "El pilar de Usabilidad, y se busca proteger la integridad y la consistencia de los datos en la entidad.",
      "El pilar de Seguridad de la Información, y se busca proteger la integridad y la disponibilidad de los datos en la entidad.",
      "El pilar de Disponibilidad, y se busca proteger la confidencialidad de la información en la entidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Un ataque cibernético que afecta la integridad de una base de datos y borra algunos registros compromete el pilar de Seguridad de la Información. La implementación de un plan de recuperación de datos busca proteger la integridad y la disponibilidad de la información, para que la DIAN pueda seguir operando y cumpliendo con su misionalidad de control aduanero."
  },
  {
    "id": "gdp2-116",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Aduanas, como Dueña de los Datos de su área, ha solicitado a la Dirección de Gestión de Tecnología y Telecomunicaciones, como Custodio de los Datos, la implementación de un nuevo sistema de monitoreo de la calidad de los datos. ¿Qué rol o persona es la que debe liderar este proyecto, y qué componente del gobierno de datos se busca fortalecer?",
    "opciones": [
      "El Gestor II, y se busca fortalecer el pilar de Tecnología y Herramientas del gobierno de datos.",
      "El Data Steward, y se busca fortalecer el pilar de Roles y Responsabilidades del gobierno de datos.",
      "El Data Owner, y se busca fortalecer el pilar de Políticas y Estándares de Datos del gobierno de datos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La implementación de un sistema de monitoreo de la calidad de los datos es una iniciativa tecnológica. Por lo tanto, el Gestor II, en su rol en la Dirección de Tecnología, es el que debe liderar el proyecto. Esta iniciativa busca fortalecer el pilar de Tecnología y Herramientas del gobierno de datos, ya que es la infraestructura que soporta la gestión de la información."
  },
  {
    "id": "gdp2-117",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II, en colaboración con el área de Legal de la DIAN, está definiendo una política de retención de datos para los registros de contribuyentes. ¿Qué componente del gobierno de datos es el que se está desarrollando, y qué principio se busca proteger principalmente en esta situación?",
    "opciones": [
      "El componente de Políticas y Estándares de Datos, y se busca proteger el principio de privacidad y confidencialidad.",
      "El componente de Procesos y Procedimientos, y se busca proteger el principio de seguridad de la información.",
      "El componente de Roles y Responsabilidades, y se busca proteger el principio de integridad."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La definición de una 'política de retención de datos' se enmarca en el componente de Políticas y Estándares de Datos. Al mismo tiempo, al definir cuánto tiempo se deben conservar los datos de los contribuyentes, se busca proteger el principio de privacidad y confidencialidad de la información, lo que es fundamental en la misionalidad de la DIAN."
  },
  {
    "id": "gdp2-118",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección General de la DIAN ha ordenado la creación de un 'Comité de Gobernanza de Datos' para supervisar la gestión de la información en la entidad. Este comité estará compuesto por un representante de cada Dirección de Gestión. ¿Qué rol de gobierno de datos debe tener el representante de la Dirección de Gestión de Impuestos en este comité, y cuál es su principal responsabilidad?",
    "opciones": [
      "El rol de Data Custodian, y su responsabilidad es asegurar la infraestructura tecnológica y la seguridad de los datos de la Dirección de Impuestos.",
      "El rol de Data Steward, y su responsabilidad es implementar las políticas de calidad y estandarización de los datos de la Dirección de Impuestos.",
      "El rol de Data Owner, y su responsabilidad es la de velar por la gestión de la información de la Dirección de Gestión de Impuestos, definiendo las políticas y las reglas de uso de los datos."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La Dirección de Gestión de Impuestos es la responsable máxima de la información tributaria. Por lo tanto, su representante en el 'Comité de Gobernanza de Datos' tiene el rol de Data Owner, y su principal responsabilidad es la de velar por la gestión de la información de su Dirección, definiendo las políticas y las reglas de uso de los datos en la entidad."
  },
  {
    "id": "gdp2-119",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un Gestor II se encuentra en un debate con un colega sobre la importancia del gobierno de datos en la DIAN. El colega argumenta que es una iniciativa 'burocrática' que solo ralentiza los procesos. ¿Cuál es el principal argumento que el Gestor II debería usar para rebatir esta afirmación, y qué beneficio estratégico tiene para la DIAN?",
    "opciones": [
      "El gobierno de datos es un marco de gestión que genera burocracia, pero es necesario para cumplir con la normativa legal de la entidad.",
      "El gobierno de datos, aunque puede parecer burocrático, es un marco de gestión que asegura la calidad, la integridad y la seguridad de los datos, lo que permite la toma de decisiones estratégicas y la eficiencia operativa.",
      "El gobierno de datos es un marco de gestión que solo se aplica a los datos sensibles de la entidad, y no a los datos de uso común, por lo que no genera burocracia en todos los procesos de la DIAN."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El gobierno de datos no es burocracia, es una disciplina de gestión que asegura la calidad, la integridad y la seguridad de los datos. Aunque puede parecer que ralentiza los procesos, en realidad los hace más eficientes al evitar errores, inconsistencias y problemas de seguridad. Este marco permite a la DIAN tomar decisiones estratégicas basadas en información confiable y de alta calidad."
  },
  {
    "id": "gdp2-120",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "La Dirección de Gestión de Fiscalización ha detectado que la información de una de sus bases de datos no es coherente con la información del Repositorio Único de Datos. Esta inconsistencia podría afectar el proceso de auditoría y la imposición de sanciones. ¿Qué pilar del gobierno de datos es el que se ha violado en esta situación, y qué rol o persona es la que debe liderar la corrección?",
    "opciones": [
      "El pilar de Tecnología y Herramientas, y el rol del Data Custodian es el que debe liderar la corrección.",
      "El pilar de Políticas y Estándares de Datos, y el rol del Data Steward es el que debe liderar la corrección.",
      "El pilar de Roles y Responsabilidades, y el rol del Data Owner es el que debe liderar la corrección."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La inconsistencia de la información viola el pilar de Políticas y Estándares de Datos. El rol que se encarga de la implementación de estas políticas y de la estandarización de los datos es el Data Steward, por lo que es el que debe liderar la corrección en la organización, bajo la supervisión del Data Owner."
  },

  {
    "id": "gdp2-121",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Como Gestor II, identificas que un reporte fiscal no incluye los metadatos requeridos. ¿Qué estándar prioritario no se está cumpliendo?",
    "opciones": [
        "Estándar de Seguridad.",
        "Estándar de Metadatos.",
        "Estándar de Interoperabilidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Los metadatos son información esencial sobre los datos (origen, significado, etc.). Su ausencia viola el Estándar de Metadatos de la DIAN."
},
{
    "id": "gdp2-122",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "El Comité de Gobierno de Datos actualiza los estándares de calidad. ¿Cuál es tu primera acción como Gestor II?",
    "opciones": [
        "Implementar los cambios en tus procesos sin revisión.",
        "Capacitarte en los nuevos estándares y ajustar tus procedimientos.",
        "Esperar a que otro equipo los aplique primero."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El Gestor II debe actualizar sus conocimientos y aplicar los estándares vigentes para garantizar la calidad de los datos."
},
{
    "id": "gdp2-123",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un dato fiscal en el DATAR tiene inconsistencia en su formato. ¿Qué política priorizarías para resolverlo?",
    "opciones": [
        "Política de Calidad de Datos.",
        "Política de Acceso.",
        "Política de Retención."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La Política de Calidad exige validar formatos, exactitud y consistencia de los datos en todos los procesos."
},
{
    "id": "gdp2-124",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "¿Qué componente del Gobierno de Datos asegura que un dato pueda rastrearse desde su origen hasta su destino final?",
    "opciones": [
        "Lineage de Datos.",
        "Estándar de Interoperabilidad.",
        "Política de Archivo."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El Lineage (linaje) registra el historial de transformaciones y movimientos de los datos para auditoría y transparencia."
},
{
    "id": "gdp2-125",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un funcionario solicita acceso a datos clasificados como 'Restringidos'. ¿Qué debes verificar primero?",
    "opciones": [
        "Su cargo y permisos según la Política de Acceso.",
        "La hora en que realiza la solicitud.",
        "El tamaño del archivo solicitado."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La Política de Acceso controla quién puede consultar datos según roles y necesidades funcionales."
},
{
    "id": "gdp2-126",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Al migrar datos a un nuevo sistema, ¿qué estándar garantiza que no se pierda información?",
    "opciones": [
        "Estándar de Estructura.",
        "Estándar de Interoperabilidad.",
        "Estándar de Metadatos."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El Estándar de Interoperabilidad asegura que los sistemas puedan intercambiar datos sin pérdida o corrupción."
},
{
    "id": "gdp2-127",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "¿Qué política DIAN exige conservar declaraciones tributarias por 10 años?",
    "opciones": [
        "Política de Privacidad.",
        "Política de Retención.",
        "Política de Calidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Política de Retención define plazos legales para conservar datos, basados en requisitos fiscales y legales."
},
{
    "id": "gdp2-128",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un proveedor externo solicita datos anonimizados para un estudio. ¿Qué política aplicas?",
    "opciones": [
        "Política de Acceso, permitiendo el envío sin modificaciones.",
        "Política de Privacidad, anonimizando los datos personales.",
        "Política de Retención, eliminando datos antiguos."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Política de Privacidad (Ley 1581) exige proteger datos personales mediante técnicas como anonimización."
},
{
    "id": "gdp2-129",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "¿Qué instancia en la DIAN aprueba cambios en los estándares de datos?",
    "opciones": [
        "El área de TI.",
        "El Comité de Gobierno de Datos.",
        "La Subdirección de Servicios al Ciudadano."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El Comité de Gobierno de Datos es la máxima autoridad para definir y modificar estándares."
},
{
    "id": "gdp2-130",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Al generar un reporte para la Contraloría, ¿qué estándar asegura que los datos sean legibles por sus sistemas?",
    "opciones": [
        "Estándar de Seguridad.",
        "Estándar de Interoperabilidad.",
        "Estándar de Metadatos."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El Estándar de Interoperabilidad define formatos y protocolos para compartir datos entre entidades."
},
{
    "id": "gdp2-131",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un dato en el DATAR tiene etiquetas incorrectas. ¿Qué componente del Gobierno de Datos falló?",
    "opciones": [
        "Lineage.",
        "Metadatos.",
        "Política de Retención."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Los metadatos incluyen etiquetas que describen el contenido, origen y uso de los datos."
},
{
    "id": "gdp2-132",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "¿Qué política DIAN se relaciona con la clasificación de datos como 'Públicos', 'Confidenciales' o 'Restringidos'?",
    "opciones": [
        "Política de Seguridad.",
        "Política de Calidad.",
        "Política de Acceso."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La Política de Seguridad define niveles de confidencialidad para proteger la información según su sensibilidad."
},
{
    "id": "gdp2-133",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un auditor pregunta por el historial de modificaciones de un dato. ¿Qué herramienta consultas?",
    "opciones": [
        "El Lineage de Datos.",
        "La Política de Calidad.",
        "El Estándar de Estructura."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El Lineage registra todas las transformaciones y movimientos de un dato a lo largo del tiempo."
},
{
    "id": "gdp2-134",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "¿Qué norma internacional influye en el tratamiento de datos personales de ciudadanos europeos por la DIAN?",
    "opciones": [
        "ISO 8000.",
        "GDPR (Reglamento General de Protección de Datos).",
        "CONPES 3975."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El GDPR (UE) aplica cuando se procesan datos de ciudadanos europeos, incluso fuera de la UE."
},
{
    "id": "gdp2-135",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Al diseñar un nuevo formulario electrónico, ¿qué estándar garantiza que los datos capturados sean consistentes?",
    "opciones": [
        "Estándar de Estructura.",
        "Estándar de Seguridad.",
        "Estándar de Metadatos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El Estándar de Estructura define formatos, tipos de datos y validaciones para asegurar consistencia desde el origen."
},

{
    "id": "gdp2-136",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Como Gestor II, descubres que un proveedor externo está procesando datos fiscales en un servidor no autorizado. Según la Política de Seguridad DIAN, ¿cuál es tu acción prioritaria?",
    "opciones": [
        "Notificar al Comité de Gobierno de Datos y suspender el acceso del proveedor.",
        "Solicitar al proveedor que migre los datos a un servidor seguro en 30 días.",
        "Documentar el caso pero no intervenir hasta tener aprobación superior."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La Política de Seguridad exige acción inmediata ante riesgos de fuga o procesamiento no autorizado de datos sensibles (Art. 12 del Manual de Seguridad DIAN 2024)."
},
{
    "id": "gdp2-137",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Al integrar datos del RUT con un sistema municipal, identificas incompatibilidad en los campos 'actividad económica'. ¿Qué estándar específico del Esquema Nacional de Interoperabilidad debes aplicar?",
    "opciones": [
        "Estándar DGNTI-001: Codificación de actividades económicas con CIIU Rev. 4.",
        "Estándar DIAN-205: Modelo de datos para declaraciones tributarias.",
        "Estándar ISO 38505-2: Gobierno de datos para entidades públicas."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El Esquema Nacional de Interoperabilidad (Decreto 1083 de 2015) exige usar clasificadores comunes como CIIU para actividades económicas."
},
{
    "id": "gdp2-138",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un reporte de inteligencia fiscal requiere cruzar datos del DATAR con información de la UGPP. ¿Qué cláusula de la Política de Interoperabilidad debes verificar primero?",
    "opciones": [
        "Cláusula 4.3: Transferencias sujetas a acuerdos de confidencialidad.",
        "Cláusula 2.1: Uso exclusivo de formatos XML para intercambio.",
        "Cláusula 5.7: Prohibición de compartir datos con entidades de control."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El intercambio con otras entidades debe cumplir acuerdos de confidencialidad y limitarse a fines autorizados (Resolución DIAN 0456/2023)."
},
{
    "id": "gdp2-139",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Identificas que metadatos críticos en el DATAR no siguen el estándar ISO 19115. ¿Qué componente del Lineage es prioritario corregir?",
    "opciones": [
        "Esquema de metadatos administrativos (creador, fecha, responsable).",
        "Metadatos estructurales (formato, codificación, esquema).",
        "Metadatos de calidad (exactitud, completitud, consistencia)."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Los metadatos estructurales son esenciales para interoperabilidad y deben ajustarse a ISO 19115 (Norma Técnica Colombiana NTC 5856)."
},
{
    "id": "gdp2-140",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Al migrar datos históricos a la nube, ¿qué artículo del Decreto 1071 de 2015 regula la ubicación geográfica de los servidores?",
    "opciones": [
        "Artículo 12: Datos deben almacenarse en territorio colombiano.",
        "Artículo 8: Prohibición absoluta de usar nube pública.",
        "Artículo 15: Migración sujeta a aprobación del MinTIC."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El Decreto 1071 (compilado en 1625/2016) exige que datos fiscales se alojen en servidores locales, salvo excepciones autorizadas."
},
{
    "id": "gdp2-141",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Una solicitud de la Procuraduría pide datos personales sin orden judicial. ¿Qué excepción de la Ley 1581 permite compartirlos?",
    "opciones": [
        "Artículo 10: Datos requeridos para investigaciones disciplinarias.",
        "Artículo 15: Compartir con entidades de control sin restricciones.",
        "No existe excepción; siempre se necesita orden judicial."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El Art. 10 de la Ley 1581 permite compartir datos sin consentimiento para funciones de control disciplinario, fiscal o judicial."
},
{
    "id": "gdp2-142",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "¿Qué sección del Estándar DIAN-307 exige validar el 'origen legítimo' de datos antes de cargarlos al DATAR?",
    "opciones": [
        "Sección 4.2: Validación de fuentes autorizadas.",
        "Sección 7.5: Cifrado de datos en tránsito.",
        "Sección 3.1: Metadatos opcionales."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El Estándar DIAN-307 (v.2024) establece en su Sección 4.2 la obligación de verificar fuentes autorizadas para garantizar trazabilidad."
},
{
    "id": "gdp2-143",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un ciudadano alemán ejerce su derecho al olvido bajo el GDPR. ¿Qué política DIAN prevalece sobre la Ley 1581 en este caso?",
    "opciones": [
        "Política de Tratamiento de Datos Transfronterizos (Anexo 12 del Manual DIAN).",
        "Política de Retención de Datos Fiscales.",
        "Ninguna; la Ley 1581 siempre tiene primacía en Colombia."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La Política de Datos Transfronterizos (basada en GDPR) aplica para ciudadanos europeos, incluso si los datos están en Colombia."
},
{
    "id": "gdp2-144",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Al implementar un algoritmo de IA para detectar evasión, ¿qué cláusula del Estándar Ético DIAN-451 debes considerar?",
    "opciones": [
        "Cláusula 9: Prohibición de sesgos en modelos analíticos.",
        "Cláusula 2: Uso exclusivo de software propietario.",
        "Cláusula 5: Eliminación de datos históricos después de 6 meses."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La Cláusula 9 del Estándar DIAN-451 exige auditoría de algoritmos para evitar discriminación (Resolución DIAN 089/2023)."
},
{
    "id": "gdp2-145",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "¿Qué requisito del CONPES 3975 incumple la DIAN si permite que datos abiertos incluyan direcciones completas de contribuyentes?",
    "opciones": [
        "Principio 3: Anonimización para datos personales en publicaciones.",
        "Principio 7: Uso obligatorio de blockchain.",
        "Principio 1: Publicación de todos los datos sin filtros."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El CONPES 3975 (2023) establece que datos abiertos deben proteger privacidad mediante técnicas de anonimización."
},
{
    "id": "gdp2-146",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Una auditoría revela que metadatos en el DATAR no especifican la 'legalidad del origen'. ¿Qué norma técnica incumplen?",
    "opciones": [
        "NTC-ISO/IEC 23053: Metadatos de procedencia.",
        "NTC 5856: Perfil nacional de metadatos.",
        "ISO 8000-120: Calidad de datos financieros."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La NTC 5856 (basada en ISO 19115) exige metadatos de procedencia legal para datos públicos (Art. 4.2)."
},
{
    "id": "gdp2-147",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "¿Qué artículo del Decreto 1081 de 2020 regula la destrucción segura de datos fiscales en dispositivos móviles?",
    "opciones": [
        "Artículo 17: Protocolos de borrado seguro certificado.",
        "Artículo 5: Prohibición de usar dispositivos móviles.",
        "Artículo 12: Retención indefinida en la nube."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El Art. 17 del Decreto 1081 exige métodos de borrado seguro (ej: overwriting) para datos en dispositivos móviles."
},
{
    "id": "gdp2-148",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un sistema heredado no cumple con el Estándar DIAN-410 de encriptación. ¿Qué acción toma el Comité de Gobierno de Datos?",
    "opciones": [
        "Aprobar un plan de adecuación con plazo máximo de 6 meses.",
        "Ordenar su desconexión inmediata del DATAR.",
        "Excluirlo permanentemente de los procesos de interoperabilidad."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El Comité puede autorizar plazos de adecuación para sistemas heredados (Art. 8, Resolución DIAN 102/2024)."
},
{
    "id": "gdp2-149",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Al diseñar una API para el DATAR, ¿qué sección del Estándar DIAN-205 exige autenticación con certificado digital?",
    "opciones": [
        "Sección 8.3: Seguridad en servicios web.",
        "Sección 3.2: Estructura de metadatos.",
        "Sección 5.1: Formatos de archivo."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La Sección 8.3 del Estándar DIAN-205 requiere autenticación fuerte (certificados) para APIs que acceden a datos sensibles."
},
{
    "id": "gdp2-150",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "¿Qué disposición del GDPR afecta el tratamiento de datos de ciudadanos colombianos por una multinacional europea que usa el DATAR?",
    "opciones": [
        "Artículo 3: Aplicación extraterritorial.",
        "Artículo 17: Derecho al olvido automático.",
        "Artículo 45: Prohibición de transferencias a países no-UE."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El Art. 3 del GDPR aplica a empresas europeas aunque procesen datos fuera de la UE, incluyendo datos colombianos."
},
{
    "id": "gdp2-151",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Una sentencia judicial ordena eliminar datos de un contribuyente, pero la Política de Retención DIAN exige conservarlos. ¿Qué prevalece?",
    "opciones": [
        "La sentencia judicial, por ser de mayor jerarquía.",
        "La política interna DIAN, por ser específica.",
        "Se debe buscar un acuerdo entre las partes."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "Las decisiones judiciales prevalecen sobre políticas internas (Art. 4 de la Constitución Colombiana)."
},
{
    "id": "gdp2-152",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "¿Qué requisito del Esquema Nacional de Interoperabilidad incumple un municipio que envía datos fiscales en PDF no editable?",
    "opciones": [
        "Estándar DGNTI-003: Datos deben ser máquina-legibles (JSON/XML).",
        "Estándar DIAN-102: Uso obligatorio de blockchain.",
        "Norma NTC-ISO 32000: PDF/A como formato exclusivo."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El Estándar DGNTI-003 exige formatos estructurados (no PDF) para intercambio de datos entre entidades."
},
{
    "id": "gdp2-153",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un algoritmo de riesgo fiscal usa variables de género. ¿Qué principio del Estándar Ético DIAN-451 viola?",
    "opciones": [
        "Principio 4: Prohibición de discriminación indirecta.",
        "Principio 2: Transparencia en fuentes de datos.",
        "Principio 7: Acceso abierto a modelos algorítmicos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El Principio 4 prohíbe variables potencialmente discriminatorias (género, etnia) en modelos analíticos."
},
{
    "id": "gdp2-154",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "¿Qué artículo de la Ley 2015 de 2020 (Economía de los Datos) autoriza a la DIAN a compartir datos anonimizados con universidades?",
    "opciones": [
        "Artículo 12: Uso de datos para investigación científica.",
        "Artículo 5: Intercambio gratuito entre entidades públicas.",
        "Artículo 8: Venta de datos a terceros."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El Art. 12 permite compartir datos anonimizados con fines de investigación, previa firma de convenios."
},
{
    "id": "gdp2-155",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un contrato con un proveedor de cloud exige cláusulas de soberanía de datos. ¿Qué decreto lo regula?",
    "opciones": [
        "Decreto 1071 de 2015: Datos deben estar en jurisdicción colombiana.",
        "Decreto 1081 de 2020: Seguridad en infraestructura crítica.",
        "Decreto 417 de 2021: Uso prioritario de software libre."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El Decreto 1071 (Art. 12) establece la soberanía de datos fiscales en territorio colombiano."
},

{
    "id": "gdp2-156",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Como Gestor II, identifica que un proceso ETL está transformando datos fiscales sin registrar el lineage completo. Según el Estándar DIAN-410, ¿qué componente crítico falta?",
    "opciones": [
        "Metadatos de procedencia (source-to-target mapping).",
        "Certificado de seguridad SSL para la transferencia.",
        "Documentación en formato PDF del proceso."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El Estándar DIAN-410 exige registrar el lineage completo, incluyendo metadatos de procedencia para auditoría (Art. 7.2 Resolución DIAN 102/2024)."
},
{
    "id": "gdp2-157",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Al implementar un nuevo sistema de análisis predictivo, ¿qué cláusula del Contrato Tipo de Protección de Datos (CTPD) debe incluirse obligatoriamente según la DIAN?",
    "opciones": [
        "Cláusula 12.3: Prohibición de subcontratación sin autorización.",
        "Cláusula 5.1: Uso exclusivo de software libre.",
        "Cláusula 8.7: Eliminación automática después de 30 días."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El CTPD de la DIAN (Anexo 15-A) prohíbe subcontratación sin autorización expresa para proteger datos sensibles."
},
{
    "id": "gdp2-158",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Una solicitud de la Superintendencia de Sociedades pide acceso a datos del RUT sin orden judicial. ¿Qué artículo del Convenio de Interoperabilidad DIAN-Supersociedades lo permite?",
    "opciones": [
        "Artículo 4.2: Intercambio para prevención de delitos fiscales.",
        "Artículo 1.5: Acceso irrestricto a todas las entidades de control.",
        "No existe base legal para este intercambio."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El Art. 4.2 del Convenio DIAN-Supersociedades (2023) autoriza compartir datos para prevención de delitos sin orden judicial."
},
{
    "id": "gdp2-159",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "¿Qué sección del Manual de Seguridad de la Información DIAN regula específicamente el uso de tokens criptográficos para acceso al DATAR?",
    "opciones": [
        "Sección 9.4: Autenticación multifactor para datos críticos.",
        "Sección 3.2: Clasificación de activos de información.",
        "Sección 7.1: Políticas de escritorio limpio."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La Sección 9.4 exige MFA con tokens criptográficos para acceder a datos clasificados como críticos."
},
{
    "id": "gdp2-160",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Al migrar datos a Azure Government, ¿qué requisito del Decreto 1071/2015 incumpliría si no se verifica?",
    "opciones": [
        "Artículo 17: Certificación Tier III del datacenter.",
        "Artículo 12: Ubicación física en territorio colombiano.",
        "Artículo 8: Uso exclusivo de soluciones on-premise."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El Art. 12 exige que los datos fiscales residan en territorio colombiano, salvo excepciones autorizadas."
},
{
    "id": "gdp2-161",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un algoritmo de riesgo fiscal utiliza código postal como variable. ¿Qué principio del Estándar Ético DIAN-451 podría violar?",
    "opciones": [
        "Principio 5: Prohibición de proxies discriminatorios.",
        "Principio 2: Transparencia en fuentes de datos.",
        "Principio 7: Acceso abierto a modelos algorítmicos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El Principio 5 prohíbe variables que puedan actuar como proxies de características protegidas (ej: código postal → estrato socioeconómico)."
},
{
    "id": "gdp2-162",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "¿Qué artículo del Convenio de Transferencia Internacional DIAN-UE regula el flujo de datos de ciudadanos europeos?",
    "opciones": [
        "Artículo 3: Cláusulas Contractuales Estándar.",
        "Artículo 7: Aplicación directa del GDPR.",
        "Artículo 1: Supremacía de la Ley 1581."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El Art. 3 establece las Cláusulas Contractuales Estándar para transferencias internacionales según GDPR."
},
{
    "id": "gdp2-163",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Una API del DATAR no valida certificados TLS 1.3. ¿Qué sección del Estándar DIAN-205 incumple?",
    "opciones": [
        "Sección 8.4: Cifrado en tránsito con TLS 1.2+.",
        "Sección 3.1: Estructura de metadatos.",
        "Sección 5.3: Formatos de archivo preferidos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La Sección 8.4 exige TLS 1.2 o superior para todas las conexiones al DATAR."
},
{
    "id": "gdp2-164",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Al publicar datos abiertos, omitir el campo 'fecha de actualización' viola qué norma técnica?",
    "opciones": [
        "NTC 5856: Metadatos administrativos obligatorios.",
        "ISO 8000-120: Calidad de datos financieros.",
        "RFC 4180: Estándar para CSV."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La NTC 5856 (basada en ISO 19115) exige metadatos administrativos como fecha de actualización (Campo MD_Metadata.dateStamp)."
},
{
    "id": "gdp2-165",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "¿Qué disposición del Manual de Gobierno de Datos DIAN regula la creación de zonas de datos 'restricted' en el DATAR?",
    "opciones": [
        "Capítulo 6: Modelo de seguridad por zonas de confidencialidad.",
        "Anexo 2B: Política de nombres de tablas.",
        "Artículo 12.3: Uso de índices columnar."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El Capítulo 6 establece el modelo de zonas (public, internal, restricted) con controles de acceso diferenciados."
},
{
    "id": "gdp2-166",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un contrato con Oracle Cloud incluye cláusulas de jurisdicción en EE.UU. ¿Qué artículo del Decreto 1071/2015 lo prohibiría?",
    "opciones": [
        "Artículo 12: Soberanía de datos en territorio colombiano.",
        "Artículo 8: Uso prioritario de software libre.",
        "Artículo 15: Prohibición de soluciones SaaS."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El Art. 12 exige que contratos con proveedores cloud mantengan jurisdicción colombiana sobre datos fiscales."
},
{
    "id": "gdp2-167",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Al diseñar un data lake, omitir el tag 'sensitive:true' para datos fiscales viola qué política DIAN?",
    "opciones": [
        "Política de Clasificación de Datos (Anexo 3-B).",
        "Política de Nombres de Archivos.",
        "Política de Retención Documental."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La Política de Clasificación exige etiquetar datos sensibles según su criticidad (Resolución DIAN 045/2024)."
},
{
    "id": "gdp2-168",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "¿Qué artículo del Código de Buen Gobierno de Datos DIAN regula la responsabilidad del Gestor II en calidad de datos?",
    "opciones": [
        "Artículo 4.3: Obligación de validar datos en punto de ingreso.",
        "Artículo 2.1: Uso exclusivo de herramientas certificadas.",
        "Artículo 7.5: Auditorías trimestrales obligatorias."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El Art. 4.3 establece la responsabilidad del Gestor II en validar calidad de datos desde su captura."
},
{
    "id": "gdp2-169",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un proceso de anonymización con k=3 en datos fiscales viola qué estándar?",
    "opciones": [
        "Estándar DIAN-408: Anonymización con k≥5 para datos sensibles.",
        "NTC-ISO 3166: Códigos de país.",
        "RFC 2396: Esquema de URIs."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El Estándar DIAN-408 exige k-anonymity con k≥5 para datos fiscales (Anexo técnico 12-C)."
},
{
    "id": "gdp2-170",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "¿Qué sección del Estándar DIAN-307 exige checksums SHA-256 para archivos en el DATAR?",
    "opciones": [
        "Sección 6.2: Integridad de datos en reposo.",
        "Sección 3.4: Estructura de directorios.",
        "Sección 8.1: Metadatos opcionales."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La Sección 6.2 requiere hashes criptográficos para verificar integridad de archivos."
},
{
    "id": "gdp2-171",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Al integrar datos con la UGPP, omitir el campo 'vigencia fiscal' viola qué acuerdo de interoperabilidad?",
    "opciones": [
        "Anexo 2 del Convenio DIAN-UGPP: Campos obligatorios para cruce.",
        "Resolución 156 de 2020: Formatos JSON exclusivos.",
        "No existe requerimiento para este campo."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El Anexo 2 del Convenio DIAN-UGPP lista 'vigencia fiscal' como campo obligatorio para interoperabilidad."
},
{
    "id": "gdp2-172",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un reporte de inteligencia fiscal usa datos sin actualizar por 6 meses. ¿Qué principio del CONPES 3975 viola?",
    "opciones": [
        "Principio 5: Actualidad como dimensión de calidad.",
        "Principio 2: Uso exclusivo de datos abiertos.",
        "Principio 7: Prohibición de datos históricos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El Principio 5 del CONPES 3975 establece la actualidad como criterio obligatorio para datos estratégicos."
},
{
    "id": "gdp2-173",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "¿Qué artículo del Manual de Cumplimiento GDPR-DIAN regula las transferencias a países sin adequacy decision?",
    "opciones": [
        "Artículo 12: Cláusulas Contractuales Estándar.",
        "Artículo 5: Prohibición absoluta.",
        "Artículo 8: Notificación al Ministerio de TIC."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El Art. 12 permite transferencias usando SCCs cuando no hay decisión de adecuación de la UE."
},
{
    "id": "gdp2-174",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Un proceso de ETL transforma NITs sin conservar el formato estándar. ¿Qué sección del Estándar DIAN-102 incumple?",
    "opciones": [
        "Sección 4.3: Conservación de formatos canónicos.",
        "Sección 7.2: Cifrado en reposo.",
        "Sección 2.1: Metadatos opcionales."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La Sección 4.3 exige mantener formatos estándar (ej: NITs con dígito de verificación) en transformaciones."
},
{
    "id": "gdp2-175",
    "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
    "pregunta": "Al compartir datos con la Contraloría, omitir el campo 'fuente primaria' viola qué norma?",
    "opciones": [
        "Resolución DIAN 045/2024: Lineage obligatorio para intercambios.",
        "Decreto 1083/2015: Uso de XML.",
        "Ley 1581/2012: Protección de datos personales."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La Resolución 045/2024 exige incluir metadata de lineage (incluyendo fuente primaria) en todo intercambio."
},

{
  "id": "gdp2-176",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "La DIAN implementa controles de acceso con roles específicos para acceder a datos institucionales. ¿Qué política respalda esta práctica?",
  "opciones": [
    "Política de Seguridad y Privacidad del Dato.",
    "Política de Interoperabilidad Digital.",
    "Política de Reutilización de Información Pública."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El acceso restringido por roles hace parte de la Política de Seguridad y Privacidad, la cual garantiza la protección y el uso adecuado de los datos sensibles."
},
{
  "id": "gdp2-177",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "Un Gestor II necesita asegurarse de que los reportes institucionales usen datos precisos y completos. ¿Qué política debe aplicar?",
  "opciones": [
    "Política de Calidad del Dato.",
    "Política de Intercambio de Información.",
    "Política de Protección del Usuario."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Política de Calidad del Dato establece lineamientos para asegurar que los datos sean exactos, completos y confiables para la toma de decisiones."
},
{
  "id": "gdp2-178",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "Un informe institucional debe ser compartido con otra entidad pública. ¿Qué política se debe revisar antes de hacerlo?",
  "opciones": [
    "Política de Interoperabilidad de Datos.",
    "Política de Almacenamiento Físico.",
    "Política de Talento Humano y Capacitación."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Política de Interoperabilidad regula cómo debe realizarse el intercambio de datos entre sistemas o entidades públicas de manera segura y estandarizada."
},
{
  "id": "gdp2-179",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "Una dependencia utiliza datos que no han sido verificados por el Data Owner. ¿Qué principio del Gobierno de Datos está incumpliendo?",
  "opciones": [
    "El principio de responsabilidad sobre la calidad y origen del dato.",
    "El principio de automatización del proceso.",
    "El principio de descentralización tecnológica."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Los datos utilizados deben estar validados por el responsable designado (Data Owner), garantizando así su origen, calidad y trazabilidad."
},
{
  "id": "gdp2-180",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "La DIAN decide aplicar ISO 8000 a sus procesos. ¿Qué aspecto busca mejorar esta norma?",
  "opciones": [
    "La calidad y estandarización de los datos institucionales.",
    "El control presupuestal del gasto público.",
    "La gestión de inventarios tecnológicos."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La norma ISO 8000 establece directrices para garantizar la calidad de los datos, asegurando que sean consistentes, precisos y reutilizables."
},
{
  "id": "gdp2-181",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "Una base de datos institucional contiene nombres mal escritos y campos vacíos. ¿Qué política ayuda a corregir estos errores?",
  "opciones": [
    "Política de Calidad del Dato.",
    "Política de Recursos Humanos.",
    "Política de Infraestructura Digital."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Política de Calidad del Dato establece procedimientos para detectar, prevenir y corregir errores que afectan la integridad y utilidad de la información."
},
{
  "id": "gdp2-182",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "Un funcionario requiere acceso a información sensible. ¿Qué documento debe revisar antes de autorizarse el acceso?",
  "opciones": [
    "La Política de Seguridad y Privacidad.",
    "La Política de Compras y Contratación.",
    "El Manual de Etiqueta Institucional."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Política de Seguridad y Privacidad establece los criterios y controles para autorizar el acceso a información clasificada o sensible dentro de la entidad."
},
{
  "id": "gdp2-183",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "Un ciudadano solicita conocer cómo la DIAN trata su información personal. ¿Qué norma respalda este derecho?",
  "opciones": [
    "La Ley 1581 de 2012 sobre Protección de Datos Personales.",
    "El Código General Disciplinario.",
    "La Ley 80 de 1993 sobre Contratación Estatal."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Ley 1581 de 2012 garantiza a los ciudadanos el derecho a conocer, actualizar y rectificar sus datos personales en poder de entidades públicas o privadas."
},
{
  "id": "gdp2-184",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "Una entidad solicita interoperar con los sistemas de la DIAN. ¿Qué se debe asegurar previamente?",
  "opciones": [
    "Que ambas partes cumplan con estándares de interoperabilidad técnica y semántica.",
    "Que la otra entidad tenga un acuerdo verbal previo.",
    "Que se entreguen todos los datos en formato impreso y físico."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Antes de interoperar, es fundamental verificar que ambas entidades apliquen estándares comunes para asegurar una integración eficaz y sin pérdida de información."
},
{
  "id": "gdp2-185",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "La DIAN publica un nuevo conjunto de datos en su portal. ¿Qué estándar debe utilizar para los metadatos?",
  "opciones": [
    "Dublin Core, por su reconocimiento internacional en descripción de metadatos.",
    "ISO 27001, porque se enfoca en normas contables.",
    "DAMABOK, como metodología para formación de usuarios."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Dublin Core es un estándar global para describir metadatos, lo que facilita la comprensión, búsqueda y trazabilidad de conjuntos de datos abiertos o internos."
},
{
  "id": "gdp2-186",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "Un funcionario comparte información sin autorización del Data Owner. ¿Qué política ha sido vulnerada?",
  "opciones": [
    "Política de Acceso y Responsabilidad del Dato.",
    "Política de Eventos y Campañas Públicas.",
    "Política de Infraestructura Física."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Compartir información sin autorización del responsable asignado vulnera la política de acceso, que regula quién puede usar o difundir los datos institucionales."
},
{
  "id": "gdp2-187",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "La DIAN busca alinear sus prácticas de gestión de datos con estándares internacionales. ¿Qué guía puede utilizar como referencia?",
  "opciones": [
    "El DAMA-DMBOK, reconocido mundialmente como marco de buenas prácticas.",
    "El código civil colombiano, por su aplicación jurídica general.",
    "El manual de archivo general, por sus criterios de almacenamiento físico."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El DAMA-DMBOK es una guía internacional que consolida buenas prácticas y principios para la gestión estratégica y operativa de los datos."
},
{
  "id": "gdp2-188",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "En la DIAN se crea un comité para velar por la implementación de las políticas de datos. ¿Cuál es su nombre correcto?",
  "opciones": [
    "Consejo de Gobierno de Datos.",
    "Comité de Sanciones Disciplinarias.",
    "Grupo Técnico de Comunicaciones."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El Consejo de Gobierno de Datos es el órgano encargado de supervisar, definir y evaluar la implementación de políticas, estándares y estrategias relacionadas con los datos."
},
{
  "id": "gdp2-189",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "Un dato sin descripción ni responsable asignado se encuentra en el repositorio institucional. ¿Qué está fallando?",
  "opciones": [
    "El cumplimiento de los estándares de metadatos y gobierno de datos.",
    "La ejecución del plan de medios institucional.",
    "La política de bienestar laboral de los funcionarios."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Todo dato institucional debe contar con metadatos, incluyendo responsable, origen y descripción. Su ausencia refleja fallas en el cumplimiento del modelo de gobierno de datos."
},
{
  "id": "gdp2-190",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "¿Cuál es el propósito principal de aplicar estándares en el tratamiento de datos institucionales?",
  "opciones": [
    "Asegurar coherencia, calidad y trazabilidad en el manejo de la información.",
    "Facilitar la gestión de personal en áreas técnicas.",
    "Limitar el uso de tecnologías modernas por razones de seguridad."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Los estándares permiten mantener uniformidad, integridad, seguridad y reutilización de los datos, fortaleciendo su uso responsable y estratégico."
},

{
  "id": "gdp2-190",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "Durante la implementación de un nuevo sistema de datos en la DIAN, el proveedor propone no incluir metadatos para agilizar el desarrollo. ¿Qué debe indicar el Gestor II?",
  "opciones": [
    "Que es obligatorio incluir metadatos, pues garantizan trazabilidad y comprensión del dato.",
    "Que se puede omitir temporalmente, siempre que se documente el cambio por correo.",
    "Que no son necesarios si el sistema es solo para uso interno del área."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Los metadatos son esenciales en cualquier sistema de gestión de datos, pues permiten su trazabilidad, catalogación y comprensión semántica, conforme a estándares como Dublin Core."
},
{
  "id": "gdp2-191",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "Un informe oficial utiliza datos que provienen de una fuente no certificada. ¿Qué debe hacer el Gestor II?",
  "opciones": [
    "Solicitar que los datos provengan de una fuente avalada por el Data Owner.",
    "Permitir su uso si son consistentes con versiones anteriores.",
    "Autorizar su uso si el equipo técnico afirma que son confiables."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Los datos institucionales deben estar respaldados por responsables designados, como el Data Owner, para garantizar su validez, trazabilidad y legitimidad."
},
{
  "id": "gdp2-192",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "La DIAN planea interoperar con otra entidad pública. ¿Qué paso previo debe verificarse según la política de gobierno de datos?",
  "opciones": [
    "Que ambas instituciones manejen estándares compatibles de interoperabilidad.",
    "Que se haya firmado un convenio general de cooperación en el pasado.",
    "Que el intercambio se limite a datos no personales para evitar riesgos legales."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La interoperabilidad requiere estándares técnicos y semánticos compatibles para permitir un flujo seguro y coherente de datos entre entidades, en concordancia con el modelo de Gobierno Digital."
},
{
  "id": "gdp2-193",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "Un conjunto de datos fue publicado sin incluir los responsables del dato. ¿Qué dimensión del gobierno de datos se está incumpliendo?",
  "opciones": [
    "La asignación de roles y responsabilidades, esencial para trazabilidad.",
    "La interoperabilidad entre sistemas tecnológicos.",
    "La periodicidad de la publicación de datos abiertos."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Uno de los ejes del gobierno de datos es establecer roles claros (Data Owner, Steward, etc.) que permitan identificar responsables de calidad, seguridad y uso del dato."
},
{
  "id": "gdp2-194",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "Durante una auditoría, se detecta que algunos reportes fueron elaborados con datos no estandarizados. ¿Qué política debió aplicarse para evitarlo?",
  "opciones": [
    "La política de calidad y estandarización del dato.",
    "La política de adquisición de software.",
    "La política de manejo presupuestal."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La política de calidad del dato contempla la aplicación de estándares técnicos y semánticos que aseguren la coherencia de la información usada en reportes institucionales."
},
{
  "id": "gdp2-195",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "Una unidad de análisis quiere utilizar un dato sensible para construir indicadores. ¿Qué acción debe tomar el Gestor II?",
  "opciones": [
    "Revisar la política de seguridad y privacidad antes de autorizar su uso.",
    "Facilitar el dato si se anonimiza al final del proceso.",
    "Compartirlo siempre que el resultado no se publique al público general."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Los datos sensibles requieren tratamiento especial según la política de privacidad y la Ley 1581, por lo cual su uso debe estar debidamente autorizado y documentado."
},
{
  "id": "gdp2-196",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "Al implementar una nueva plataforma de datos, un equipo propone eliminar los registros antiguos sin metadatos. ¿Qué debe hacer el Gestor II?",
  "opciones": [
    "Evaluar la posibilidad de conservarlos aplicando metadatos retrospectivos.",
    "Aceptar su eliminación inmediata para liberar espacio y agilidad.",
    "Transferirlos a un sistema externo sin necesidad de validación."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La conservación de datos debe regirse por políticas institucionales de archivo y trazabilidad. En algunos casos, se pueden aplicar metadatos retrospectivos para no perder historial."
},
{
  "id": "gdp2-197",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "Un funcionario comparte datos con un tercero sin autorización formal. ¿Qué política institucional está incumpliendo?",
  "opciones": [
    "La política de acceso y uso responsable de la información.",
    "La política de seguridad laboral y formación.",
    "La política de uso de dispositivos móviles."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El uso no autorizado de datos por parte de terceros viola la política de acceso, que exige controles, permisos y seguimiento sobre el uso de los datos institucionales."
},
{
  "id": "gdp2-198",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "Durante la revisión de un reporte, se encuentran cifras que difieren del Repositorio Único. ¿Qué debe hacerse conforme a las políticas institucionales?",
  "opciones": [
    "Ajustar el reporte usando los datos oficiales certificados por el Repositorio.",
    "Mantener el reporte si los datos se usaron anteriormente.",
    "Corregir los valores manualmente para evitar reclamos posteriores."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Los reportes institucionales deben generarse con base en fuentes oficiales, como el Repositorio Único (DATAR), que garantiza la calidad y trazabilidad del dato."
},
{
  "id": "gdp2-199",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "Se solicita acceso a un conjunto de datos que contiene información personal. ¿Qué debe verificarse antes de autorizar el acceso?",
  "opciones": [
    "Que se cumplan las condiciones de uso definidas en la Ley 1581 de 2012.",
    "Que el solicitante pertenezca a otra entidad del Estado.",
    "Que los datos estén en formato PDF y no editable."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Los datos personales están protegidos por la Ley 1581. El acceso solo se permite si existe una base legal y se respetan los principios de necesidad, finalidad y proporcionalidad."
},
{
  "id": "gdp2-200",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "Una dependencia desea publicar información como datos abiertos. ¿Qué estándar debe seguir?",
  "opciones": [
    "El formato de Datos Abiertos Estándar (OGD) definido por el MinTIC.",
    "El estándar ISO 27001 para seguridad industrial.",
    "La estructura de correo institucional de la DIAN."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El estándar OGD regula la publicación de datos abiertos en formatos estructurados, reutilizables, con metadatos, garantizando accesibilidad y transparencia."
},
{
  "id": "gdp2-201",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "El Consejo de Gobierno de Datos identifica duplicidad de registros en sistemas críticos. ¿Qué acción técnica debe priorizarse?",
  "opciones": [
    "Aplicar procesos de depuración y normalización de datos.",
    "Asignar el doble de personal para control visual de duplicados.",
    "Eliminar registros automáticamente para mejorar rendimiento."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Los procesos de calidad de datos incluyen técnicas de depuración, deduplicación y normalización para garantizar unicidad, consistencia y confiabilidad en los sistemas institucionales."
},
{
  "id": "gdp2-202",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "Un nuevo conjunto de datos es cargado al Repositorio sin verificación previa. ¿Qué principio del gobierno de datos se ve afectado?",
  "opciones": [
    "Calidad desde el origen, ya que los datos no fueron validados al ingresar.",
    "Interoperabilidad, porque los datos están en lenguaje técnico.",
    "Disponibilidad, al no ser publicados a tiempo."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Los datos deben ser validados antes de su incorporación a sistemas oficiales. No hacerlo vulnera el principio de calidad desde el origen, base del modelo de gobierno de datos."
},
{
  "id": "gdp2-203",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "Un conjunto de datos es utilizado por varias dependencias, pero no tiene metadatos. ¿Qué riesgo se genera?",
  "opciones": [
    "Confusión, mal uso y pérdida de trazabilidad del dato.",
    "Mayor velocidad de análisis y reducción de tamaño del archivo.",
    "Mayor acceso por parte de los ciudadanos a través del portal de datos."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Los metadatos definen el significado, origen, uso y responsable del dato. Sin ellos, se generan errores en el análisis, pérdida de contexto y afectación de la toma de decisiones."
},
{
  "id": "gdp2-204",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "El área de TI propone usar datos no homologados por el Data Owner para acelerar una carga. ¿Qué debe hacer el Gestor II?",
  "opciones": [
    "Exigir la homologación previa por el responsable del dato.",
    "Permitirlo si los datos ya se usaron en un ejercicio piloto.",
    "Aprobar su uso si hay presión institucional por el cumplimiento."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Todo dato debe ser validado y homologado por el responsable institucional (Data Owner) antes de su incorporación, como garantía de legalidad y calidad."
},
{
  "id": "gdp2-205",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "Se detecta que dos áreas de la DIAN están utilizando versiones distintas de una misma base de datos. ¿Qué acción debe sugerirse?",
  "opciones": [
    "Centralizar la versión oficial en el Repositorio Único institucional.",
    "Permitir la coexistencia si ambas versiones son similares.",
    "Eliminar la versión menos actualizada sin análisis previo."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El Repositorio Único (DATAR) es la fuente oficial certificada de la DIAN. Toda información institucional debe centralizarse allí para evitar versiones múltiples o contradictorias."
},
{
  "id": "gdp2-206",
  "tema": "Gobierno de Datos (Parte 2): Estándares y Políticas",
  "pregunta": "El comité de gobierno de datos solicita evaluar la madurez institucional. ¿Qué estándar puede apoyar esta tarea?",
  "opciones": [
    "DAMA-DMBOK, que incluye modelos de madurez de gestión de datos.",
    "Ley 80 de 1993, que regula contratación estatal.",
    "ISO 9001, que aplica a procesos productivos industriales."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El DAMA-DMBOK incluye metodologías para diagnosticar y elevar la madurez en la gestión institucional del dato, siendo el marco de referencia internacional más usado en este campo."
}






]