[
  {
    "id": "dom001",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "La DIAN quiere lanzar una estrategia de control en zonas de frontera donde el contrabando ha aumentado. Se requiere coordinación entre el nivel central y las Direcciones Seccionales. Como Gestor II, ¿qué principio organizacional permite articular de forma eficaz la acción de las Direcciones Seccionales con las políticas del nivel central?",
    "opciones": [
      "El principio de descentralización por servicios que asigna total autonomía a las sedes regionales.",
      "El principio de desconcentración que permite delegar funciones a las seccionales bajo supervisión del nivel central.",
      "El principio de centralización operativa, que permite al Director General tomar decisiones exclusivas para todas las zonas."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La DIAN aplica el principio de desconcentración funcional, en donde las Direcciones Seccionales ejecutan funciones delegadas con supervisión técnica del nivel central. Está en línea con el Decreto 4048 de 2008."
  },
  {
    "id": "dom002",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un funcionario de nivel profesional debe presentar un informe sobre el cumplimiento de la misión institucional. ¿Cuál de las siguientes afirmaciones representa mejor la misión de la DIAN?",
    "opciones": [
      "Supervisar y sancionar a todos los contribuyentes sin excepción.",
      "Velar por la seguridad nacional mediante vigilancia tributaria.",
      "Contribuir a la seguridad fiscal del Estado, administrando los tributos y controlando el cumplimiento de las obligaciones tributarias, aduaneras y cambiarias."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "Corresponde al texto oficial de la misión institucional de la DIAN."
  },
  {
    "id": "dom003",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Durante una auditoría interna, se detecta que una Dirección Seccional ha emitido directrices fiscales contradictorias a las del nivel central. ¿Qué órgano debe intervenir para alinear directrices conforme a la estructura institucional?",
    "opciones": [
      "La Oficina de Planeación.",
      "La Dirección General.",
      "La Dirección de Gestión de Grandes Contribuyentes."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Dirección General tiene la máxima autoridad dentro de la estructura de la DIAN y es responsable de la alineación general de políticas y directrices."
  },

  
  {
    "id": "dom004",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un funcionario de la Dirección de Gestión de Impuestos recibe una solicitud de un contribuyente que requiere asistencia para entender un concepto aduanero específico sobre importaciones. ¿Cuál es la acción más adecuada que el funcionario debería tomar?",
    "opciones": [
      "Proceder a explicarle detalladamente el concepto aduanero al contribuyente para resolver su inquietud en el momento.",
      "Redireccionar al contribuyente a la Dirección de Gestión de Aduanas, que es la dependencia especializada en temas aduaneros.",
      "Informar al contribuyente que su solicitud no puede ser atendida por ser de un área diferente y que debe buscar la información por su cuenta."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Cada Dirección de Gestión en la DIAN tiene funciones misionales específicas. La Dirección de Gestión de Aduanas es la encargada de la administración del régimen aduanero y el control de importaciones y exportaciones. Redireccionar al contribuyente a la dependencia competente asegura que reciba la información precisa y adecuada a su necesidad, optimizando el servicio al ciudadano."
  },
  {
    "id": "dom005",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Como Gestor II en el Subproceso de Procesamiento de Datos, se le solicita colaborar en la elaboración de un informe sobre el recaudo del Impuesto sobre las Ventas (IVA) para el último trimestre. ¿Cuál es la Dirección de Gestión de la DIAN que estaría directamente interesada en este informe?",
    "opciones": [
      "La Dirección de Gestión de Aduanas, debido a su rol en el control de mercancías sujetas al IVA.",
      "La Dirección de Gestión de Impuestos, por ser la responsable principal de la administración de este tributo.",
      "La Dirección de Gestión de Fiscalización, dado que su objetivo es verificar el cumplimiento de todas las obligaciones."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Dirección de Gestión de Impuestos es la responsable de la administración, recaudación y fiscalización de los impuestos nacionales, entre ellos el Impuesto sobre las Ventas (IVA). Por lo tanto, sería la Dirección directamente interesada en un informe sobre su recaudo."
  },
  {
    "id": "dom006",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un colega Gestor II está desarrollando una nueva aplicación para optimizar el registro de operaciones de comercio exterior. Surge una duda legal sobre la validez de un tipo de documento electrónico. ¿A qué Dirección de Gestión debería recurrir para obtener una asesoría jurídica formal?",
    "opciones": [
      "A la Dirección de Gestión de Tecnología y Telecomunicaciones, por ser la encargada de la implementación de sistemas.",
      "A la Dirección de Gestión Jurídica, dado que es la dependencia que provee asesoría legal y emite conceptos formales.",
      "A la Dirección de Gestión de Planeación y Proyectos, ya que esta área coordina los nuevos desarrollos institucionales."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Dirección de Gestión Jurídica es la encargada de proporcionar asesoría legal a toda la entidad y emitir conceptos formales sobre aspectos normativos, incluyendo aquellos relacionados con la validez de documentos electrónicos en el comercio exterior. Esto asegura que la nueva aplicación cumpla con la normativa vigente."
  },
  {
    "id": "dom007",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Como Gestor II, usted identifica una inconsistencia importante en un conjunto de datos utilizado para la fiscalización del Impuesto de Renta. Esta inconsistencia podría afectar el proceso de auditoría. ¿Cuál es el valor institucional que mejor describe la acción de reportar y buscar solucionar esta inconsistencia de inmediato?",
    "opciones": [
      "Honestidad, al ser transparente con la información encontrada, aunque pueda generar problemas inmediatos.",
      "Diligencia, al actuar con prontitud y eficiencia para asegurar la calidad de la información y la efectividad del proceso.",
      "Respeto, al demostrar consideración por el trabajo de los compañeros que dependen de esos datos para sus funciones."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La diligencia implica actuar con prontitud, eficiencia y cuidado en la ejecución de las funciones, optimizando el uso de los recursos públicos y buscando constantemente la mejora. Reportar y solucionar una inconsistencia de datos que afecta la fiscalización demuestra un alto grado de diligencia para asegurar la calidad y efectividad de los procesos misionales de la DIAN."
  },
  {
    "id": "dom008",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un ciudadano acude a una Oficina Seccional de la DIAN buscando información sobre cómo puede inscribirse en el Registro Único Tributario (RUT) por primera vez. ¿Qué aspecto de la misionalidad de la DIAN se está activando principalmente con esta interacción?",
    "opciones": [
      "La función de control cambiario, dado que el RUT es necesario para futuras operaciones de importación y exportación.",
      "La función de fiscalización, puesto que el RUT es el primer paso para monitorear las obligaciones tributarias del ciudadano.",
      "La función de servicio al ciudadano, al proporcionar orientación y asistencia para el correcto cumplimiento de las obligaciones tributarias."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "Proporcionar orientación y asistencia a los contribuyentes para el correcto cumplimiento de sus obligaciones es una parte fundamental de la función de servicio al ciudadano de la DIAN. La inscripción en el RUT es una de las primeras interacciones del ciudadano con la entidad para el cumplimiento de sus deberes tributarios."
  },
  {
    "id": "dom009",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Como parte de un equipo interfuncional en la DIAN, se le asigna a usted, Gestor II, la tarea de generar un reporte que combine información de recaudo de impuestos y datos de control aduanero para identificar posibles redes de contrabando. ¿Cuál es el propósito fundamental de la DIAN que este trabajo contribuye a fortalecer?",
    "opciones": [
      "La facilitación de las operaciones de comercio exterior, al simplificar los procesos de importación y exportación.",
      "La administración y recaudo de impuestos nacionales, al asegurar el cumplimiento voluntario de los contribuyentes.",
      "La seguridad fiscal del Estado y la protección del orden público económico, mediante el combate a la evasión y el contrabando."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La identificación de redes de contrabando a través del análisis de datos de recaudo y control aduanero está directamente alineada con el propósito de garantizar la seguridad fiscal del Estado y la protección del orden público económico nacional, previniendo y reprimiendo el contrabando y la evasión."
  },
  {
    "id": "dom010",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "En su rol como Gestor II, usted participa en la implementación de un nuevo estándar de calidad para la documentación de los procesos de gestión de datos. El equipo directivo insiste en que se debe actuar con absoluta transparencia en cada etapa. ¿Qué valor institucional de la DIAN se está priorizando en esta instrucción?",
    "opciones": [
      "La Justicia, al garantizar que todos los procesos sean equitativos para los usuarios y los ciudadanos de la entidad.",
      "La Diligencia, al asegurar que todos los procesos sean ejecutados de forma oportuna y con el menor número de errores.",
      "La Honestidad, al buscar la rectitud, sinceridad y transparencia en todas las acciones y el manejo de la información."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La instrucción de actuar con 'absoluta transparencia' se alinea directamente con el valor de la Honestidad, que implica obrar con rectitud, sinceridad y transparencia, rechazando la mentira y el engaño, y siendo íntegro en el manejo de la información y los procesos institucionales."
  },
  {
    "id": "dom011",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un Gestor II recién incorporado a la Dirección de Gestión de Tecnología y Telecomunicaciones observa que algunos de sus compañeros utilizan sistemas no oficiales para almacenar información sensible de contribuyentes, argumentando que son 'más rápidos'. ¿Qué principio fundamental del Código de Integridad de la DIAN estaría siendo potencialmente vulnerado?",
    "opciones": [
      "El principio de Respeto, al no valorar las opiniones de los compañeros que prefieren los sistemas oficiales.",
      "El principio de Justicia, al crear una desigualdad en el acceso a la información oficial entre los empleados.",
      "El principio de Honestidad / Comportamiento Ético, al comprometer la seguridad y la integridad de la información sensible de forma no autorizada."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "El uso de sistemas no oficiales para almacenar información sensible vulnera los principios de Honestidad y Comportamiento Ético, ya que compromete la seguridad, integridad y confidencialidad de los datos, lo cual es contrario a la transparencia y probidad requeridas en el manejo de la información en una entidad como la DIAN."
  },
  {
    "id": "dom012",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "La Dirección de Gestión de Recaudo de la DIAN ha identificado una mora significativa en el pago de impuestos por parte de un grupo de grandes contribuyentes. ¿Qué Dirección de Gestión debería intervenir para iniciar los procedimientos coactivos y buscar la recuperación de esas deudas?",
    "opciones": [
      "La Dirección de Gestión de Fiscalización, ya que su objetivo es la detección y sanción de incumplimientos tributarios.",
      "La Dirección de Gestión de Cobranzas, que es la encargada de la recuperación de las deudas tributarias y aduaneras.",
      "La Dirección de Gestión de Impuestos, por ser la responsable de la administración general de los tributos nacionales."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Dirección de Gestión de Cobranzas es la dependencia especializada en la recuperación de las deudas tributarias y aduaneras, incluyendo la aplicación de procedimientos coactivos para asegurar el recaudo pendiente."
  },
  {
    "id": "dom013",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un Gestor II es parte de un equipo que está automatizando un proceso de carga de datos para facilitar el trabajo de los analistas. Durante el proceso, un miembro del equipo se niega a colaborar con un colega, argumentando diferencias personales. ¿Qué valor institucional de la DIAN es fundamental promover para que este proyecto avance de manera eficiente?",
    "opciones": [
      "La Honestidad, al ser directos sobre los problemas personales con los demás compañeros de trabajo.",
      "La Justicia, al asegurar que las responsabilidades se distribuyan equitativamente entre los miembros del equipo.",
      "El Respeto, al valorar y tratar con dignidad a todos los miembros del equipo, sus opiniones y su contribución al objetivo común."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "El respeto es fundamental para la colaboración y el trabajo en equipo. Valorar y tratar con dignidad a los colegas, a pesar de diferencias personales, es crucial para mantener un ambiente de trabajo productivo y avanzar en proyectos que requieren el esfuerzo conjunto. Este valor facilita la comunicación y la cooperación necesaria para la eficiencia del proyecto."
  },
  {
    "id": "dom014",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un ciudadano solicita a la DIAN, a través de una oficina seccional, una certificación de un pago de impuesto que realizó hace cinco años. Sin embargo, no recuerda el número de documento con el que hizo el pago. ¿Cuál Dirección de Gestión de la DIAN se encargaría de buscar y proporcionar esta información al ciudadano?",
    "opciones": [
      "La Dirección de Gestión Jurídica, dado que se trata de una solicitud de un documento oficial que debe ser validado.",
      "La Dirección de Gestión de Impuestos, ya que es la responsable de la administración de los tributos y sus registros de pagos.",
      "La Dirección de Gestión de Tecnología y Telecomunicaciones, por ser la que maneja las bases de datos históricas de todos los registros."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Dirección de Gestión de Impuestos es la responsable principal de la administración de los impuestos nacionales, lo que incluye el registro y la custodia de los pagos realizados por los contribuyentes. Por lo tanto, esta dirección es la más adecuada para buscar y emitir certificaciones de pagos de impuestos."
  },
  {
    "id": "dom015",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Como Gestor II, se le asigna la tarea de implementar una nueva herramienta tecnológica para mejorar la detección de patrones de evasión fiscal. Esta iniciativa se enmarca en la visión de la DIAN. ¿Qué característica principal de la visión institucional se estaría buscando potenciar con este tipo de proyecto?",
    "opciones": [
      "Ser reconocida por su capacidad de mantener una estructura jerárquica tradicional y estable a lo largo del tiempo.",
      "Ser reconocida como una administración tributaria y aduanera moderna, eficiente, transparente, y sustentada en el talento humano y el uso intensivo de la tecnología.",
      "Ser reconocida exclusivamente por su alta capacidad de recaudo, sin dar importancia a otros aspectos del servicio."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La implementación de nuevas herramientas tecnológicas para la detección de evasión fiscal se alinea directamente con la visión de la DIAN de ser una administración tributaria y aduanera 'moderna, eficiente, transparente, y sustentada en el talento humano y el uso intensivo de la tecnología'. Esto permite avanzar en la optimización de los procesos y el cumplimiento de su misión."
  },
  {
    "id": "dom016",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un equipo de trabajo en la DIAN debe presentar un informe de gestión del último año que resalte los logros y los desafíos en materia de lucha contra el contrabando. Este informe debe ser de conocimiento de la Dirección General para la toma de decisiones estratégicas. ¿Qué área de la DIAN es fundamental en la coordinación y consolidación de este tipo de informes de alto nivel?",
    "opciones": [
      "La Oficina de Control Interno, dado que su función es asegurar la transparencia y la probidad en la gestión de la entidad.",
      "La Dirección de Gestión de Planeación y Proyectos, por su rol en la formulación del plan estratégico y el seguimiento a la gestión institucional.",
      "La Dirección de Gestión de Aduanas, puesto que son ellos quienes directamente realizan las operaciones contra el contrabando."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Dirección de Gestión de Planeación y Proyectos es la encargada de la formulación del plan estratégico, el seguimiento a la gestión y la coordinación de proyectos institucionales, lo que incluye la consolidación de informes de gestión de alto nivel para la Dirección General, asegurando que la información sea estratégica para la toma de decisiones."
  },
  {
    "id": "dom017",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Durante una jornada de fiscalización, se detecta que una empresa ha evadido una cantidad significativa de impuestos nacionales mediante complejas maniobras contables. ¿Qué Dirección de Gestión de la DIAN es la encargada de iniciar la investigación y aplicar las sanciones correspondientes a esta conducta?",
    "opciones": [
      "La Dirección de Gestión de Cobranzas, debido a que se enfoca en la recuperación de los recursos públicos.",
      "La Dirección de Gestión de Impuestos, ya que administra los tributos y sus declaraciones.",
      "La Dirección de Gestión de Fiscalización, por su función de investigación, detección y sanción de conductas de evasión y elusión."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La Dirección de Gestión de Fiscalización es la encargada de la investigación, detección y sanción de conductas de evasión, elusión y contrabando, a través de procesos de auditoría y control, lo que incluye la aplicación de las sanciones correspondientes."
  },
  {
    "id": "dom018",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Como Gestor II, se le encarga la actualización de un conjunto de datos críticos que utilizan diversas áreas de la DIAN. Durante el proceso, un compañero le pide modificar ciertos registros para favorecer a un conocido, argumentando que 'nadie se dará cuenta'. ¿Qué valor institucional debe primar en su decisión frente a esta solicitud?",
    "opciones": [
      "La Diligencia, al completar la tarea de actualización de datos de la forma más rápida y sin mayores inconvenientes.",
      "La Honestidad / Integridad, al actuar con rectitud, transparencia y probidad, rechazando cualquier acción que comprometa la veracidad de la información y la imparcialidad.",
      "El Respeto, al mantener una buena relación con los compañeros, incluso si sus solicitudes no son totalmente correctas."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La solicitud de modificar registros para favorecer a un conocido es una clara vulneración de la Honestidad y la Integridad. Estos valores implican actuar con rectitud, sinceridad y transparencia, rechazando cualquier acto de engaño o corrupción, y manteniendo la imparcialidad en el manejo de la información, lo cual es fundamental para la seguridad fiscal y la justicia."
  },

  {
  "id": "dom019",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un Gestor II del área de Innovación y Tecnología identifica un error en datos fiscales críticos almacenados en el Repositorio Único. ¿Cuál es el procedimiento adecuado según la estructura DIAN?",
  "opciones": [
    "Corregir directamente los datos en el repositorio y notificar posteriormente al comité de gobierno de datos.",
    "Reportar el hallazgo a la Subdirección de Gestión de Información e Innovación para su validación y corrección.",
    "Documentar el error en un informe trimestral y enviarlo a la Oficina de Planeación."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "La Subdirección de Gestión de Información e Innovación es el área competente para validar y corregir datos críticos, según los protocolos de gobierno de datos de la DIAN."
},

{
  "id": "dom020",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un ciudadano solicita información sobre trámites aduaneros en una Dirección Seccional. ¿Qué área debe atender esta solicitud prioritariamente?",
  "opciones": [
    "La Subdirección de Gestión Tributaria, pues gestiona todos los servicios al ciudadano.",
    "El Grupo de Atención al Usuario Aduanero, dependiente de la Subdirección de Gestión Aduanera.",
    "La Oficina de Control Interno, que supervisa todos los procesos de atención."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "Las consultas sobre trámites aduaneros son competencia exclusiva de los grupos especializados de la Subdirección de Gestión Aduanera en cada seccional."
},

{
  "id": "dom021",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Como Gestor II, usted identifica una posible evasión fiscal en datos procesados. ¿A qué instancia debe reportarlo inicialmente?",
  "opciones": [
    "A la Subdirección de Gestión Tributaria, área encargada de fiscalización.",
    "A la Oficina Jurídica, para que inicie acciones legales inmediatas.",
    "A la Dirección General, por ser un tema de alta sensibilidad."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Subdirección de Gestión Tributaria centraliza los reportes de posibles evasiones para su investigación, conforme al flujo establecido en la estructura DIAN."
},

{
  "id": "dom022",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "¿Qué área de la DIAN sería responsable de resolver una discrepancia en la clasificación arancelaria de una mercancía importada?",
  "opciones": [
    "La Subdirección de Gestión de Información, por manejar los sistemas de datos.",
    "La Dirección Seccional de Aduanas correspondiente al puerto de ingreso.",
    "La Oficina de Planeación, por coordinar procesos estratégicos."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "Las Direcciones Seccionales de Aduanas tienen competencia directa para resolver discrepancias arancelarias en su jurisdicción, según la estructura organizacional."
},

{
  "id": "dom023",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un funcionario de la DIAN requiere orientación sobre la aplicación de una norma tributaria. ¿Qué área debe consultar?",
  "opciones": [
    "La Subdirección de Gestión Aduanera, por su expertise normativo.",
    "La Oficina Jurídica, encargada de la interpretación legal.",
    "La Oficina de Control Interno, que vela por el cumplimiento."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "La Oficina Jurídica es el órgano competente para interpretar normas tributarias y emitir conceptos vinculantes, según la estructura DIAN."
},

{
  "id": "dom024",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "¿Qué instancia lidera la implementación de nuevas tecnologías para el procesamiento de datos en la DIAN?",
  "opciones": [
    "La Subdirección de Gestión de Información e Innovación.",
    "La Oficina de Planeación.",
    "La Subdirección de Gestión Tributaria."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Subdirección de Gestión de Información e Innovación tiene como misión específica la modernización tecnológica, según el Decreto 1071 de 2015."
},

{
  "id": "dom025",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un Gestor II detecta inconsistencias en datos de declaraciones de IVA. ¿Qué área debe analizar estos hallazgos?",
  "opciones": [
    "El Grupo de Fiscalización de la Subdirección de Gestión Tributaria.",
    "La Dirección de Impuestos Nacionales.",
    "La Oficina de Comunicaciones."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Los grupos de fiscalización tributaria son los responsables del análisis de inconsistencias en declaraciones, conforme a los manuales de procesos DIAN."
},

{
  "id": "dom026",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "¿Qué área de la DIAN sería la más indicada para coordinar una capacitación sobre gobierno de datos?",
  "opciones": [
    "La Subdirección de Gestión de Información e Innovación.",
    "La Oficina de Talento Humano.",
    "La Subdirección de Gestión Aduanera."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Esta subdirección tiene la competencia técnica en gobierno de datos, según la Resolución 000067 de 2024 que adopta el MERF."
},

{
  "id": "dom027",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un reporte de inteligencia fiscal identifica posible contrabando. ¿A qué área debe remitirse?",
  "opciones": [
    "A la Subdirección de Gestión Aduanera para investigación.",
    "A la Oficina de Control Interno para auditoría.",
    "A la Dirección General para decisión estratégica."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Subdirección de Gestión Aduanera centraliza las investigaciones sobre contrabando, según los protocolos de la DIAN."
},

{
  "id": "dom028",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "¿Qué instancia aprueba los manuales de procedimientos para el procesamiento de datos en la DIAN?",
  "opciones": [
    "La Subdirección de Gestión de Información e Innovación.",
    "La Oficina de Control Interno.",
    "La Dirección General."
  ],
  "respuesta_correcta_index": 2,
  "explicacion": "La Dirección General es la máxima autoridad para aprobar manuales y políticas institucionales, conforme al Estatuto Orgánico."
},

{
  "id": "dom029",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un Gestor II requiere actualizar los modelos de datos para el Repositorio Único. ¿Qué área debe autorizar este cambio?",
  "opciones": [
    "El Comité de Gobierno de Datos de la Subdirección de Información.",
    "La Oficina Jurídica.",
    "La Subdirección de Gestión Tributaria."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El Comité de Gobierno de Datos es el órgano técnico competente para autorizar cambios en modelos de datos críticos, según política DIAN."
},

{
  "id": "dom030",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "¿Qué área de la DIAN es responsable de diseñar la estrategia de recaudo de impuestos nacionales?",
  "opciones": [
    "La Subdirección de Gestión Tributaria.",
    "La Oficina de Planeación.",
    "La Dirección Seccional correspondiente."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Subdirección de Gestión Tributaria tiene esta competencia exclusiva, según el Artículo 2 del Decreto 1071 de 2015."
},

{
  "id": "dom031",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un ciudadano reclama por un cobro injusto de aranceles. ¿Qué área debe resolver?",
  "opciones": [
    "La Dirección Seccional de Aduanas donde se generó el cobro.",
    "La Subdirección de Gestión de Información.",
    "La Oficina de Comunicaciones."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Las Direcciones Seccionales de Aduanas son primera instancia para resolver reclamos sobre cobros arancelarios en su jurisdicción."
},

{
  "id": "dom032",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "¿Qué instancia debe validar técnicamente una nueva herramienta para análisis de datos fiscales?",
  "opciones": [
    "El Grupo de Arquitectura TI de la Subdirección de Información.",
    "La Oficina de Presupuesto.",
    "La Subdirección de Gestión Aduanera."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El Grupo de Arquitectura TI es el órgano técnico competente para validar herramientas tecnológicas, según los lineamientos de gobierno digital DIAN."
},

{
  "id": "dom033",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un Gestor II identifica que datos de RUT están incompletos. ¿Qué área debe corregir esta situación?",
  "opciones": [
    "El área de Registro Único Tributario de la Subdirección de Gestión Tributaria.",
    "La Oficina de Atención al Ciudadano.",
    "La Dirección de Impuestos Nacionales."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El área especializada en RUT dentro de la Subdirección de Gestión Tributaria es responsable de mantener y actualizar este registro, según manuales de procesos."
},

{
  "id": "dom034",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un funcionario del nivel profesional de una Dirección Seccional debe responder una consulta sobre la visión institucional de la DIAN. ¿Cuál sería la forma correcta de hacerlo?",
  "opciones": [
    "Afirmar que la DIAN busca en 2030 ser reconocida como una entidad moderna, autónoma y local.",
    "Indicar que la DIAN busca en 2030 ser una organización moderna, confiable e inteligente.",
    "Mencionar que la DIAN proyecta en 2030 ser una agencia internacional de control fiscal."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "La visión institucional oficial de la DIAN establece que para el 2030 busca ser una organización moderna, confiable e inteligente que garantiza el cumplimiento voluntario de las obligaciones tributarias, aduaneras y cambiarias."
},
{
  "id": "dom035",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un Gestor II es asignado a un proyecto de interoperabilidad entre bases de datos y necesita coordinar con la dependencia responsable del sistema informático institucional. ¿A cuál dependencia debe acudir?",
  "opciones": [
    "A la Dirección de Gestión de Fiscalización, por su experiencia en análisis de datos.",
    "A la Subdirección de Gestión de Tecnología y Telecomunicaciones, como área encargada de sistemas.",
    "A la Oficina Jurídica, por ser responsable del control normativo de los datos."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "La Subdirección de Gestión de Tecnología y Telecomunicaciones es la responsable de los sistemas informáticos institucionales dentro de la estructura de la DIAN."
},
{
  "id": "dom036",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un nuevo funcionario pregunta por el nivel de la DIAN que coordina las políticas tributarias a nivel nacional. ¿Cuál es la respuesta más adecuada?",
  "opciones": [
    "La Dirección de Gestión de Ingresos, como parte del nivel misional de la entidad.",
    "La Dirección Seccional, al ser la ejecutora directa en cada región.",
    "La Oficina de Control Interno, que valida todas las políticas de ingreso tributario."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Dirección de Gestión de Ingresos hace parte del nivel misional y es la responsable de coordinar las políticas tributarias nacionales."
},
{
  "id": "dom037",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Durante una inducción, se solicita al Gestor II explicar la misión institucional de la DIAN. ¿Cuál sería la descripción más adecuada?",
  "opciones": [
    "La DIAN administra impuestos y tributos para generar empleo en el país.",
    "La DIAN promueve la fiscalización para favorecer el recaudo de impuestos.",
    "La DIAN contribuye a la seguridad fiscal del Estado y al orden público económico nacional."
  ],
  "respuesta_correcta_index": 2,
  "explicacion": "La misión oficial de la DIAN es contribuir a la seguridad fiscal del Estado y a la protección del orden público económico nacional mediante la administración de obligaciones tributarias, aduaneras y cambiarias."
},
{
  "id": "dom038",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un funcionario de una Dirección Seccional solicita emitir una directriz fiscal específica. ¿Cuál es la acción correcta del Gestor II ante esta solicitud?",
  "opciones": [
    "Aceptar, siempre que la directriz se limite a su jurisdicción territorial.",
    "Negarse, ya que emitir directrices fiscales es competencia del nivel central.",
    "Sugerir que lo remita a la Dirección de Gestión de Ingresos para validación técnica."
  ],
  "respuesta_correcta_index": 2,
  "explicacion": "Las directrices fiscales deben estar alineadas con las políticas emitidas desde el nivel central. Por tanto, se debe remitir a la Dirección de Gestión de Ingresos."
},
{
  "id": "dom039",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "En una presentación institucional, el Gestor II debe referirse al tipo de entidad que es la DIAN. ¿Qué afirmación es correcta?",
  "opciones": [
    "La DIAN es una entidad pública descentralizada del orden territorial.",
    "La DIAN es una Unidad Administrativa Especial con autonomía administrativa.",
    "La DIAN es una empresa estatal de economía mixta adscrita al Congreso."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "La DIAN es una Unidad Administrativa Especial con personería jurídica, autonomía administrativa y patrimonio propio, adscrita al Ministerio de Hacienda."
},
{
  "id": "dom040",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un nuevo integrante del equipo pregunta por la función principal del nivel misional de la DIAN. ¿Qué debe responder el Gestor II?",
  "opciones": [
    "El nivel misional se encarga del diseño normativo del régimen sancionatorio fiscal.",
    "El nivel misional ejecuta las funciones principales de fiscalización, recaudo y control.",
    "El nivel misional gestiona el talento humano y los procesos internos administrativos."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "El nivel misional está conformado por las direcciones encargadas de cumplir las funciones operativas principales de la DIAN como el recaudo, control y fiscalización."
},
{
  "id": "dom041",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "El Gestor II debe coordinar una acción que involucra múltiples Direcciones Seccionales. ¿Qué principio organizacional está aplicando?",
  "opciones": [
    "Centralización normativa con ejecución desconcentrada.",
    "Autonomía absoluta de las direcciones regionales.",
    "Federalismo técnico entre los niveles operativos de la DIAN."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La DIAN funciona bajo el principio de centralización normativa con desconcentración funcional, donde las Direcciones Seccionales ejecutan directrices del nivel central."
},
{
  "id": "dom042",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Una colega pregunta por la dependencia responsable de diseñar y evaluar la estructura organizacional de la DIAN. ¿Cuál sería la respuesta del Gestor II?",
  "opciones": [
    "La Dirección de Gestión Organizacional, por su competencia en procesos estructurales.",
    "La Oficina de Planeación, al encargarse de la planificación estratégica.",
    "La Dirección de Gestión de Talento Humano, al liderar temas de personal."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Dirección de Gestión Organizacional lidera el diseño, ajuste y evaluación de la estructura interna y los procesos institucionales de la DIAN."
},
{
  "id": "dom043",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un funcionario asignado a temas de comercio exterior desea saber qué dependencia gestiona las operaciones aduaneras. ¿Qué debe indicarle el Gestor II?",
  "opciones": [
    "La Dirección de Gestión de Ingresos es la encargada de todo lo relacionado con aduanas.",
    "La Dirección de Gestión de Aduanas lidera el control de operaciones aduaneras.",
    "La Subdirección de Talento Humano gestiona el personal operativo en las aduanas."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "La Dirección de Gestión de Aduanas se encarga específicamente del diseño, control y evaluación de las operaciones aduaneras en la DIAN."
},
{
  "id": "dom044",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "En una capacitación, se solicita al Gestor II explicar a qué entidad está adscrita la DIAN. ¿Qué debe responder?",
  "opciones": [
    "Al Departamento Nacional de Planeación.",
    "Al Ministerio de Hacienda y Crédito Público.",
    "A la Contaduría General de la Nación."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "La DIAN es una Unidad Administrativa Especial adscrita al Ministerio de Hacienda y Crédito Público, como lo establece su marco normativo."
},
{
  "id": "dom045",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Durante una supervisión, se pide al Gestor II indicar qué función desarrolla la Oficina de Control Interno. ¿Cuál es la respuesta correcta?",
  "opciones": [
    "Ejecutar auditorías externas para terceros del sector financiero.",
    "Asesorar y evaluar la gestión institucional y los sistemas de control interno.",
    "Emitir conceptos jurídicos sobre normas tributarias para otras entidades públicas."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "La Oficina de Control Interno evalúa la gestión de la entidad, vigila los sistemas de control y propone acciones correctivas para mejorar la operación interna."
},
{
  "id": "dom046",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un equipo interinstitucional solicita que la DIAN participe con información sobre ingresos tributarios. ¿Qué dependencia debe liderar esta gestión?",
  "opciones": [
    "La Dirección de Gestión de Fiscalización, por su contacto con los contribuyentes.",
    "La Dirección de Gestión de Ingresos, por liderar las acciones relacionadas con el recaudo.",
    "La Dirección de Gestión Organizacional, por su enfoque en datos institucionales."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "La Dirección de Gestión de Ingresos lidera los procesos relacionados con el recaudo tributario y la interacción institucional sobre ingresos fiscales."
},
{
  "id": "dom047",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un funcionario afirma que la DIAN actúa también en la vigilancia del cumplimiento del régimen cambiario. ¿Es esto correcto?",
  "opciones": [
    "Sí, hace parte de su misión el control de obligaciones cambiarias.",
    "No, esa función pertenece únicamente al Banco de la República.",
    "No, la DIAN solo controla tributos y aduanas, no operaciones de divisas."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La misión de la DIAN incluye la vigilancia del cumplimiento de obligaciones tributarias, aduaneras y también cambiarias."
},
{
  "id": "dom048",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Una colega pregunta cuál es el fundamento legal principal que define la estructura de la DIAN. ¿Qué debe responder el Gestor II?",
  "opciones": [
    "El Decreto 4048 de 2008, que establece su organización interna.",
    "La Ley 909 de 2004, que regula la carrera administrativa en general.",
    "El Decreto 1083 de 2015, que define los procedimientos fiscales generales."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El Decreto 4048 de 2008 es la norma que define la estructura organizacional y funcional de la DIAN."
},


  {
    "id": "dom049",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un Gestor II de la Dirección de Gestión de Tecnología y Telecomunicaciones detecta una anomalía en un flujo de datos que podría indicar un intento de elusión fiscal por parte de una gran empresa. Esta anomalía no es un error de sistema, sino un comportamiento sospechoso. ¿Cuál es la acción más apropiada que el Gestor II debe tomar inicialmente?",
    "opciones": [
      "Proceder a corregir directamente la anomalía en el flujo de datos para evitar que la situación escale.",
      "Documentar exhaustivamente la anomalía y reportarla a la Dirección de Gestión de Fiscalización para su análisis e investigación pertinente.",
      "Informar a la Oficina de Control Interno para que realice una auditoría inmediata sobre la empresa involucrada."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Detectar anomalías que sugieren elusión fiscal es una alerta que debe ser escalada a la Dirección de Gestión de Fiscalización. Esta Dirección es la especializada en la investigación y detección de conductas de evasión y elusión, por lo que el rol del Gestor II es proporcionar la evidencia y el soporte técnico para que ellos inicien el proceso investigativo, sin exceder sus funciones de gestión de datos."
  },
  {
    "id": "dom050",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "La Dirección General de la DIAN ha solicitado a todas las áreas un informe sobre el cumplimiento de los objetivos estratégicos definidos para el año en curso. Como Gestor II, usted debe contribuir con los datos relacionados con la eficiencia de los sistemas de información. ¿Qué Dirección de Apoyo sería la responsable de consolidar todos estos informes sectoriales para la Dirección General?",
    "opciones": [
      "La Oficina de Comunicaciones, ya que es la encargada de la divulgación interna de todos los logros y desafíos de la entidad.",
      "La Dirección de Gestión de Planeación y Proyectos, por su rol en la formulación del plan estratégico y el seguimiento a la gestión institucional.",
      "La Dirección de Gestión Jurídica, dado que todo informe de cumplimiento debe tener un aval legal antes de ser presentado a la Dirección General."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Dirección de Gestión de Planeación y Proyectos es la encargada de la formulación del plan estratégico y el seguimiento a la gestión institucional. Su función incluye la consolidación y presentación de informes de gestión de alto nivel a la Dirección General para la toma de decisiones estratégicas, asegurando que los objetivos se estén cumpliendo."
  },
  {
    "id": "dom051",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un Gestor II ha descubierto que, debido a un error en una parametrización de un sistema antiguo, algunos registros de pagos de un impuesto nacional no se están reflejando correctamente en el repositorio único de datos. Esto podría afectar el recaudo final. ¿Qué valor institucional de la DIAN está siendo directamente puesto a prueba y debe orientar la corrección inmediata?",
    "opciones": [
      "El Respeto, al asegurar que la información no genere inconvenientes a los contribuyentes que sí realizaron sus pagos.",
      "La Justicia, al garantizar que el recaudo se refleje de manera equitativa y precisa, sin afectar indebidamente a ningún contribuyente o el erario público.",
      "La Honestidad, al reconocer el error interno en el sistema y proceder a la corrección sin ocultar la situación."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Justicia, como valor institucional, implica obrar con equidad e imparcialidad. Asegurar que los registros de pagos de impuestos sean precisos y que el recaudo se refleje correctamente es fundamental para garantizar que ni los contribuyentes ni el Estado sean afectados de manera injusta debido a errores internos. La corrección inmediata bajo este principio busca restablecer la equidad y precisión."
  },
  {
    "id": "dom052",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Como Gestor II en el Subproceso de Procesamiento de Datos, usted recibe una solicitud urgente de la Dirección de Gestión de Aduanas para generar un reporte analítico sobre las principales rutas de ingreso de mercancías con inconsistencias en las declaraciones de importación. ¿Qué aspecto de la misionalidad de la DIAN se está buscando fortalecer directamente con este reporte?",
    "opciones": [
      "La facilitación del comercio exterior, al identificar oportunidades para simplificar el proceso de ingreso de mercancías al país.",
      "La administración y recaudo de impuestos nacionales, al asegurar la correcta declaración de los tributos internos de importación.",
      "La gestión y control aduanero, particularmente en la prevención y represión del contrabando y el fraude aduanero."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La generación de reportes sobre rutas con inconsistencias en declaraciones de importación busca identificar y combatir el contrabando y el fraude aduanero. Esta acción está directamente alineada con la función de gestión y control aduanero de la DIAN, que busca proteger el orden público económico nacional."
  },
  {
    "id": "dom053",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un Gestor II observa que un proceso interno para la atención de Peticiones, Quejas, Reclamos y Sugerencias (PQRS) en su Dirección, aunque funcional, es excesivamente burocrático y genera demoras innecesarias. Desea proponer una mejora. ¿Qué principio o valor institucional debería impulsar esta iniciativa de optimización de procesos?",
    "opciones": [
      "El Compromiso, al demostrar lealtad a la entidad, incluso aceptando los procesos burocráticos establecidos.",
      "La Diligencia, al buscar la eficiencia y eficacia en el servicio, optimizando los tiempos y recursos para una mejor atención al ciudadano.",
      "La Honestidad, al ser transparente sobre las deficiencias del proceso y no intentar ocultarlas a la Dirección General."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La diligencia implica actuar con prontitud, eficiencia y eficacia en el cumplimiento de las funciones y la optimización de los recursos. Proponer mejoras para reducir la burocracia en la atención de PQRS demuestra un compromiso con la diligencia y la búsqueda de un mejor servicio al ciudadano, lo cual es fundamental para una entidad pública."
  },
  {
    "id": "dom054",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un nuevo programa de incentivos para los servidores públicos de la DIAN está siendo socializado. Un Gestor II tiene dudas sobre las bases de liquidación de los bonos por desempeño. ¿Qué Dirección de Apoyo es la más adecuada para resolver estas inquietudes sobre asuntos laborales y de personal?",
    "opciones": [
      "La Dirección de Gestión Jurídica, dado que implica la aplicación de normativas internas y laborales de la entidad.",
      "La Dirección de Gestión de Talento Humano, por ser la responsable de la administración de personal y beneficios laborales.",
      "La Dirección de Gestión de Planeación y Proyectos, ya que los incentivos están ligados al cumplimiento de objetivos estratégicos."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Dirección de Gestión de Talento Humano (o Gestión Humana) es la dependencia encargada de la administración de todo lo relacionado con el personal de la DIAN, incluyendo aspectos como la gestión del desempeño y los beneficios laborales, por lo tanto, es la autoridad para resolver dudas sobre incentivos."
  },
  {
    "id": "dom055",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Como Gestor II, usted es notificado por la Oficina de Control Interno que se realizará una auditoría a los procesos de manejo de información en su área. La solicitud de información es exhaustiva y requiere de gran dedicación. ¿Qué valor institucional de la DIAN es fundamental mantener durante la atención a este requerimiento de la Oficina de Control Interno?",
    "opciones": [
      "El Compromiso, al demostrar lealtad a la entidad, incluso ante auditorías que puedan generar incomodidad al área.",
      "La Honestidad, al proporcionar toda la información de manera veraz y transparente, sin intentar ocultar o manipular datos.",
      "La Diligencia, al entregar la información solicitada de forma oportuna, independientemente de la complejidad o volumen."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Honestidad es clave al interactuar con la Oficina de Control Interno. Implica la rectitud, sinceridad y transparencia en la entrega de información, sin intentar ocultar o manipular datos, lo cual es fundamental para el proceso de auditoría y para la probidad institucional."
  },
  {
    "id": "dom056",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un empresario ha recibido una notificación de la DIAN sobre una inconsistencia en su declaración de cambio de divisas relacionada con una importación. Necesita verificar la exactitud de su información y entender las implicaciones. ¿Qué Dirección de Gestión de la DIAN es la directamente encargada de la fiscalización del control cambiario en materia de importaciones y exportaciones?",
    "opciones": [
      "La Dirección de Gestión de Aduanas, por su relación directa con las operaciones de comercio exterior.",
      "La Dirección de Gestión de Fiscalización, ya que toda inconsistencia cambiaria es un asunto de posible evasión de divisas.",
      "La Dirección de Gestión de Impuestos, dado que la declaración de cambio es un requisito para la liquidación de impuestos asociados."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Dirección de Gestión de Fiscalización es la que ejerce el control y la fiscalización sobre las operaciones de cambio de divisas que se derivan de las importaciones y exportaciones de bienes y servicios, así como de los endeudamientos externos y las inversiones internacionales, en el ámbito de su competencia de control cambiario. Aunque Aduanas y Impuestos tienen relación, la fiscalización de esta materia recae en Fiscalización."
  },
  {
    "id": "dom057",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "En su trabajo como Gestor II, usted es consciente de la gran cantidad de datos que maneja la DIAN y de la sensibilidad de la información tributaria y aduanera. ¿Qué principio fundamental de la misionalidad de la DIAN se busca proteger con la implementación de políticas de seguridad y disponibilidad de datos en el Repositorio Único de Datos (DataR)?",
    "opciones": [
      "La facilitación del comercio exterior, al asegurar que la información esté disponible para los exportadores e importadores.",
      "La administración y recaudo de impuestos nacionales, al garantizar que todos los datos de los contribuyentes sean correctamente procesados.",
      "La seguridad fiscal del Estado y la protección del orden público económico, al salvaguardar la integridad y disponibilidad de información crucial para el control."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La protección de la integridad y disponibilidad de los datos es un pilar de la seguridad fiscal del Estado. La información segura y disponible es crucial para que la DIAN pueda ejercer su control tributario, aduanero y cambiario de manera efectiva, combatiendo la evasión, elusión y el contrabando, y protegiendo así el orden público económico del país."
  },
  {
    "id": "dom058",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un Gestor II es testigo de cómo un compañero de trabajo se dirige de manera despectiva a un contribuyente que ha manifestado confusión sobre cómo diligenciar un formulario. ¿Qué valor institucional de la DIAN se está vulnerando con esta actitud?",
    "opciones": [
      "La Diligencia, al no ser eficiente en la explicación del proceso al contribuyente.",
      "La Honestidad, al no ser transparente sobre la dificultad que tiene el contribuyente en el proceso.",
      "El Respeto, al no tratar con dignidad y consideración al ciudadano que busca asistencia de la entidad."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "El valor del Respeto implica valorar y tratar con dignidad a todas las personas. Dirigirse de manera despectiva a un contribuyente que busca asistencia vulnera directamente este valor, afectando la calidad del servicio y la imagen de la institución."
  },
  {
    "id": "dom059",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "La Dirección General de la DIAN está interesada en medir la percepción de los contribuyentes sobre la facilidad de uso de los servicios en línea que ofrece la entidad. ¿Qué Dirección de Apoyo sería la más adecuada para diseñar y ejecutar una encuesta de satisfacción al usuario?",
    "opciones": [
      "La Dirección de Gestión de Tecnología y Telecomunicaciones, por ser la que desarrolla y mantiene los servicios en línea.",
      "La Oficina de Comunicaciones, por su experiencia en el diseño de encuestas y la gestión de la imagen institucional.",
      "La Dirección de Gestión de Planeación y Proyectos, por su rol en el seguimiento a la gestión y la evaluación del impacto de los servicios."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La Dirección de Gestión de Planeación y Proyectos, al estar a cargo del seguimiento a la gestión y la evaluación de los proyectos e iniciativas institucionales, sería la más adecuada para diseñar y ejecutar una encuesta de satisfacción que mida el impacto de los servicios en línea y su alineación con los objetivos estratégicos de la DIAN."
  },
  {
    "id": "dom060",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Como Gestor II, usted es asignado a un proyecto de implementación de un nuevo sistema de trazabilidad de mercancías en el marco del control aduanero. El objetivo es reducir significativamente los tiempos de inspección. ¿Qué aspecto de la misionalidad de la DIAN se busca optimizar principalmente con este tipo de proyecto?",
    "opciones": [
      "El recaudo de impuestos nacionales, al asegurar la correcta liquidación de los tributos de importación.",
      "La gestión y control aduanero, particularmente en la facilitación de las operaciones de comercio legítimo.",
      "La fiscalización tributaria, al detectar patrones de elusión en las declaraciones de renta de los importadores."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La implementación de un sistema de trazabilidad que reduce los tiempos de inspección en el control aduanero busca, principalmente, la facilitación de las operaciones de comercio exterior. Esto contribuye a la competitividad del país al agilizar los procesos aduaneros para el comercio legítimo, sin descuidar el control."
  },
  {
    "id": "dom061",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un Gestor II, en el desarrollo de sus funciones, identifica la necesidad de capacitar al personal de las Direcciones de Gestión misionales sobre el uso adecuado de las nuevas herramientas de análisis de datos para generar reportes estratégicos. ¿Qué Dirección de Apoyo sería la más idónea para coordinar y ejecutar estas capacitaciones?",
    "opciones": [
      "La Dirección de Gestión de Tecnología y Telecomunicaciones, por ser la que implementa y mantiene las herramientas.",
      "La Dirección de Gestión de Talento Humano, por ser la responsable de la administración del personal y los procesos de capacitación y desarrollo.",
      "La Dirección de Gestión de Impuestos, dado que son los principales usuarios de los reportes estratégicos generados con los datos."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Dirección de Gestión de Talento Humano (o Gestión Humana) es la responsable de la administración del talento humano de la DIAN, lo que incluye el diseño, coordinación y ejecución de los planes de capacitación y desarrollo de los servidores públicos para asegurar que posean las competencias necesarias para el cumplimiento de sus funciones."
  },
  {
    "id": "dom062",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Se ha presentado una situación en la que, debido a una vulnerabilidad de seguridad, parte de la información sensible de los contribuyentes podría haber sido expuesta. Como Gestor II, ¿qué Dirección de Gestión de la DIAN es la encargada principal de investigar y remediar esta brecha de seguridad en los sistemas de información?",
    "opciones": [
      "La Dirección de Gestión Jurídica, dado que es un tema de protección de datos personales y legalidad de la información.",
      "La Dirección de Gestión de Tecnología y Telecomunicaciones, por ser la responsable de la seguridad y el mantenimiento de la infraestructura tecnológica y los sistemas de información.",
      "La Oficina de Control Interno, ya que se trata de una falla en los procedimientos internos que comprometió la confidencialidad de la información."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Dirección de Gestión de Tecnología y Telecomunicaciones es la responsable de la seguridad de los sistemas de información y la infraestructura tecnológica de la DIAN. Por lo tanto, cualquier brecha de seguridad en los datos sería investigada y remediada principalmente por esta Dirección, en coordinación con otras áreas como la Jurídica si hay implicaciones legales."
  },
  {
    "id": "dom063",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un grupo de ciudadanos ha organizado una protesta pacífica frente a una seccional de la DIAN, manifestando su descontento con una nueva medida tributaria. ¿Qué función de la Oficina de Comunicaciones de la DIAN es crucial en esta situación para manejar la percepción pública y la información?",
    "opciones": [
      "Evaluar la legalidad de la protesta y determinar si es necesario enviar una comunicación oficial de rechazo.",
      "Gestionar la relación con los medios de comunicación y la comunicación externa para informar de manera clara y veraz sobre la medida y la postura de la entidad.",
      "Diseñar una estrategia para persuadir a los manifestantes de que depongan su actitud y entiendan el beneficio de la nueva medida."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Oficina de Comunicaciones de la DIAN es la encargada de gestionar la relación con los medios y la comunicación interna y externa de la entidad. En una situación de protesta, su rol es clave para informar de manera clara y veraz, evitando desinformación y manejando la imagen institucional ante la opinión pública."
  },
  {
    "id": "dom064",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Como Gestor II, usted es parte del equipo encargado de desarrollar un nuevo módulo en el sistema de información para el control cambiario. La fase de pruebas revela errores que causan liquidaciones incorrectas. ¿Qué valor institucional de la DIAN está siendo directamente desafiado por estos errores y debe guiar la corrección?",
    "opciones": [
      "El Compromiso, al exigir que el equipo trabaje horas adicionales para solucionar los errores lo más rápido posible.",
      "La Diligencia, al asegurar que el módulo funcione correctamente y las liquidaciones sean precisas, evitando perjuicios a los ciudadanos y al erario.",
      "La Honestidad, al ser transparentes con la Dirección General sobre los errores encontrados en el nuevo módulo de control cambiario."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La diligencia implica actuar con prontitud, eficiencia y cuidado en la ejecución de las funciones. Asegurar que un sistema de liquidación de control cambiario funcione correctamente y produzca liquidaciones precisas es un acto de diligencia que previene perjuicios tanto para los contribuyentes como para el Estado, lo que es fundamental para la misionalidad de la DIAN de proteger el orden público económico."
  },
  {
    "id": "dom065",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un contribuyente se queja ante la Oficina de Control Interno de la DIAN alegando que un funcionario le exigió un 'pago' adicional no contemplado en la ley para agilizar un trámite. ¿Qué principio fundamental de la DIAN se está vulnerando con esta conducta denunciada?",
    "opciones": [
      "La Facilitación del Comercio Exterior, al introducir trámites no establecidos para la importación o exportación de bienes.",
      "La Seguridad Fiscal del Estado, al permitir que los recursos públicos sean desviados mediante actos de corrupción.",
      "La Honestidad / Integridad, al exigir un pago ilegal y actuar de manera contraria a la transparencia y la probidad en el servicio público."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "Exigir un pago ilegal es una clara violación de los valores de Honestidad e Integridad. Estos valores son pilares del Código de Integridad y de la ética en el servicio público, buscando actuar con rectitud, sinceridad y transparencia, y rechazando la corrupción. La Oficina de Control Interno precisamente vela por estos principios."
  },
  {
    "id": "dom066",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Como Gestor II en el Subproceso de Procesamiento de Datos, usted forma parte de un proyecto de análisis de grandes volúmenes de información para identificar tendencias de consumo de productos importados. El objetivo es ajustar las estrategias de control aduanero. ¿Qué área de la DIAN sería la principal beneficiaria directa de los resultados de este análisis?",
    "opciones": [
      "La Dirección de Gestión de Impuestos, para ajustar los impuestos internos a las tendencias de consumo.",
      "La Dirección de Gestión de Aduanas, para optimizar sus estrategias de control y fiscalización en la entrada de mercancías.",
      "La Dirección de Gestión de Cobranzas, para identificar nuevos sujetos de cobro basados en sus hábitos de consumo."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El análisis de tendencias de consumo de productos importados y el ajuste de estrategias de control aduanero son funciones centrales de la Dirección de Gestión de Aduanas. Este tipo de información es clave para que dicha Dirección pueda optimizar su vigilancia y prevenir el contrabando de manera más efectiva."
  },
  {
    "id": "dom067",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Se ha programado una capacitación obligatoria para todo el personal de la DIAN sobre la nueva política de gestión documental. Un Gestor II, aunque ocupado, se asegura de asistir y prestar atención. ¿Qué valor institucional demuestra el Gestor II al priorizar su asistencia a esta capacitación?",
    "opciones": [
      "La Justicia, al garantizar que todos los empleados tengan acceso a la misma información de capacitación.",
      "El Compromiso, al demostrar dedicación y responsabilidad en el cumplimiento de los deberes institucionales y el mejoramiento de sus capacidades.",
      "La Honestidad, al ser transparente con su disponibilidad de tiempo para asistir a la capacitación de la entidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El Compromiso implica demostrar dedicación y responsabilidad en el cumplimiento de los deberes y objetivos institucionales. Asistir a capacitaciones obligatorias, incluso con una agenda apretada, refleja el compromiso del servidor público con su desarrollo profesional y con el fortalecimiento de la entidad en general."
  },
  {
    "id": "dom068",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un jefe de área en la Dirección de Gestión de Impuestos solicita a la Dirección de Gestión de Tecnología y Telecomunicaciones la creación de un nuevo módulo en el portal web de la DIAN para que los contribuyentes puedan presentar un tipo de declaración tributaria que actualmente solo es posible de forma presencial. ¿Qué aspecto de la misionalidad de la DIAN se busca mejorar con esta iniciativa?",
    "opciones": [
      "La gestión y control aduanero, al reducir la necesidad de trámites físicos para los importadores y exportadores.",
      "La facilitación del comercio exterior, al agilizar los procesos documentales relacionados con la actividad aduanera.",
      "El servicio al ciudadano, al proporcionar herramientas en línea para el cumplimiento de obligaciones tributarias, mejorando la experiencia del usuario."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La creación de un módulo en línea para la presentación de declaraciones tributarias es una clara mejora en el servicio al ciudadano. Esta iniciativa busca proporcionar orientación y asistencia de manera más eficiente, facilitando a los contribuyentes el cumplimiento de sus obligaciones y modernizando la interacción con la DIAN."
  },
  {
    "id": "dom069",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "En la DIAN se está llevando a cabo una reestructuración interna que implica cambios en algunos procedimientos y la reubicación de personal. Como Gestor II, aunque su cargo no se ve directamente afectado, observa que algunos colegas están manifestando resistencia al cambio. ¿Qué valor institucional debe fomentar y demostrar para apoyar el proceso de ajuste en la entidad?",
    "opciones": [
      "La Honestidad, al expresar abiertamente su desacuerdo con la reestructuración si considera que no es lo más adecuado para la entidad.",
      "La Diligencia, al enfocarse únicamente en sus propias tareas y evitar involucrarse en la resistencia al cambio de sus compañeros.",
      "El Compromiso, al adaptarse a los nuevos lineamientos y procedimientos, y apoyar activamente la implementación de los cambios en beneficio de la institución."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "El Compromiso implica lealtad con la misión de la DIAN y la dedicación a sus objetivos. En un proceso de reestructuración, demostrar compromiso significa adaptarse a los cambios, apoyar su implementación y contribuir positivamente a la transición, entendiendo que estas medidas buscan el beneficio y la modernización de la entidad."
  },
  {
    "id": "dom070",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un Gestor II es solicitado para contribuir con datos y análisis a una auditoría externa que está evaluando la eficacia de los controles internos en la DIAN. La auditoría es coordinada por la Oficina de Control Interno. ¿Cuál es la misionalidad esencial de la DIAN que se busca fortalecer a través de este proceso de auditoría externa?",
    "opciones": [
      "La facilitación del comercio exterior, al garantizar que los procesos de importación y exportación sean auditados externamente para mayor transparencia.",
      "La administración y recaudo de impuestos nacionales, al asegurar que los procesos de fiscalización tributaria sean constantemente supervisados.",
      "La seguridad fiscal del Estado y la protección del orden público económico, al verificar la transparencia y efectividad de los controles que salvaguardan los recursos."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "Las auditorías externas, coordinadas por la Oficina de Control Interno, buscan verificar la transparencia y efectividad de los controles internos que salvaguardan los recursos y la información de la entidad. Esto se alinea directamente con la misionalidad de la DIAN de garantizar la seguridad fiscal del Estado y la protección del orden público económico, al asegurar que los procesos sean robustos y confiables."
  },
  {
    "id": "dom071",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un aspirante a Gestor II ha escuchado que la DIAN está invirtiendo fuertemente en inteligencia artificial para el análisis de grandes volúmenes de datos. ¿Cómo se alinea esta inversión tecnológica con la visión general de la DIAN?",
    "opciones": [
      "Se alinea con la visión de la DIAN de ser una entidad más burocrática y con menos interacción directa con el ciudadano para evitar sesgos.",
      "Se alinea con la visión de la DIAN de ser una administración tributaria, aduanera y cambiaria moderna, eficiente y sustentada en el uso intensivo de la tecnología.",
      "Se alinea con la visión de la DIAN de depender exclusivamente del talento humano para la toma de decisiones sin la intervención de sistemas complejos."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La inversión en inteligencia artificial para el análisis de datos se alinea directamente con la visión de la DIAN de ser una entidad 'moderna, eficiente, transparente, y sustentada en el talento humano y el uso intensivo de la tecnología'. Esta estrategia busca mejorar la capacidad de gestión y control, optimizando sus procesos misionales."
  },
  {
    "id": "dom072",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Como Gestor II, usted es consciente de que toda información gestionada y procesada en su subproceso de Procesamiento de Datos es un activo estratégico para la DIAN. ¿Qué valor institucional debe primar constantemente en el manejo de esta información para garantizar su buen uso y la confianza ciudadana?",
    "opciones": [
      "La Diligencia, al asegurar que el procesamiento de la información se realice siempre en los tiempos más cortos posibles.",
      "La Honestidad / Integridad, al garantizar la veracidad, confidencialidad y el uso ético de los datos, sin manipulaciones ni acceso no autorizado.",
      "El Respeto, al utilizar la información solo para aquellos propósitos que no generen conflictos con los intereses de los contribuyentes."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Honestidad y la Integridad son valores fundamentales en el manejo de información sensible como la tributaria y aduanera. Estos valores implican actuar con rectitud, transparencia y probidad, garantizando la veracidad, confidencialidad y el uso ético de los datos, lo cual es esencial para mantener la confianza ciudadana y la seguridad fiscal del Estado."
  },
  {
    "id": "dom073",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un equipo de la Dirección de Gestión de Aduanas está preparando un informe de resultados de un operativo reciente contra el contrabando. Necesitan incluir información sobre las sanciones económicas impuestas y su estado de cobro. ¿Qué Dirección de Gestión de la DIAN tiene la competencia para proporcionar los datos más actualizados sobre la situación de cobro de estas sanciones?",
    "opciones": [
      "La Dirección de Gestión de Fiscalización, ya que las sanciones son resultado de su investigación y las emiten directamente.",
      "La Dirección de Gestión Jurídica, dado que las sanciones tienen un componente legal que requiere su validación para el cobro.",
      "La Dirección de Gestión de Cobranzas, por ser la encargada de la recuperación y seguimiento de las deudas y sanciones impuestas."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La Dirección de Gestión de Cobranzas es la dependencia encargada de la recuperación de las deudas tributarias, aduaneras y cambiarias. Por lo tanto, es la autoridad que posee la información más actualizada y relevante sobre el estado de cobro de las sanciones económicas impuestas en operativos contra el contrabando."
  },
  {
    "id": "dom074",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un Gestor II identifica un área de mejora en la colaboración entre la Dirección de Gestión de Tecnología y Telecomunicaciones y la Dirección de Gestión de Impuestos, específicamente en el intercambio de datos para la generación de reportes automáticos. Propone una reunión interdireccional. ¿Qué valor institucional de la DIAN se fomenta directamente con esta iniciativa de coordinación?",
    "opciones": [
      "La Honestidad, al ser transparente sobre los retos de comunicación entre las dos direcciones de la entidad.",
      "La Justicia, al garantizar que todas las áreas de la DIAN tengan igual acceso a la información y recursos disponibles.",
      "El Compromiso, al buscar proactivamente la mejora de los procesos internos y la eficiencia institucional a través de la colaboración."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "El Compromiso implica la dedicación y responsabilidad en la búsqueda del cumplimiento de los objetivos institucionales y la mejora continua. Proponer una reunión interdireccional para optimizar el intercambio de datos y la colaboración es una muestra de compromiso con la eficiencia y la articulación de la DIAN para el cumplimiento de su misión."
  },
  {
    "id": "dom075",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "La Dirección General de la DIAN ha decidido lanzar una nueva campaña nacional para fomentar la cultura de la legalidad tributaria entre los jóvenes. ¿Qué Dirección de Apoyo de la DIAN es la más adecuada para diseñar y ejecutar esta campaña a nivel de difusión y pedagogía pública?",
    "opciones": [
      "La Dirección de Gestión de Talento Humano, al ser la encargada de la formación y desarrollo de los servidores públicos de la entidad.",
      "La Oficina de Comunicaciones, por su experiencia en el diseño de campañas masivas y la gestión de la relación con los medios de comunicación y el público.",
      "La Dirección de Gestión de Impuestos, ya que la campaña se centra en la promoción del cumplimiento tributario entre los jóvenes."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Oficina de Comunicaciones es la dependencia especializada en el diseño y ejecución de campañas de comunicación externa, incluyendo aquellas de pedagogía pública y fomento de la cultura tributaria. Su rol es fundamental para la difusión efectiva de los mensajes institucionales a nivel nacional."
  },
  {
    "id": "dom076",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un Gestor II, como parte de sus funciones, contribuye a mantener actualizado el modelo de datos del Repositorio Único de Datos (DataR). Un usuario de la Dirección de Gestión de Fiscalización necesita un nuevo campo en la base de datos para registrar una tipología específica de fraude. ¿Qué valor institucional debe primar para garantizar que esta solicitud se procese de manera adecuada y sin dilaciones?",
    "opciones": [
      "El Respeto, al priorizar la solicitud del usuario para mantener una buena relación laboral con otras direcciones.",
      "La Honestidad, al ser transparente con el usuario sobre los tiempos de desarrollo y la viabilidad técnica del nuevo campo.",
      "La Diligencia, al actuar con prontitud y eficiencia para incorporar el nuevo campo necesario para las labores misionales de fiscalización."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La diligencia implica actuar con prontitud y eficiencia en el cumplimiento de las funciones. Incorporar un nuevo campo necesario para la tipología de fraude es crucial para las labores misionales de fiscalización, por lo que la diligencia asegura que esta necesidad operativa sea atendida de manera oportuna y efectiva, contribuyendo directamente a la misionalidad de la DIAN."
  },
  {
    "id": "dom077",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un grupo de funcionarios de la DIAN está trabajando en un proyecto para digitalizar completamente los archivos históricos de declaraciones de importación. El objetivo es facilitar la consulta y auditoría de información antigua. ¿Qué función misional de la DIAN se verá directamente beneficiada por este proyecto?",
    "opciones": [
      "El recaudo de impuestos nacionales, al digitalizar la información de los ingresos tributarios históricos del país.",
      "El control cambiario, al permitir una mejor revisión de las divisas asociadas a importaciones pasadas.",
      "La gestión y control aduanero, al mejorar la capacidad de fiscalización y auditoría de operaciones de comercio exterior históricas."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La digitalización de archivos de declaraciones de importación beneficia directamente la función de gestión y control aduanero. Esto mejora la capacidad de la DIAN para fiscalizar y auditar operaciones de comercio exterior históricas, lo cual es fundamental para prevenir y detectar el contrabando y el fraude aduanero."
  },
  {
    "id": "dom078",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Como Gestor II, usted recibe un informe de un experto externo que señala debilidades críticas en la seguridad de la información del Repositorio Único de Datos. El informe sugiere que la vulnerabilidad podría ser explotada. ¿Qué principio de la misionalidad de la DIAN se vería más gravemente comprometido si no se actúa de inmediato?",
    "opciones": [
      "El servicio al ciudadano, al perder la confianza de los contribuyentes en la capacidad de la DIAN para proteger sus datos personales.",
      "La seguridad fiscal del Estado y la protección del orden público económico, al comprometer la integridad y disponibilidad de información crucial para el control y la toma de decisiones.",
      "La facilitación del comercio exterior, al poner en riesgo la información necesaria para agilizar las importaciones y exportaciones."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Una vulnerabilidad crítica en la seguridad de la información del Repositorio Único de Datos comprometería directamente la integridad y disponibilidad de información crucial. Esto, a su vez, afectaría la capacidad de la DIAN para ejercer un control efectivo, poniendo en riesgo la seguridad fiscal del Estado y la protección del orden público económico, al hacer los datos susceptibles de manipulación o pérdida."
  },
  {
    "id": "dom079",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un jefe de área en la Dirección de Gestión de Cobranzas solicita un reporte urgente con información consolidada de los contribuyentes que han incumplido reiteradamente sus obligaciones tributarias en los últimos cinco años, incluyendo sus activos conocidos. ¿Qué Dirección de Apoyo es la más adecuada para proporcionar el soporte tecnológico y de datos para la generación de este tipo de reporte tan específico y voluminoso?",
    "opciones": [
      "La Dirección de Gestión Jurídica, dado que el reporte será utilizado para procesos coactivos que requieren respaldo legal.",
      "La Dirección de Gestión de Talento Humano, por su acceso a la información personal y laboral de los contribuyentes.",
      "La Dirección de Gestión de Tecnología y Telecomunicaciones (o similar), por su capacidad de manejar grandes volúmenes de datos y generar reportes analíticos complejos."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La Dirección de Gestión de Tecnología y Telecomunicaciones (o su equivalente) es la encargada de la infraestructura tecnológica, los sistemas de información y el procesamiento de grandes volúmenes de datos. Por lo tanto, es la dependencia idónea para proporcionar el soporte técnico y de datos necesario para generar reportes analíticos complejos y voluminosos, como el solicitado por la Dirección de Cobranzas."
  },
  {
    "id": "dom080",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un Gestor II, en colaboración con la Dirección de Gestión de Fiscalización, está diseñando un nuevo algoritmo para detectar patrones de facturación falsa. La finalidad última de este algoritmo es aumentar la efectividad en la lucha contra un delito fiscal grave. ¿Qué pilar de la misionalidad de la DIAN se fortalecerá directamente con este avance?",
    "opciones": [
      "La administración y recaudo de impuestos nacionales, al asegurar que los contribuyentes declaren correctamente sus ingresos y eviten la evasión fiscal.",
      "La facilitación del comercio exterior, al agilizar los procesos de facturación en las operaciones de importación y exportación.",
      "El control cambiario, al identificar transacciones fraudulentas que afecten el flujo de divisas de la nación."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La detección de patrones de facturación falsa y el combate a delitos fiscales graves están directamente relacionados con la misionalidad de la DIAN de administrar y recaudar los impuestos nacionales. Este avance busca asegurar que los contribuyentes cumplan con sus obligaciones y que los recursos necesarios para el Estado sean efectivamente recaudados, luchando contra la evasión fiscal."
  },
  {
    "id": "dom081",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Como Gestor II, usted es invitado a una reunión donde la Dirección General presenta los resultados de la implementación del Plan Estratégico Institucional del último año y proyecta los objetivos para el siguiente. ¿Qué valor institucional de la DIAN se refuerza al transparentar estos procesos y resultados a todo el personal?",
    "opciones": [
      "La Diligencia, al mostrar que la entidad es eficiente en el cumplimiento de sus planes y objetivos definidos.",
      "La Honestidad / Transparencia, al comunicar abierta y verazmente los avances y desafíos de la gestión institucional a todos sus miembros.",
      "El Respeto, al valorar la opinión de cada servidor público sobre los resultados del plan estratégico de la entidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Transparentar los procesos y resultados del Plan Estratégico Institucional refuerza el valor de la Honestidad y la Transparencia (parte de la integridad). Al comunicar abierta y verazmente los avances y desafíos, la Dirección General demuestra probidad y fomenta la confianza y el sentido de pertenencia entre los servidores públicos de la DIAN."
  },
  {
    "id": "dom082",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un importador presenta una demanda contra la DIAN alegando que una sanción aduanera impuesta es injusta y carece de sustento legal. La DIAN debe preparar su defensa. ¿Qué Dirección de Gestión de la DIAN es la encargada de representar legalmente a la entidad en este tipo de litigios?",
    "opciones": [
      "La Dirección de Gestión de Aduanas, por ser la que impuso la sanción y conoce los detalles del caso.",
      "La Dirección de Gestión Jurídica, por ser la que proporciona asesoría legal y representa a la entidad en procesos judiciales.",
      "La Dirección de Gestión de Fiscalización, ya que el caso involucra una posible infracción aduanera que fue detectada."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Dirección de Gestión Jurídica es la encargada de proporcionar asesoría legal a toda la entidad y, de manera crucial, de representar a la DIAN en procesos judiciales y administrativos como demandas por sanciones aduaneras. Su rol es asegurar la defensa legal de los intereses institucionales."
  },
  {
    "id": "dom083",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un Gestor II ha diseñado un nuevo panel de control (dashboard) que visualiza en tiempo real los indicadores clave de desempeño del proceso de fiscalización de impuestos nacionales. Este panel permite a los directivos tomar decisiones más rápidas. ¿Qué principio de la misionalidad de la DIAN se optimiza directamente con esta herramienta?",
    "opciones": [
      "La facilitación del comercio exterior, al proporcionar información sobre los indicadores de la aduana a los usuarios internos de la entidad.",
      "La administración y recaudo de impuestos nacionales, al mejorar la capacidad de fiscalización y optimizar la toma de decisiones para combatir la evasión.",
      "El control cambiario, al permitir una visualización más rápida de los indicadores de las operaciones de cambio de divisas."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Un dashboard que visualiza indicadores de fiscalización de impuestos nacionales mejora directamente la capacidad de la DIAN para administrar y recaudar impuestos. Al permitir decisiones más rápidas y efectivas, se optimiza la lucha contra la evasión fiscal, lo que es un pilar fundamental de la misionalidad de la DIAN en este ámbito."
  },
  {
  "id": "dom084",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Como Gestor II, usted identifica que un informe de análisis de datos fiscales contiene información clasificada como reservada. ¿Qué procedimiento debe seguir según los protocolos DIAN?",
  "opciones": [
    "Enviar el informe directamente al área solicitante, marcándolo como confidencial en el encabezado.",
    "Remitir el documento a la Oficina de Seguridad Institucional para validar los canales de distribución.",
    "Consultar con el superior inmediato si es pertinente compartir la información con otras dependencias."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "La Oficina de Seguridad Institucional es la responsable de gestionar información clasificada, según el Manual de Seguridad de la Información DIAN (Resolución 066 de 2024)."
},

{
  "id": "dom085",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Al implementar un nuevo modelo de datos para el Repositorio Único, ¿qué instancia debe validar su alineación con la Arquitectura Digital de la DIAN?",
  "opciones": [
    "El Comité de Gobierno de Datos de la Subdirección de Gestión de Información.",
    "El Grupo de Desarrollo de Software de la misma subdirección.",
    "La Oficina de Control Interno mediante auditoría técnica."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El Comité de Gobierno de Datos es el órgano colegiado encargado de garantizar el cumplimiento de estándares en la arquitectura corporativa (Política de Gobierno de Datos DIAN, Art. 5)."
},

{
  "id": "dom086",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un equipo de la Subdirección de Gestión Tributaria solicita acceso a datos sensibles de importaciones para un estudio. ¿Qué debe verificar el Gestor II antes de proceder?",
  "opciones": [
    "Que la solicitud cuente con aprobación escrita del director de la subdirección solicitante.",
    "Que exista un convenio de confidencialidad firmado y autorización del Comité de Seguridad Informática.",
    "Que el estudio esté incluido en el Plan Anual de Fiscalización de la DIAN."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "El acceso a datos sensibles requiere doble validación: sustento legal (convenio) y autorización del Comité especializado, conforme al Decreto 1081 de 2020 sobre protección de datos."
},

{
  "id": "dom087",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Durante una auditoría, se detecta que datos del RUT están siendo utilizados por un área no autorizada. ¿Qué acción es prioritaria?",
  "opciones": [
    "Notificar a la Oficina de Control Interno para investigación disciplinaria.",
    "Reportar al Comité de Gobierno de Datos para restringir accesos inmediatos.",
    "Solicitar a la Subdirección de Gestión Tributaria que emita un comunicado interno."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "El Comité de Gobierno de Datos tiene facultades para ajustar permisos de acceso de manera inmediata, según el Protocolo de Gestión de Riesgos de Datos DIAN."
},

{
  "id": "dom088",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "¿Qué instancia debe participar cuando se requiere cruzar datos tributarios con información aduanera para una investigación?",
  "opciones": [
    "El Grupo de Inteligencia Fiscal de la Subdirección de Gestión Tributaria.",
    "El Comité Interdisciplinario de Análisis de Riesgos (CIAR).",
    "La Oficina de Tecnologías de la Información para validar compatibilidad técnica."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "El CIAR es el órgano facultado para integrar datos multisectoriales en investigaciones complejas (Manual de Procedimientos DIAN, Cap. 8)."
},

{
  "id": "dom089",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un funcionario de aduanas solicita modificar campos en la base de datos de importaciones para corregir errores. ¿Qué proceso debe seguir el Gestor II?",
  "opciones": [
    "Realizar los cambios solicitados y documentarlos en el sistema de trazabilidad.",
    "Validar la solicitud con el área generadora de los datos originales antes de cualquier ajuste.",
    "Derivar la petición al área de Desarrollo de Sistemas para implementación técnica."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "Todo cambio en datos maestros requiere validación con la fuente primaria, según el Principio de Integridad del Gobierno de Datos DIAN."
},

{
  "id": "dom090",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Al identificar que un proceso de carga de datos fiscales incumple los estándares de calidad, ¿a qué instancia debe escalarse el hallazgo?",
  "opciones": [
    "Al Supervisor inmediato del área generadora del dato.",
    "Al Comité de Calidad de Datos de la Subdirección de Información.",
    "A la Oficina de Control Interno para sanción administrativa."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "El Comité de Calidad de Datos es el responsable de monitorear y corregir desviaciones en procesos de gestión de datos (Política de Calidad DIAN 2024)."
},

{
  "id": "dom091",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "¿Qué área debe intervenir cuando hay discrepancia entre datos del RUT y registros aduaneros para un mismo contribuyente?",
  "opciones": [
    "La Unidad de Conciliación de Bases de Datos de la Subdirección de Información.",
    "El Grupo de Fiscalización de la Subdirección de Gestión Tributaria.",
    "La Dirección Seccional donde está registrado el contribuyente."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Unidad de Conciliación está especializada en resolver inconsistencias entre sistemas corporativos, según el Protocolo de Integridad de Datos DIAN."
},

{
  "id": "dom092",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un reporte de inteligencia identifica patrones de evasión en operaciones de comercio exterior. ¿Qué área debe analizar técnicamente estos hallazgos?",
  "opciones": [
    "La Subdirección de Gestión Aduanera mediante su Grupo de Análisis de Riesgos.",
    "La Oficina de Planeación para evaluación estratégica.",
    "La Subdirección de Gestión Tributaria para cruce con datos fiscales."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El Grupo de Análisis de Riesgos Aduaneros tiene las herramientas técnicas y competencia exclusiva para este tipo de análisis (Manual de Procedimientos Aduaneros, Art. 12)."
},

{
  "id": "dom093",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "¿Qué instancia debe autorizar la integración de una nueva fuente de datos externos al Repositorio Único?",
  "opciones": [
    "El Comité de Arquitectura Corporativa de la Subdirección de Información.",
    "El área usuaria que solicita la integración.",
    "La Oficina Jurídica mediante concepto de viabilidad legal."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El Comité de Arquitectura Corporativa evalúa la compatibilidad técnica y alineación con estándares DIAN antes de cualquier integración (Política de Integración de Datos, Sec. 4.3)."
},

{
  "id": "dom094",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Al desarrollar un dashboard para visualización de datos fiscales, ¿qué normativa es prioritaria considerar?",
  "opciones": [
    "El Manual de Identidad Visual Corporativa de la DIAN.",
    "La Política de Seguridad de la Información para clasificación de datos.",
    "Los Lineamientos de Experiencia de Usuario del Ministerio TIC."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "La visualización de datos fiscales debe cumplir estrictamente con los niveles de confidencialidad establecidos en la Política de Seguridad (Resolución 123 de 2023)."
},

{
  "id": "dom095",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un funcionario solicita acceso temporal a datos restringidos para completar un informe. ¿Qué requisito es indispensable?",
  "opciones": [
    "Aprobación del jefe inmediato mediante oficio formal.",
    "Autorización expresa del Comité de Seguridad de la Información.",
    "Firma de un compromiso de confidencialidad por parte del solicitante."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "El Comité de Seguridad es el único facultado para otorgar accesos excepcionales a datos restringidos (Protocolo de Accesos DIAN v3.1)."
},

{
  "id": "dom096",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "¿Qué área debe participar en la definición de metadatos para un nuevo sistema de procesamiento fiscal?",
  "opciones": [
    "El equipo técnico de desarrollo de software asignado al proyecto.",
    "El Comité de Gobierno de Datos y el área usuaria experta en el tema.",
    "La Subdirección de Gestión Tributaria mediante resolución interna."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "La definición de metadatos requiere trabajo colaborativo entre expertos técnicos (Gobierno de Datos) y funcionales (área usuaria), según estándares DIAN."
},

{
  "id": "dom097",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Al identificar que un proceso ETL está afectando la calidad de datos fiscales, ¿qué documento debe consultar el Gestor II?",
  "opciones": [
    "El Manual de Procedimientos del área usuaria de los datos.",
    "El Protocolo de Monitoreo de Transformaciones de Datos.",
    "El Plan Anual de Fiscalización de la Subdirección competente."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "El Protocolo específico para ETL contiene los parámetros técnicos para validar calidad durante transformaciones (Anexo Técnico 7 de la Política de Datos)."
},

{
  "id": "dom098",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "¿Qué instancia decide sobre la retención o eliminación de datos históricos según la política de ciclo de vida?",
  "opciones": [
    "El Comité de Gobierno de Datos mediante evaluación técnica.",
    "La Oficina de Archivo General de la Nación.",
    "La Subdirección que generó originalmente los datos."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El Comité de Gobierno de Datos evalúa valor legal, fiscal y operativo para decisiones de retención (Política de Ciclo de Vida DIAN, Cap. 3)."
},

{
  "id": "dom099",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un reporte automatizado está generando resultados inconsistentes. ¿Qué área debe realizar el diagnóstico inicial?",
  "opciones": [
    "El equipo de Desarrollo de Sistemas que implementó la solución.",
    "El Grupo de Calidad de Datos de la Subdirección de Información.",
    "El área usuaria que solicitó el reporte."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "El Grupo de Calidad de Datos tiene los protocolos para diagnosticar si el problema es de datos, lógica o procesamiento (Manual de Control de Calidad DIAN)."
},

{
  "id": "dom100",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "¿Qué documento formaliza los roles y responsabilidades en el tratamiento de datos personales en la DIAN?",
  "opciones": [
    "El Manual de Funciones del cargo respectivo.",
    "La Autorización de Tratamiento de Datos Personales.",
    "El Acta de Gobierno de Datos del proyecto específico."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "La Autorización de Tratamiento es el documento legal que asigna responsabilidades según la Ley 1581 de 2012 y políticas internas DIAN."
},

{
  "id": "dom101",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Al diseñar un modelo analítico para detección de evasión, ¿qué área debe validar su alineación con criterios fiscales?",
  "opciones": [
    "La Subdirección de Gestión Tributaria mediante su Grupo de Modelos.",
    "El Comité de Ética de la Dirección General.",
    "La Oficina de Presupuesto para evaluación de costos."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El Grupo de Modelos de la Subdirección de Gestión Tributaria tiene expertise técnico-fiscal para esta validación (Resolución 045 de 2024)."
},

{
  "id": "dom102",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "¿Qué instancia debe aprobar la publicación de estadísticas fiscales derivadas de datos sensibles?",
  "opciones": [
    "El Comité de Comunicaciones de la Dirección General.",
    "El Grupo de Anonimización de Datos de la Subdirección de Información.",
    "La Oficina de Prensa mediante concepto previo."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "El Grupo de Anonimización garantiza que los datos publicados cumplan con estándares de privacidad y no reversibilidad (Protocolo de Datos Abiertos DIAN)."
},

{
  "id": "dom103",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un proceso de migración de datos afecta sistemas críticos de fiscalización. ¿Qué protocolo activar?",
  "opciones": [
    "El Plan de Continuidad del Negocio de la Subdirección afectada.",
    "El Protocolo de Gestión de Cambios del Comité de Arquitectura.",
    "El Procedimiento de Rollback definido por el área de Tecnología."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "El Protocolo de Gestión de Cambios coordina impactos transversales en sistemas interrelacionados (Política de Gestión de Cambios TI DIAN, Art. 8)."
},

{
  "id": "dom104",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un Gestor II está organizando un reporte sobre la eficacia de los canales de atención al ciudadano implementados por la entidad. ¿Cuál dependencia debe consultarse para obtener directrices en esta materia?",
  "opciones": [
    "La Dirección de Gestión de Ingresos, encargada de orientar la atención ciudadana.",
    "La Dirección de Gestión Organizacional, por su rol en procesos y servicios al ciudadano.",
    "La Oficina de Planeación, que gestiona los lineamientos generales de servicio público."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "La Dirección de Gestión Organizacional lidera los procesos institucionales relacionados con atención al ciudadano, calidad del servicio y experiencia del usuario, dentro del marco de su competencia funcional."
},
{
  "id": "dom105",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Durante una auditoría interna, se detectan inconsistencias en los sistemas de información de una Dirección Seccional. ¿Cuál debería ser el primer paso del Gestor II?",
  "opciones": [
    "Informar a la Subdirección de Gestión Estratégica del Talento para establecer sanciones.",
    "Remitir el caso a la Subdirección de Gestión de Tecnología y Telecomunicaciones.",
    "Solicitar la revisión del caso directamente a la Oficina de Comunicaciones Estratégicas."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "La Subdirección de Gestión de Tecnología y Telecomunicaciones es la dependencia competente para atender situaciones que comprometen la integridad y consistencia de los sistemas de información en la DIAN."
},
{
  "id": "dom106",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un ciudadano interpone una queja sobre el procedimiento aduanero en una zona portuaria. ¿Qué dependencia debe gestionar inicialmente esta situación?",
  "opciones": [
    "La Dirección de Gestión de Fiscalización, por su competencia sobre control externo.",
    "La Dirección de Gestión de Aduanas, como responsable de los procedimientos aduaneros.",
    "La Oficina Jurídica, dado que el asunto puede derivar en una acción legal."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "La Dirección de Gestión de Aduanas es la responsable directa del control, supervisión y evaluación de los procedimientos aduaneros, incluyendo la atención a reclamos relacionados con su operación."
},
{
  "id": "dom107",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un Gestor II recibe un requerimiento para emitir directrices de fiscalización a grandes empresas. ¿Qué dirección debe liderar este tipo de acciones?",
  "opciones": [
    "La Dirección de Gestión de Grandes Contribuyentes, por especialidad técnica.",
    "La Dirección de Gestión Organizacional, por estar a cargo de procesos transversales.",
    "La Dirección de Gestión de Ingresos, que concentra el recaudo masivo."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Dirección de Gestión de Grandes Contribuyentes se encarga de aplicar estrategias específicas para el seguimiento, fiscalización y control de los mayores aportantes al sistema tributario nacional."
},
{
  "id": "dom108",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Se requiere una campaña de divulgación nacional sobre cultura tributaria. ¿Cuál oficina debe liderar la coordinación comunicativa de esta estrategia?",
  "opciones": [
    "La Oficina Jurídica, como encargada de validar los contenidos institucionales.",
    "La Oficina de Comunicaciones Estratégicas, por ser la responsable de la imagen institucional.",
    "La Dirección de Gestión de Fiscalización, por tener contacto permanente con contribuyentes."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "La Oficina de Comunicaciones Estratégicas tiene como función diseñar y coordinar las estrategias comunicativas institucionales, incluyendo campañas de cultura tributaria de alcance nacional."
},
{
  "id": "dom109",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un nuevo funcionario confunde la misión con la visión institucional. ¿Cuál es la manera correcta de explicarle la diferencia desde su rol como Gestor II?",
  "opciones": [
    "La misión es el futuro deseado y la visión es la razón de ser actual.",
    "La misión es la razón de ser actual y la visión es la proyección futura de la entidad.",
    "La visión se refiere al presente y la misión a las metas estratégicas del mañana."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "La misión institucional de la DIAN representa su razón de ser y el propósito actual; la visión corresponde a la proyección deseada a futuro, en este caso al año 2030."
},
{
  "id": "dom110",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Se reporta una duplicidad de funciones entre dos direcciones en un proyecto transversal. ¿Cuál es la instancia adecuada para resolver este conflicto organizacional?",
  "opciones": [
    "La Dirección General, como instancia superior de articulación funcional.",
    "La Dirección de Gestión Organizacional, por encargarse de los procesos internos.",
    "La Oficina de Planeación, encargada de la gestión del talento institucional."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Dirección General, como máxima autoridad de la DIAN, tiene la competencia para resolver conflictos de funciones entre dependencias y garantizar la coherencia institucional."
},
{
  "id": "dom111",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un Gestor II necesita aplicar criterios técnicos para estructurar un tablero de control alineado con la estrategia institucional. ¿Con cuál dependencia debería articular?",
  "opciones": [
    "Con la Oficina Jurídica, encargada de supervisar los controles de legalidad.",
    "Con la Oficina de Planeación, por su rol estratégico en el seguimiento institucional.",
    "Con la Dirección de Fiscalización, por manejar procesos técnicos de campo."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "La Oficina de Planeación lidera la formulación, seguimiento y evaluación de la planeación estratégica de la entidad, incluyendo tableros de control institucionales."
},
{
  "id": "dom112",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Durante una revisión interna, se identifica que el modelo de control de integridad institucional no se aplica de forma uniforme. ¿Qué dependencia lidera su implementación?",
  "opciones": [
    "La Oficina de Control Interno, por ser la encargada de evaluar el sistema de integridad.",
    "La Subdirección de Gestión Estratégica del Talento, que vela por el desarrollo humano.",
    "La Dirección de Gestión de Ingresos, responsable de los lineamientos de conducta fiscal."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Oficina de Control Interno tiene a su cargo la evaluación del sistema de control, el seguimiento a políticas de integridad y la vigilancia del cumplimiento de los códigos éticos institucionales."
},
{
  "id": "dom113",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Una administración local de la DIAN solicita lineamientos para aplicar una nueva política sobre atención al usuario. ¿Desde qué nivel debe gestionarse esta solicitud?",
  "opciones": [
    "Desde el nivel asesor, con la Subdirección de Talento Humano.",
    "Desde el nivel central, con la Dirección de Gestión Organizacional.",
    "Desde el nivel seccional, con la Dirección Seccional correspondiente."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "Las políticas de atención al ciudadano deben gestionarse desde el nivel central, específicamente con la Dirección de Gestión Organizacional, que tiene la competencia normativa y operativa en este tema."
},
{
  "id": "dom114",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un equipo de trabajo debe presentar una propuesta de rediseño de procesos institucionales. ¿Con qué dependencia debería coordinar este ejercicio?",
  "opciones": [
    "Con la Dirección de Gestión Organizacional, encargada del rediseño institucional.",
    "Con la Dirección de Gestión de Aduanas, por su experiencia técnica transversal.",
    "Con la Oficina de Comunicaciones, por ser el enlace entre áreas internas."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Dirección de Gestión Organizacional lidera el diseño, rediseño y ajuste de procesos en la entidad, conforme a la estructura y planeación estratégica institucional."
},
{
  "id": "dom115",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Una administración seccional reporta retrasos en el cumplimiento de metas fiscales. ¿Cuál sería la acción más adecuada del nivel central?",
  "opciones": [
    "Solicitar información a la Dirección de Gestión de Ingresos para ajustar los indicadores.",
    "Coordinar con la Dirección General un comité técnico con participación del nivel territorial.",
    "Remitir el caso directamente a la Subdirección de Talento Humano para reestructuración."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "Cuando hay desalineación entre metas e indicadores en las seccionales, el nivel central debe articular soluciones con la Dirección General para convocar comités técnicos e implementar ajustes."
},
{
  "id": "dom116",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Durante la ejecución de un plan institucional, el Gestor II debe verificar el cumplimiento de la función pública. ¿Qué documento debe usar como referencia normativa principal?",
  "opciones": [
    "La Ley 80 de 1993, que regula la contratación estatal.",
    "El Código de Integridad de la DIAN, como marco ético de la función pública.",
    "El Decreto 4048 de 2008, que define la estructura funcional de la DIAN."
  ],
  "respuesta_correcta_index": 2,
  "explicacion": "El Decreto 4048 de 2008 es la norma que establece la estructura interna y la asignación funcional de competencias dentro de la DIAN, siendo base fundamental para entender su organización."
},
{
  "id": "dom117",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Una alianza interinstitucional requiere datos agregados sobre el comportamiento tributario por región. ¿Qué área debe centralizar esta solicitud?",
  "opciones": [
    "La Dirección de Gestión de Fiscalización, por su base de datos regional.",
    "La Dirección de Gestión de Ingresos, que concentra los datos nacionales por región.",
    "La Oficina de Planeación, que consolida los informes de gestión estratégica."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "La Dirección de Gestión de Ingresos centraliza los registros sobre el comportamiento tributario y puede ofrecer los datos por región en coordinación con las áreas técnicas."
},
{
  "id": "dom118",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un funcionario del nivel central desea fortalecer las competencias en temas misionales de la entidad. ¿Qué dependencia podría coordinar una ruta formativa especializada?",
  "opciones": [
    "La Subdirección de Gestión de Talento Humano, por su competencia en desarrollo.",
    "La Oficina Jurídica, al ser responsable del conocimiento normativo general.",
    "La Dirección de Gestión de Aduanas, por su experiencia en capacitación técnica."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Subdirección de Gestión de Talento Humano diseña e implementa programas de formación técnica y misional, según el perfil y funciones del personal de la DIAN."
},
{
  "id": "dom119",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Una ciudadanía organizada presenta una solicitud formal para modificar ciertos servicios digitales de atención. ¿Cuál es el camino más adecuado para gestionar esta petición?",
  "opciones": [
    "Remitir el caso a la Dirección de Gestión Organizacional, encargada del servicio al usuario.",
    "Enviar el requerimiento a la Dirección General para su validación inmediata.",
    "Asignarlo directamente a la Dirección de Fiscalización por temas de contacto ciudadano."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Dirección de Gestión Organizacional es la dependencia responsable de mejorar y adaptar los servicios de atención al ciudadano, incluidos los canales digitales."
},
{
  "id": "dom120",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un Gestor II realiza una presentación institucional en un foro académico. ¿Cuál sería la afirmación más precisa sobre el rol de la DIAN?",
  "opciones": [
    "La DIAN solo administra impuestos nacionales y aduanas.",
    "La DIAN ejerce funciones tributarias, aduaneras y cambiarias en el marco de la legalidad.",
    "La DIAN es una empresa del Estado que maneja tributos con autonomía comercial."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "La DIAN es una Unidad Administrativa Especial que cumple funciones tributarias, aduaneras y cambiarias conforme al marco legal, contribuyendo a la seguridad fiscal del Estado."
},

  {
    "id": "dom121",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un Gestor II, responsable de la integridad del Repositorio Único de Datos, identifica que un reciente cambio normativo aduanero no ha sido plenamente reflejado en la estructura de una de las bases de datos de comercio exterior, lo que podría generar inconsistencias en los reportes de fiscalización aduanera. La Dirección de Gestión de Aduanas desconoce esta omisión. ¿Cuál es la acción más estratégica para el Gestor II, priorizando la misionalidad de la DIAN?",
    "opciones": [
      "Proceder unilateralmente a realizar la actualización de la base de datos basándose en el cambio normativo para asegurar la coherencia inmediata de la información.",
      "Documentar la omisión y coordinar urgentemente con la Dirección de Gestión de Aduanas y la Dirección de Gestión de Tecnología y Telecomunicaciones para planificar la adecuación, explicando las implicaciones para la fiscalización aduanera.",
      "Generar un reporte detallado de las inconsistencias proyectadas y enviarlo directamente a la Dirección General para que tome una decisión sobre la corrección."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Aunque la corrección es urgente, el Gestor II debe coordinar con las Direcciones competentes (Aduanas por la normativa y Tecnología por la base de datos) para una solución integral. Actuar unilateralmente podría crear más problemas de gobernanza de datos. Escalar directamente a Dirección General sin una propuesta de solución coordinada puede ser prematuro y no eficiente."
  },
  {
    "id": "dom122",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "La Dirección General de la DIAN ha priorizado la lucha contra las estructuras de contrabando sofisticado que utilizan mecanismos financieros complejos para el lavado de activos. Como Gestor II, se le asigna la tarea de desarrollar modelos analíticos avanzados. ¿Qué combinación de Direcciones de Gestión se beneficiaría más directamente de sus hallazgos, reflejando la misionalidad interconectada de la DIAN?",
    "opciones": [
      "Dirección de Gestión de Impuestos y Dirección de Gestión Jurídica, para asegurar la correcta imputación de sanciones penales.",
      "Dirección de Gestión de Aduanas y Dirección de Gestión de Fiscalización, para fortalecer el control de entrada de mercancías y la detección de ilícitos económico-financieros.",
      "Dirección de Gestión de Cobranzas y Dirección de Gestión de Talento Humano, para optimizar la recuperación de activos y la capacitación del personal."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La lucha contra el contrabando y el lavado de activos es una función compartida. Aduanas se enfoca en el control de mercancías, mientras que Fiscalización se encarga de la detección de ilícitos económicos y financieros, incluyendo lavado de activos. Sus hallazgos son cruciales para ambas áreas en el cumplimiento de la misionalidad de protección del orden público económico."
  },
  {
    "id": "dom123",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Durante una auditoría interna realizada por la Oficina de Control Interno, se detecta que un servidor público de otra Dirección está utilizando un software de terceros no autorizado para gestionar información clasificada, argumentando mayor eficiencia. El Gestor II es consultado sobre el riesgo tecnológico. ¿Cuál debería ser el enfoque del Gestor II al responder, priorizando la seguridad fiscal y los valores institucionales?",
    "opciones": [
      "Reconocer la posible eficiencia del software, pero enfatizar el incumplimiento de las políticas de seguridad de la información y los riesgos para la integridad y confidencialidad de los datos, sugiriendo la desinstalación inmediata y el uso de herramientas oficiales.",
      "Minimizar el riesgo, argumentando que muchos servidores utilizan herramientas no autorizadas por la ineficiencia de los sistemas internos, pero recomendar una evaluación técnica posterior.",
      "Sugerir una política más flexible que permita el uso de software de terceros si demuestra ser eficiente, siempre y cuando se notifique a la Dirección de Gestión de Tecnología y Telecomunicaciones."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El uso de software no autorizado para información clasificada es una grave violación de la seguridad de la información y los principios de integridad y confidencialidad, pilares de la seguridad fiscal. El Gestor II debe ser firme en la condena de esta práctica y abogar por el cumplimiento estricto de las políticas, priorizando la seguridad y la confianza de los datos de la DIAN."
  },
  {
    "id": "dom124",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "La Dirección General ha emitido una directriz para integrar todos los datos de 'Grandes Contribuyentes' en un único panel de control estratégico, accesible solo por directivos de alto nivel. La complejidad radica en la diversidad de fuentes (tributarias, aduaneras, cambiarias) y la necesidad de una gobernanza de datos rigurosa. ¿Qué valor institucional de la DIAN es más desafiado y simultáneamente fortalecido por este proyecto, y por qué?",
    "opciones": [
      "La Diligencia, al requerir un esfuerzo significativo para consolidar los datos de manera rápida y eficiente para una visualización unificada.",
      "La Justicia, al garantizar que la información de los Grandes Contribuyentes se trate con imparcialidad y equidad en todas las esferas de control de la entidad.",
      "La Integridad/Honestidad, al asegurar la veracidad, coherencia y confidencialidad de los datos sensibles de los contribuyentes desde múltiples fuentes, reforzando la confianza en la gestión de la información por la DIAN."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La consolidación de datos sensibles de Grandes Contribuyentes de múltiples fuentes para un panel estratégico de alto nivel es un desafío directo a la Integridad y Honestidad. El proyecto fortalece estos valores al requerir una gestión impecable de la veracidad, coherencia y confidencialidad de la información, lo que es esencial para la confianza en la seguridad fiscal del Estado y en el manejo ético de los datos por parte de la DIAN."
  },
  {
    "id": "dom125",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Como Gestor II, usted detecta un error sistémico en la aplicación de una nueva retención en la fuente a ciertos contribuyentes, lo que ha generado cobros excesivos por parte de la DIAN. La corrección implicaría reversar múltiples transacciones y podría afectar temporalmente los indicadores de recaudo. ¿Cuál es la acción que mejor equilibra la misionalidad de la DIAN y sus valores fundamentales?",
    "opciones": [
      "Priorizar la estabilidad del indicador de recaudo, buscando una solución que minimice el impacto visible, incluso si retrasa la corrección completa a los contribuyentes afectados.",
      "Comunicar urgentemente el hallazgo a la Dirección de Gestión de Impuestos y a la Dirección de Gestión de Tecnología y Telecomunicaciones para coordinar la corrección inmediata, asegurando la restitución de los excesos, en pro de la Justicia y el servicio al ciudadano, y luego gestionar el impacto en los indicadores.",
      "Corregir silenciosamente el error en el sistema sin comunicar el alcance total a las Direcciones involucradas para evitar un impacto negativo en la percepción de la gestión tecnológica."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Detectar cobros excesivos requiere una acción urgente que priorice la Justicia y el servicio al ciudadano. Coordinar con Impuestos (responsable del tributo) y Tecnología (responsable del sistema) es clave para una corrección eficiente y la restitución de los montos, lo cual está por encima de la preocupación inmediata por los indicadores, demostrando integridad y cumplimiento de la misionalidad social de la DIAN."
  },
  {
    "id": "dom126",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "La Dirección de Gestión Jurídica requiere un análisis de datos complejos sobre la litigiosidad de la DIAN en casos de fiscalización aduanera. El Gestor II debe proporcionar este análisis. ¿Qué dos propósitos misionales de la DIAN se interrelacionan más directamente a través de esta solicitud?",
    "opciones": [
      "Administración y Recaudo de Impuestos Nacionales, y Servicio al Ciudadano.",
      "Gestión y Control Aduanero, y Gestión de la Información y Análisis de Riesgos.",
      "Control Cambiario y Facilitación del Comercio Exterior."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La litigiosidad en casos de fiscalización aduanera es un resultado directo de la Gestión y Control Aduanero. El análisis de estos datos por el Gestor II cae bajo la Gestión de la Información y Análisis de Riesgos, ya que busca identificar patrones y mejorar estrategias legales y de control. Esta interconexión es crucial para la eficacia de la DIAN."
  },
  {
    "id": "dom127",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un jefe de oficina seccional de la DIAN ha recibido quejas recurrentes de contribuyentes sobre la complejidad de un nuevo aplicativo web para declaraciones de renta, lo que genera alta frustración y errores. El jefe desea proponer mejoras. ¿Qué principio de la visión de la DIAN debe ser el principal motor de esta propuesta de mejora?",
    "opciones": [
      "Ser una administración tributaria y aduanera que se enfoque en el control riguroso de las obligaciones, sin excepciones por la complejidad de los sistemas.",
      "Ser una administración tributaria y aduanera moderna, eficiente, transparente, y sustentada en el talento humano y el uso intensivo de la tecnología, con un enfoque en el servicio al ciudadano.",
      "Ser una administración tributaria y aduanera que garantice la sostenibilidad fiscal, priorizando el recaudo por encima de la experiencia del usuario en los aplicativos."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La visión de la DIAN como una entidad moderna y eficiente, sustentada en la tecnología, implica una preocupación por la experiencia del usuario. La complejidad de un aplicativo web para declaraciones de renta es una barrera para el servicio al ciudadano, por lo que su optimización se alinea con la búsqueda de eficiencia y transparencia en la interacción digital."
  },
  {
    "id": "dom128",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Como Gestor II, usted es parte de un equipo interdireccional (Fiscalización, Aduanas, Tecnología) que busca desarrollar un sistema predictivo para identificar grandes movimientos de capital que podrían estar relacionados con el lavado de activos derivado del contrabando. ¿Qué valor institucional de la DIAN es más críticamente exigido y puesto a prueba en este tipo de colaboración?",
    "opciones": [
      "La Diligencia, al asegurar que el proyecto se desarrolle en los plazos más cortos posibles dada la sensibilidad de la información.",
      "El Respeto, al asegurar que las diferentes perspectivas de las Direcciones sean consideradas equitativamente en el diseño del sistema predictivo.",
      "La Justicia, al garantizar que el sistema predictivo opere sin sesgos, identificando transacciones sospechosas con imparcialidad, y la Integridad, al manejar la información sensible con la máxima confidencialidad y probidad."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La creación de un sistema predictivo para detectar lavado de activos y contrabando exige la máxima Justicia (imparcialidad en la detección) y la máxima Integridad (manejo ético y confidencial de datos sensibles). El sesgo en el algoritmo o la fuga de información minarían la misionalidad de la DIAN de proteger el orden público económico y la seguridad fiscal."
  },
  {
    "id": "dom129",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "La Dirección General de la DIAN ha identificado una necesidad urgente de capacitar a todos los nuevos inspectores aduaneros en el uso de herramientas tecnológicas avanzadas para la detección de mercancías ilícitas. ¿Qué combinación de Direcciones de Apoyo debería coordinar este plan de capacitación para asegurar su efectividad?",
    "opciones": [
      "Dirección de Gestión Jurídica y Oficina de Control Interno, para asegurar que la capacitación cumpla con la normativa y los controles internos.",
      "Dirección de Gestión de Talento Humano y Dirección de Gestión de Tecnología y Telecomunicaciones, para la planificación pedagógica y el soporte técnico de las herramientas.",
      "Dirección de Gestión de Planeación y Proyectos y Dirección de Gestión de Recursos y Administración de Riesgos, para alinear la capacitación con los objetivos estratégicos y mitigar riesgos."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Dirección de Gestión de Talento Humano es la responsable de la formación y desarrollo del personal, mientras que la Dirección de Gestión de Tecnología y Telecomunicaciones provee las herramientas y el conocimiento técnico. Su coordinación es esencial para una capacitación efectiva en herramientas tecnológicas avanzadas para los inspectores aduaneros."
  },
  {
    "id": "dom130",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un Gestor II, en su rol de monitoreo de bases de datos, identifica que un servidor de alto nivel de la Dirección de Gestión de Impuestos está accediendo a información tributaria de contribuyentes que no está directamente relacionada con sus funciones asignadas, aunque tiene permisos para ello. ¿Cuál es la acción más adecuada que el Gestor II debe tomar, priorizando la integridad y el buen gobierno?",
    "opciones": [
      "Asumir que el servidor tiene una razón válida para el acceso, dado su nivel y permisos, y no tomar ninguna acción inmediata.",
      "Documentar el patrón de acceso anómalo y reportarlo a la Oficina de Control Interno y a la Dirección de Gestión de Talento Humano para una investigación sobre el uso de la información.",
      "Bloquear inmediatamente el acceso del servidor a la base de datos para prevenir cualquier uso indebido de la información, y luego notificar a su jefe inmediato."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Aunque el servidor tenga permisos, el acceso a información sensible sin relación directa con funciones asignadas es una alerta de posible uso indebido. Reportarlo a Control Interno (para la investigación de la conducta) y Talento Humano (para temas de gestión de personal y cumplimiento de deberes) es la vía correcta para abordar el problema de manera institucional y proteger la integridad de los datos, sin exceder las propias competencias de bloqueo directo sin autorización."
  },
  {
    "id": "dom131",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "La DIAN está promoviendo una iniciativa para simplificar los procedimientos de registro para pequeños comerciantes en zonas rurales, con el fin de fomentar la formalización y ampliar la base tributaria. ¿Qué pilar de la misionalidad de la DIAN se está fortaleciendo principalmente con esta iniciativa, y cómo se relaciona con el Servicio al Ciudadano?",
    "opciones": [
      "Gestión y Control Aduanero, al asegurar que los pequeños comerciantes cumplan con las normativas para importar sus productos.",
      "Administración y Recaudo de Impuestos Nacionales, y el Servicio al Ciudadano, al facilitar el cumplimiento de las obligaciones tributarias y ampliar la cobertura fiscal de manera incluyente.",
      "Control Cambiario, al monitorear las transacciones de divisas de los pequeños comerciantes para evitar el lavado de activos."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La simplificación de procedimientos para pequeños comerciantes para fomentar la formalización se enmarca directamente en la Administración y Recaudo de Impuestos Nacionales, ya que busca ampliar la base tributaria. Al mismo tiempo, es una manifestación clara del Servicio al Ciudadano, al hacer el cumplimiento de las obligaciones más accesible e incluyente, contribuyendo a la cultura de la legalidad fiscal."
  },
  {
    "id": "dom132",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un Gestor II se encuentra desarrollando un proyecto piloto para la implementación de blockchain en la trazabilidad de ciertas mercancías importadas de alto riesgo de contrabando. El éxito de este piloto podría transformar la gestión aduanera. ¿Qué característica principal de la visión de la DIAN se busca materializar con este tipo de proyecto innovador?",
    "opciones": [
      "Ser una administración tributaria y aduanera que prioriza la estabilidad de sus procesos tradicionales para garantizar la seguridad fiscal.",
      "Ser una administración tributaria y aduanera que busca ser reconocida por su excelencia en el recaudo, manteniendo la rigurosidad en la fiscalización.",
      "Ser una administración tributaria y aduanera moderna, eficiente, transparente, y sustentada en el talento humano y el uso intensivo de la tecnología, con capacidad de innovación."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La implementación de tecnologías disruptivas como blockchain para mejorar la trazabilidad y combatir el contrabando es un claro ejemplo de la materialización de la visión de la DIAN de ser una entidad moderna, eficiente, transparente y, crucialmente, 'sustentada en el talento humano y el uso intensivo de la tecnología', lo que implica una fuerte apuesta por la innovación en sus procesos."
  },
  {
    "id": "dom133",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Se ha detectado una tendencia de litigiosidad creciente contra la DIAN por parte de contribuyentes que alegan errores en la liquidación de impuestos generados automáticamente por el sistema. La Dirección de Gestión Jurídica solicita al Gestor II un análisis de la causa raíz de estos errores. ¿Qué valor institucional de la DIAN es más imperativo para el Gestor II al realizar este análisis?",
    "opciones": [
      "La Diligencia, al entregar el análisis en el menor tiempo posible para evitar la acumulación de litigios.",
      "La Honestidad, al identificar y presentar la causa raíz real de los errores del sistema, sin ocultar fallas internas que puedan generar responsabilidades.",
      "El Compromiso, al demostrar su lealtad a la entidad al buscar soluciones que no afecten la imagen pública de la DIAN en los litigios."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Identificar la causa raíz de errores que generan litigiosidad y afectan a los contribuyentes exige un compromiso inquebrantable con la Honestidad. El Gestor II debe presentar los hallazgos de manera veraz y transparente, incluso si revelan fallas internas, para permitir una corrección efectiva y upholding la integridad de la DIAN y la Justicia en sus procesos."
  },
  {
    "id": "dom134",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "La Dirección General de la DIAN está considerando una importante inversión en infraestructura tecnológica para soportar el crecimiento exponencial del volumen de datos transaccionales. Esta decisión estratégica busca optimizar los procesos misionales a largo plazo. ¿Qué Dirección de Apoyo es la más adecuada para realizar el estudio de viabilidad técnica y proponer la arquitectura de esta inversión?",
    "opciones": [
      "La Dirección de Gestión de Planeación y Proyectos, por su rol en la formulación de planes estratégicos de inversión.",
      "La Dirección de Gestión de Recursos y Administración de Riesgos, por ser la encargada de evaluar la sostenibilidad financiera de grandes inversiones.",
      "La Dirección de Gestión de Tecnología y Telecomunicaciones, por su competencia en el diseño, implementación y mantenimiento de la infraestructura tecnológica."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La Dirección de Gestión de Tecnología y Telecomunicaciones (o su equivalente) es la experta en el diseño, implementación y mantenimiento de la infraestructura tecnológica y los sistemas de información. Por lo tanto, es la dependencia más adecuada para realizar el estudio de viabilidad técnica y proponer la arquitectura de una inversión de esta magnitud, que impacta directamente en el soporte de los datos y procesos misionales de la DIAN."
  },
  {
    "id": "dom135",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un Gestor II, en su rol de apoyo a la Dirección de Gestión de Cobranzas, detecta que un algoritmo de segmentación de deudores, diseñado para priorizar acciones de cobro, está generando sesgos que afectan desproporcionadamente a pequeños contribuyentes en ciertas regiones. ¿Qué valor institucional de la DIAN es fundamental que el Gestor II defienda al reportar y buscar corregir esta situación?",
    "opciones": [
      "La Diligencia, al asegurar que el algoritmo funcione con la máxima eficiencia para recuperar la cartera de la DIAN.",
      "La Honestidad, al ser transparente sobre los fallos del algoritmo y el posible impacto negativo en la imagen de la DIAN.",
      "La Justicia, al garantizar que los procesos de cobro sean equitativos e imparciales para todos los contribuyentes, sin discriminación geográfica o de tamaño."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "Un algoritmo que genera sesgos en la segmentación de deudores y afecta desproporcionadamente a pequeños contribuyentes viola el valor de la Justicia, que exige obrar con equidad e imparcialidad. El Gestor II debe defender este valor al reportar y buscar corregir la situación, asegurando que los procesos de cobro de la DIAN sean justos y no discriminatorios, en línea con su misionalidad de servicio al ciudadano."
  },
  {
    "id": "dom136",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "La Dirección General ha solicitado un análisis predictivo sobre las futuras tendencias de recaudo de impuestos nacionales, considerando factores macroeconómicos y sectoriales. Este análisis es clave para la formulación del presupuesto de la nación. Como Gestor II, ¿qué Dirección de Gestión debería ser el principal 'cliente interno' o usuario de su análisis, y por qué?",
    "opciones": [
      "La Dirección de Gestión de Aduanas, porque las tendencias de importación y exportación impactan directamente el recaudo tributario.",
      "La Dirección de Gestión de Impuestos, porque es la responsable de la administración y recaudo de los tributos nacionales y requiere esta proyección para su gestión.",
      "La Dirección de Gestión de Planeación y Proyectos, por su rol en la articulación de la información para la planificación estratégica y la formulación del presupuesto."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "Si bien la Dirección de Impuestos es la encargada del recaudo, la Dirección de Gestión de Planeación y Proyectos es la responsable de la formulación del plan estratégico y el seguimiento a la gestión institucional, lo que incluye la articulación de información para la formulación del presupuesto nacional. Por lo tanto, sería el principal cliente interno de un análisis predictivo de recaudo que impacta directamente en la planificación estratégica del Estado."
  },
  {
    "id": "dom137",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un Gestor II, participando en un grupo de trabajo interinstitucional con la Unidad de Información y Análisis Financiero (UIAF), debe compartir datos anonimizados sobre transacciones financieras sospechosas relacionadas con comercio exterior. Se presenta un conflicto entre la urgencia de la UIAF y los protocolos de seguridad de la información de la DIAN. ¿Qué valor institucional debe guiar la acción del Gestor II en este escenario complejo?",
    "opciones": [
      "La Diligencia, priorizando la entrega rápida de la información anonimizada a la UIAF para no retrasar la investigación de lavado de activos.",
      "La Honestidad / Integridad, asegurando que la información se comparta solo bajo los protocolos de seguridad y confidencialidad establecidos, incluso si genera un ligero retraso, para proteger los datos y la legalidad del proceso.",
      "El Compromiso, demostrando la máxima colaboración con la UIAF para fortalecer la lucha contra el crimen organizado, flexibilizando los protocolos si es necesario."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La colaboración interinstitucional es vital, pero la entrega de información sensible, incluso anonimizada, debe adherirse estrictamente a los protocolos de seguridad y confidencialidad. La Honestidad y la Integridad implican actuar con probidad y transparencia, protegiendo los datos que la DIAN custodia. Priorizar la rapidez sobre la seguridad podría comprometer la integridad de la información y la confianza, afectando gravemente la misionalidad de la DIAN a largo plazo."
  },
  {
    "id": "dom138",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Se ha identificado que una resolución de la Dirección General sobre nuevas tarifas aduaneras no fue comunicada eficazmente a los importadores a través de los canales digitales, generando confusiones y errores en las declaraciones. ¿Qué Dirección de Apoyo falló en su rol de difusión y debería liderar la estrategia de comunicación correctiva?",
    "opciones": [
      "La Dirección de Gestión Jurídica, por ser la encargada de la validez de las resoluciones y su divulgación oficial.",
      "La Oficina de Comunicaciones, por su función de gestionar la comunicación externa de la entidad y las campañas informativas.",
      "La Dirección de Gestión de Tecnología y Telecomunicaciones, por ser la responsable de los canales digitales de la DIAN."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Aunque la Dirección de Tecnología y Telecomunicaciones es responsable de los canales digitales, la Oficina de Comunicaciones es la encargada de la gestión de la comunicación externa, lo que incluye el diseño de estrategias de difusión y pedagogía. Una falla en la comunicación eficaz de una resolución recae en su ámbito, y por lo tanto, debería liderar la estrategia correctiva."
  },
  {
    "id": "dom139",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un Gestor II en el Subproceso de Procesamiento de Datos identifica que un informe crucial sobre tendencias de comercio exterior, solicitado por la Dirección General y utilizado para proyecciones económicas nacionales, contiene datos erróneos debido a una falla en la extracción de información de una fuente externa. El plazo para la entrega es inminente. ¿Cuál es la acción más ética y responsable para el Gestor II?",
    "opciones": [
      "Entregar el informe en el plazo establecido, haciendo una salvedad menor sobre la posible inexactitud de los datos en una nota a pie de página, priorizando el cumplimiento del tiempo.",
      "Intentar corregir la extracción de datos de manera apresurada, sin notificar la falla, para entregar un informe aparentemente correcto y evitar un retraso que pueda ser percibido como ineficiencia.",
      "Reportar inmediatamente la falla en la extracción a su jefe inmediato y a la Dirección General, explicando la criticidad de los datos erróneos para las proyecciones, y proponer una estrategia para corregir y entregar la información precisa, aunque sea con un ligero retraso."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La Honestidad y la Integridad son primordiales. Un informe con datos erróneos utilizado para proyecciones económicas nacionales tiene un impacto crítico. El Gestor II debe reportar la falla de inmediato para evitar que se tomen decisiones basadas en información incorrecta, aunque esto implique un retraso. La transparencia sobre el error y la propuesta de solución son la acción más ética y responsable, en línea con la misionalidad de seguridad fiscal."
  },
  {
    "id": "dom140",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "La Dirección General de la DIAN está implementando un nuevo modelo de gestión por competencias que afectará la evaluación del desempeño de todos los servidores. La Dirección de Gestión de Talento Humano lidera este proceso. ¿Qué valor institucional de la DIAN se busca reforzar al aplicar un modelo de evaluación por competencias que sea justo y transparente para todos los empleados?",
    "opciones": [
      "La Diligencia, al asegurar que el modelo sea implementado rápidamente para cumplir con los plazos establecidos por la Dirección General.",
      "El Compromiso, al fomentar que los empleados se adapten a la nueva forma de evaluación de su desempeño laboral en la entidad.",
      "La Justicia, al garantizar que la evaluación del desempeño sea equitativa e imparcial, promoviendo la igualdad de oportunidades y el reconocimiento justo del mérito."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "Un modelo de evaluación por competencias que busca ser justo y transparente para todos los empleados refuerza directamente el valor de la Justicia. Este valor implica obrar con equidad e imparcialidad, garantizando la igualdad de derechos y oportunidades, lo cual es fundamental para el buen gobierno y la gestión del talento humano en una entidad pública."
  },
  {
    "id": "dom141",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un Gestor II es solicitado por la Dirección de Gestión de Recursos y Administración de Riesgos para desarrollar una herramienta analítica que identifique patrones de riesgo en las operaciones cambiarias para prevenir el lavado de activos. ¿Qué Dirección de Gestión de la DIAN, además de la solicitante, estaría más directamente interesada en los hallazgos de esta herramienta?",
    "opciones": [
      "La Dirección de Gestión de Aduanas, por su control sobre el flujo de mercancías transfronterizas y su relación con las divisas.",
      "La Dirección de Gestión de Fiscalización, por su competencia en el control cambiario en materia de importaciones y exportaciones y la lucha contra ilícitos financieros.",
      "La Dirección de Gestión de Impuestos, ya que las operaciones cambiarias pueden tener implicaciones en la base gravable de ciertos tributos."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Dirección de Gestión de Fiscalización es la directamente encargada del control cambiario en materia de importaciones y exportaciones y de la lucha contra el lavado de activos. Por lo tanto, una herramienta analítica que identifique patrones de riesgo en operaciones cambiarias para prevenir el lavado de activos sería de interés principal para esta Dirección, que ejerce la función de control y sanción."
  },
  {
    "id": "dom142",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "La Dirección General ha emitido un comunicado interno que detalla cambios significativos en los procedimientos de fiscalización de grandes contribuyentes, que implican el uso de nuevas metodologías analíticas. La comunicación es extensa y técnica. ¿Cuál es el valor institucional que la Oficina de Comunicaciones debe asegurar en la difusión de este comunicado a los funcionarios de fiscalización para garantizar su correcta aplicación?",
    "opciones": [
      "La Diligencia, al asegurar que el comunicado se entregue rápidamente a todos los funcionarios de fiscalización sin excepciones.",
      "El Respeto, al utilizar un lenguaje técnico que demuestre la rigurosidad de los nuevos procedimientos y la capacidad de la DIAN.",
      "El Compromiso, al garantizar que el mensaje sea claro, preciso y comprensible para todos los destinatarios, permitiendo una adaptación efectiva a los nuevos procedimientos."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "El Compromiso de la Oficina de Comunicaciones implica no solo la difusión, sino asegurar que el mensaje sea claro y comprensible. Dado que los cambios son significativos y técnicos, una comunicación efectiva (claridad, precisión) es esencial para que los funcionarios de fiscalización puedan aplicar correctamente las nuevas metodologías, lo que impacta directamente en la misionalidad de la DIAN."
  },
  {
    "id": "dom143",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un Gestor II detecta que un proveedor externo ha intentado acceder a una base de datos de la DIAN sin la autorización explícita y fuera de los horarios establecidos en su contrato, aunque no logró extraer información. ¿Cuál es la acción más prioritaria para el Gestor II, considerando los principios de seguridad fiscal y el Código de Integridad?",
    "opciones": [
      "Notificar al proveedor sobre la actividad anómala y recordarle los términos de su contrato, asumiendo que fue un error involuntario y sin malicia.",
      "Documentar la evidencia del intento de acceso, revocar de inmediato los permisos de acceso del proveedor si es posible, y reportar a la Dirección de Gestión de Tecnología y Telecomunicaciones, a la Dirección de Gestión Jurídica y a la Oficina de Control Interno para la investigación y posibles acciones legales y contractuales.",
      "Bloquear la dirección IP del proveedor en los sistemas de la DIAN para prevenir futuros intentos, y luego reportar solo a su jefe inmediato para evitar un proceso burocrático extenso."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Un intento de acceso no autorizado, incluso sin éxito, es una grave violación de seguridad y potencialmente un fraude que compromete la seguridad fiscal y la integridad de los datos. La acción prioritaria es documentar, revocar accesos (si aplica y está autorizado), y escalar a las Direcciones de Tecnología (seguridad), Jurídica (acciones legales/contractuales) y Control Interno (investigación de irregularidades), para una respuesta integral y proteger la misionalidad de la DIAN."
  },
  {
    "id": "dom144",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "La Dirección General ha encargado a un equipo especial, que incluye Gestores II, el diseño de un 'Centro de Excelencia en Análisis de Datos Fiscales y Aduaneros' para la DIAN, buscando centralizar y optimizar capacidades. ¿Qué elemento de la visión de la DIAN es el principal motor de esta iniciativa estratégica?",
    "opciones": [
      "La visión de ser una administración altamente burocrática, con procesos bien definidos y poca interacción externa.",
      "La visión de ser una administración tributaria, aduanera y cambiaria de clase mundial, moderna y sustentada en el uso intensivo de la tecnología y el talento humano para la generación de inteligencia fiscal.",
      "La visión de ser una administración que prioriza la recaudación de impuestos por encima de cualquier otro objetivo, utilizando todos los medios disponibles."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La creación de un Centro de Excelencia en Análisis de Datos es una manifestación clara de la visión de la DIAN de ser una administración 'de clase mundial, moderna y sustentada en el uso intensivo de la tecnología y el talento humano'. Este centro busca optimizar la generación de inteligencia fiscal, lo cual es esencial para el cumplimiento de su compleja misionalidad en un entorno globalizado."
  },
  {
    "id": "dom145",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un Gestor II es responsable del mantenimiento de un sistema de información utilizado por la Dirección de Gestión de Cobranzas. Un funcionario de esa Dirección le solicita omitir deliberadamente la actualización de ciertos registros de deudores, argumentando que son casos 'perdidos' y así mejorar las estadísticas de gestión. ¿Qué valor institucional de la DIAN sería el más gravemente comprometido al acceder a esta solicitud?",
    "opciones": [
      "La Diligencia, al no realizar la actualización completa de los registros en el sistema.",
      "El Compromiso, al no apoyar la estrategia de mejora de estadísticas de la Dirección de Gestión de Cobranzas.",
      "La Honestidad / Integridad, al manipular la información para alterar las estadísticas de gestión, comprometiendo la transparencia y veracidad de los datos, y afectando la función de recaudo."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "Omitir la actualización de registros para manipular estadísticas es una clara violación de la Honestidad y la Integridad. Esta acción compromete la veracidad de la información, esencial para la transparencia de la gestión pública y para que la DIAN cumpla su misionalidad de recaudo de manera efectiva. El Gestor II tiene la responsabilidad ética de asegurar la integridad de los datos."
  },
  {
    "id": "dom146",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "La DIAN ha identificado una tendencia global de incremento en la evasión fiscal a través de la economía digital. La Dirección General convoca a un equipo multidisciplinario, que incluye Gestores II, para proponer nuevas estrategias de fiscalización. ¿Qué propósito misional de la DIAN se está adaptando y fortaleciendo activamente para enfrentar este nuevo desafío?",
    "opciones": [
      "La Facilitación del Comercio Exterior, al buscar mecanismos digitales para agilizar las operaciones en el entorno virtual.",
      "La Administración y Recaudo de Impuestos Nacionales, a través de la adaptación de estrategias de fiscalización para combatir la evasión en la economía digital y asegurar los recursos públicos.",
      "El Control Cambiario, al monitorear los flujos de divisas generados por transacciones digitales y combatir el lavado de activos."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La evasión fiscal en la economía digital es un desafío directo a la Administración y Recaudo de Impuestos Nacionales. La creación de nuevas estrategias de fiscalización busca adaptar y fortalecer esta misionalidad para asegurar que el Estado siga obteniendo los recursos necesarios, incluso en un entorno económico cambiante y tecnológico."
  },
  {
    "id": "dom147",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un Gestor II, analizando datos de comercio exterior, identifica un patrón atípico de importaciones de ciertos bienes que sugieren una posible subfacturación masiva para evadir aranceles. La magnitud de la potencial evasión es significativa. ¿A qué Dirección de Gestión debería escalar esta información priorizando la misionalidad de la DIAN, y por qué?",
    "opciones": [
      "A la Dirección de Gestión de Impuestos, ya que la subfacturación también puede afectar el IVA de importación.",
      "A la Dirección de Gestión de Fiscalización y a la Dirección de Gestión de Aduanas, porque se trata de un posible fraude aduanero y evasión de tributos aduaneros, que requiere investigación y control específico.",
      "A la Dirección de Gestión Jurídica, para que evalúe la viabilidad de iniciar un proceso legal preventivo."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La subfacturación para evadir aranceles es un claro fraude aduanero. La Dirección de Gestión de Aduanas es la principal responsable del control aduanero y arancelario, y la Dirección de Gestión de Fiscalización es la encargada de investigar y sancionar ilícitos fiscales y aduaneros. La coordinación entre ambas es crucial para abordar la misionalidad de seguridad fiscal y protección del orden público económico."
  },
  {
    "id": "dom148",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "En una reunión de la Dirección General, se discute la necesidad de fortalecer la imagen de la DIAN como una entidad cercana y transparente al ciudadano, combatiendo la percepción de 'burocracia'. ¿Qué Dirección de Apoyo sería la más adecuada para diseñar e implementar una estrategia de comunicación que aborde directamente esta percepción?",
    "opciones": [
      "La Dirección de Gestión de Planeación y Proyectos, por su rol en la formulación de estrategias y seguimiento de indicadores de percepción.",
      "La Dirección de Gestión de Talento Humano, al ser la encargada de capacitar a los funcionarios en el servicio al ciudadano y en la comunicación efectiva.",
      "La Oficina de Comunicaciones, por su experticia en la gestión de la imagen institucional, la relación con los medios y el diseño de campañas de sensibilización ciudadana."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La Oficina de Comunicaciones es la dependencia especializada en la gestión de la imagen institucional, la relación con los medios y el diseño de campañas de sensibilización. Su rol es fundamental para cambiar percepciones ciudadanas y fortalecer la imagen de transparencia y cercanía de la DIAN, alineándose con la misionalidad de servicio al ciudadano."
  },
  {
    "id": "dom149",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Como Gestor II, usted es consciente de la política de cero tolerancia a la corrupción en la DIAN. Un compañero de otra área, en un entorno informal, le insinúa que 'ciertos favores' pueden agilizar trámites. ¿Qué valor institucional de la DIAN es más imperativo para usted en esta situación, y cuál debería ser su acción inmediata?",
    "opciones": [
      "La Diligencia, al agilizar el proceso de reporte de la situación a las autoridades competentes para no retrasar la investigación.",
      "La Honestidad / Integridad, al rechazar la insinuación de manera clara y directa, y reportar la situación a la Oficina de Control Interno, priorizando la probidad y la lucha contra la corrupción.",
      "El Respeto, al escuchar la insinuación pero evitar confrontaciones directas con el compañero, para no afectar el ambiente laboral, y luego considerar la posibilidad de reportar la situación de forma anónima."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La política de cero tolerancia a la corrupción y el Código de Integridad exigen una respuesta inmediata y contundente ante insinuaciones de favores ilegales. La Honestidad y la Integridad demandan rechazar la acción y reportarla a la Oficina de Control Interno, que es la dependencia encargada de investigar y sancionar estas conductas, garantizando la probidad en la DIAN."
  },
  {
    "id": "dom150",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "La Dirección General ha expresado la necesidad de optimizar los recursos humanos en áreas de apoyo, evaluando la carga laboral y las necesidades de personal. ¿Qué Dirección de Apoyo es la más adecuada para realizar un estudio de plantas de personal y proponer ajustes organizacionales estratégicos?",
    "opciones": [
      "La Dirección de Gestión de Planeación y Proyectos, por su experiencia en el diseño de proyectos de reestructuración y optimización de recursos.",
      "La Dirección de Gestión de Talento Humano, por ser la responsable de la administración de personal, la gestión del desempeño y el diseño organizacional de la planta de personal.",
      "La Oficina de Control Interno, por su función de auditar la eficiencia de los procesos y el uso adecuado de los recursos humanos."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Dirección de Gestión de Talento Humano (o Gestión Humana) es la dependencia experta en la administración de personal, que incluye estudios de plantas de personal, cargas laborales, y el diseño organizacional en lo referente al recurso humano. Por lo tanto, es la más adecuada para proponer ajustes organizacionales estratégicos relacionados con el personal de la DIAN."
  },
  {
    "id": "dom151",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un Gestor II se encuentra trabajando en un proyecto de mejora de la calidad de datos de los contribuyentes. Durante una verificación de rutina, descubre que una gran cantidad de registros presentan inconsistencias graves debido a un software de captura de datos obsoleto. Esto afecta la capacidad de fiscalización. ¿Qué valor institucional debe orientar al Gestor II en la búsqueda de la solución a esta situación?",
    "opciones": [
      "La Honestidad, al documentar la falla del software obsoleto y ser transparente sobre su impacto negativo en la fiscalización.",
      "La Diligencia, al actuar con prontitud para reportar y buscar la actualización o reemplazo del software obsoleto, asegurando la calidad de los datos y la efectividad de la fiscalización.",
      "El Compromiso, al asumir la responsabilidad de encontrar una solución temporal mientras se gestiona el reemplazo del software obsoleto."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Diligencia implica actuar con prontitud, eficiencia y cuidado. Un software obsoleto que genera inconsistencias graves en los datos y afecta la fiscalización exige una acción diligente para corregir la situación. El Gestor II debe priorizar la efectividad de la función fiscalizadora de la DIAN, buscando una solución rápida para mejorar la calidad de los datos."
  },
  {
    "id": "dom152",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "La Dirección General ha establecido un nuevo indicador de gestión para medir el impacto de la facilitación del comercio exterior, más allá de los tiempos de despacho aduanero. El Gestor II debe diseñar el modelo de recolección y análisis de datos para este nuevo indicador. ¿Qué pilar de la misionalidad de la DIAN se está sofisticando con esta iniciativa?",
    "opciones": [
      "La Administración y Recaudo de Impuestos Nacionales, al buscar datos más precisos sobre el movimiento económico que genera el comercio exterior.",
      "La Gestión y Control Aduanero, particularmente la Facilitación del Comercio Exterior, al ir más allá de los indicadores básicos de tiempo y buscar una métrica de impacto más holística.",
      "El Control Cambiario, al incluir variables económicas más complejas para medir los efectos del comercio en la balanza de pagos."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Medir el impacto de la facilitación del comercio exterior más allá de los tiempos de despacho implica sofisticar el pilar de Gestión y Control Aduanero, específicamente la función de Facilitación del Comercio Exterior. La DIAN busca no solo agilizar, sino también medir el impacto real de estas facilidades, lo que se alinea con una visión de mejora continua y eficiencia."
  },
  {
    "id": "dom153",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un Gestor II, en colaboración con la Dirección de Gestión Jurídica, está desarrollando un sistema de información para el seguimiento de procesos judiciales en los que la DIAN es parte. El sistema requiere acceso a expedientes con información muy sensible. ¿Qué valor institucional es el más crítico para el Gestor II al asegurar la seguridad y privacidad de estos datos?",
    "opciones": [
      "El Compromiso, al dedicar el máximo esfuerzo para desarrollar un sistema seguro que proteja la información judicial.",
      "La Honestidad / Integridad, al garantizar la confidencialidad, la privacidad y el uso ético de la información sensible de los procesos judiciales, evitando cualquier fuga o acceso no autorizado.",
      "La Diligencia, al implementar el sistema de seguimiento judicial en el menor tiempo posible para agilizar los procesos legales."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El manejo de expedientes judiciales con información sensible exige la máxima Honestidad e Integridad. Estos valores se traducen en garantizar la confidencialidad, privacidad y el uso ético de los datos, previniendo cualquier fuga o acceso no autorizado. Proteger esta información es crucial para la seguridad jurídica de la DIAN y para mantener la confianza ciudadana, siendo un pilar fundamental del buen gobierno."
  },
  {
    "id": "dom154",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "La Dirección General de la DIAN ha identificado la necesidad de fortalecer la gestión del riesgo de corrupción dentro de la entidad, más allá de los controles internos operativos. ¿Qué Dirección de Apoyo sería la más adecuada para diseñar e implementar un nuevo programa de ética y prevención de la corrupción a nivel institucional, con un enfoque integral?",
    "opciones": [
      "La Oficina de Control Interno, por ser la que audita el cumplimiento de las normas y procesos internos y externos.",
      "La Dirección de Gestión Jurídica, por su conocimiento de la normativa anticorrupción y la imposición de sanciones.",
      "La Dirección de Gestión de Talento Humano, en colaboración con la Oficina de Control Interno, por su rol en la formación de valores, la gestión de la cultura organizacional y la administración del personal."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "Un programa integral de ética y prevención de la corrupción requiere la acción combinada. La Dirección de Gestión de Talento Humano es la responsable de la formación de valores y la cultura organizacional del personal, mientras que la Oficina de Control Interno supervisa el cumplimiento y la gestión del riesgo. Su colaboración asegura un enfoque integral y sistémico para fortalecer la integridad institucional, y por lo tanto, la misionalidad de la DIAN."
  },
  {
    "id": "dom155",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Como Gestor II, usted es consultado por la Dirección General sobre la viabilidad técnica de implementar una inteligencia artificial para predecir declaraciones tributarias fraudulentas. La preocupación es si esta IA podría generar 'falsos positivos' que afecten a contribuyentes honestos. ¿Qué valor institucional es el más crítico a defender al considerar esta implementación?",
    "opciones": [
      "La Eficiencia, al buscar la máxima capacidad predictiva de la IA para detectar fraude y optimizar el recaudo, incluso con un margen de error.",
      "La Justicia, al garantizar que la implementación de la IA sea equitativa e imparcial, minimizando los falsos positivos que podrían afectar injustamente a contribuyentes honestos.",
      "La Innovación, al priorizar la adopción de tecnologías de punta para la modernización de la DIAN, independientemente de los desafíos iniciales en la precisión."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La implementación de una IA para detectar fraude tributario debe estar guiada por el valor de la Justicia. Generar falsos positivos que afecten a contribuyentes honestos sería una manifestación de injusticia. El Gestor II debe defender la imparcialidad y equidad del sistema, asegurando que la tecnología contribuya a una fiscalización justa y al servicio al ciudadano, sin comprometer la confianza."
  },
  {
    "id": "dom156",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un Gestor II, en el ámbito de la Dirección de Gestión de Tecnología y Telecomunicaciones, se encuentra con la solicitud de un alto funcionario para 'acelerar' el desarrollo de un módulo de software, ignorando pasos críticos del control de calidad. El funcionario argumenta que es una orden directa de la Dirección General. ¿Cuál es la acción más profesional y alineada con la misionalidad de la DIAN?",
    "opciones": [
      "Priorizar la orden del alto funcionario y acelerar el desarrollo para evitar conflictos, confiando en que cualquier error se corregirá posteriormente.",
      "Notificar de inmediato a su jefe directo y a la Oficina de Control Interno sobre la solicitud de saltarse los controles de calidad, explicando los riesgos para la seguridad y la integridad del sistema, y buscando una resolución institucional.",
      "Ignorar discretamente la solicitud del alto funcionario y seguir los pasos de control de calidad, entregando el módulo una vez completados todos los procesos, sin informar sobre la presión recibida."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Saltarse los controles de calidad en el desarrollo de software crítico para la DIAN compromete la integridad y la seguridad de la información, valores fundamentales para la seguridad fiscal. La acción profesional y ética es reportar la situación a su jefe y a la Oficina de Control Interno. Esto protege tanto la integridad del sistema como la responsabilidad individual y organizacional, buscando una solución que respete los procedimientos y la misionalidad de la DIAN."
  },
  {
    "id": "dom157",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un Gestor II se entera de que un colega está ofreciendo sus servicios como consultor externo a empresas que son objeto de fiscalización por la DIAN, utilizando el conocimiento adquirido internamente. Esta conducta, aunque no esté explícitamente prohibida en un manual, genera un conflicto de interés claro. ¿Qué valor institucional de la DIAN es más gravemente vulnerado por esta conducta?",
    "opciones": [
      "La Diligencia, al desviar tiempo y esfuerzo del trabajo de la DIAN a actividades personales.",
      "El Respeto, al no considerar el impacto negativo de sus acciones en la percepción de los demás colegas.",
      "La Honestidad / Integridad, al existir un claro conflicto de interés que compromete la imparcialidad y la probidad en el servicio público, erosionando la confianza en la institución."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "Ofrecer consultoría a empresas fiscalizadas, utilizando conocimiento interno, genera un conflicto de interés que vulnera la Honestidad y la Integridad. Esta conducta compromete la imparcialidad y la probidad del servidor público, erosionando la confianza en la DIAN y su capacidad para cumplir su misión de manera justa y transparente. Es una forma de instrumentalizar el conocimiento público para beneficio privado."
  },
  {
    "id": "dom158",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "La Dirección General de la DIAN ha solicitado un estudio profundo sobre el impacto económico del contrabando de cigarrillos en el país, incluyendo la cuantificación de impuestos no recaudados. ¿Qué combinación de Direcciones de Gestión sería fundamental para que un Gestor II obtenga los datos más relevantes para este estudio?",
    "opciones": [
      "Dirección de Gestión de Impuestos (por los tributos no recaudados) y Dirección de Gestión Jurídica (por los casos judiciales de contrabando).",
      "Dirección de Gestión de Aduanas (por el control de mercancías) y Dirección de Gestión de Fiscalización (por la investigación de ilícitos y evasión).",
      "Dirección de Gestión de Cobranzas (por las deudas impagas) y Dirección de Gestión de Talento Humano (por la capacitación en la detección de contrabando)."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El contrabando afecta directamente las funciones de la Dirección de Gestión de Aduanas (control de entrada de mercancías) y la Dirección de Gestión de Fiscalización (investigación y sanción de ilícitos económicos y tributarios). Ambas Direcciones poseen los datos más relevantes para cuantificar el impacto y entender las dinámicas del contrabando de cigarrillos, esencial para la misionalidad de seguridad fiscal."
  },
  {
    "id": "dom159",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un Gestor II ha desarrollado un prototipo de sistema de recomendación para la Dirección de Gestión de Fiscalización, que sugiere qué contribuyentes son más propensos a la evasión. El prototipo muestra una alta efectividad, pero requiere acceso a categorías de datos muy sensibles y combinaciones que generan un perfilamiento profundo. ¿Qué valor institucional es prioritario al presentar este prototipo a los directivos?",
    "opciones": [
      "La Innovación, al demostrar la capacidad de la DIAN para aplicar tecnologías de vanguardia en la fiscalización, destacando la alta efectividad del sistema.",
      "La Diligencia, al asegurar que el prototipo esté listo para una implementación rápida y eficiente, maximizando su potencial de detección.",
      "La Justicia, al enfatizar los mecanismos para asegurar que el perfilamiento no genere sesgos indebidos, proteja la privacidad de los datos sensibles y respete el debido proceso de los contribuyentes, en línea con la imparcialidad de la DIAN."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "Aunque la efectividad es atractiva, un sistema de perfilamiento basado en datos sensibles, especialmente para fiscalización, exige la máxima consideración por la Justicia. El Gestor II debe priorizar cómo el sistema asegura imparcialidad y protege la privacidad, minimizando los riesgos de sesgos o afectaciones indebidas a contribuyentes honestos. Esto refuerza la misionalidad de la DIAN de actuar con equidad y transparencia, manteniendo la confianza ciudadana."
  },
  {
    "id": "dom160",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "La Dirección General de la DIAN ha decidido establecer un nuevo 'Comité de Ética y Transparencia Institucional' para fortalecer la cultura de probidad. Este comité estará conformado por representantes de diversas Direcciones. ¿Qué Dirección de Apoyo tendría un rol consultivo fundamental para el Gestor II que participa en este comité, en cuanto a la normativa y procedimientos relacionados con la conducta de los servidores públicos?",
    "opciones": [
      "La Dirección de Gestión de Talento Humano, por su responsabilidad en la formación de valores y la gestión del personal.",
      "La Dirección de Gestión Jurídica, por su experticia en la aplicación e interpretación de la normativa disciplinaria y el régimen de inhabilidades e incompatibilidades.",
      "La Oficina de Comunicaciones, por su capacidad de difundir los principios éticos y la importancia de la transparencia a toda la entidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Dirección de Gestión Jurídica es la autoridad en la aplicación e interpretación de la normativa legal, incluyendo el régimen disciplinario, inhabilidades e incompatibilidades. Su rol consultivo es fundamental para un Comité de Ética y Transparencia, ya que asegura que las decisiones y lineamientos del comité estén fundamentados en el marco legal vigente, fortaleciendo la probidad y la misionalidad de la DIAN."
  },
  {
    "id": "dom161",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un Gestor II es parte de un equipo que debe desarrollar un nuevo sistema de alerta temprana para la detección de operaciones de comercio exterior con alto riesgo de subfacturación. El sistema debe ser robusto y preciso, operando las 24 horas del día. ¿Qué Dirección de Gestión de la DIAN tiene el principal interés en la efectividad operativa de este sistema?",
    "opciones": [
      "La Dirección de Gestión de Impuestos, ya que la subfacturación afecta los impuestos nacionales de importación.",
      "La Dirección de Gestión de Cobranzas, porque si hay subfacturación, posteriormente habrá deudas tributarias o aduaneras a cobrar.",
      "La Dirección de Gestión de Aduanas, porque la subfacturación es una infracción aduanera que afecta directamente su misionalidad de control de mercancías y recaudo de aranceles."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La subfacturación es una infracción aduanera que busca evadir aranceles y otros tributos asociados a las importaciones. La Dirección de Gestión de Aduanas es la principal responsable del control aduanero y de la prevención del contrabando. Por lo tanto, el sistema de alerta temprana para subfacturación es de interés principal para esta Dirección en el cumplimiento de su misionalidad."
  },
  {
    "id": "dom162",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Como Gestor II, usted es asignado a un proyecto de transformación digital de los servicios al ciudadano en una oficina seccional de la DIAN. La iniciativa busca reducir los tiempos de espera y simplificar trámites. ¿Qué valor institucional de la DIAN se está materializando más fuertemente con este proyecto?",
    "opciones": [
      "La Honestidad, al transparentar los tiempos de espera actuales de los trámites.",
      "La Justicia, al garantizar que todos los ciudadanos reciban el mismo nivel de servicio, sin importar su ubicación geográfica.",
      "La Diligencia, al buscar la eficiencia y la eficacia en la prestación de los servicios, optimizando los procesos para una atención más ágil y efectiva al ciudadano."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "Reducir los tiempos de espera y simplificar trámites es una manifestación directa de la Diligencia. Este valor implica actuar con prontitud, eficiencia y eficacia en el cumplimiento de las funciones, optimizando el uso de los recursos. La transformación digital de los servicios busca una atención más ágil y efectiva, que se alinea con la misionalidad de servicio al ciudadano."
  },
  {
    "id": "dom163",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "La Dirección General de la DIAN ha decidido unificar la administración de los riesgos operacionales y estratégicos bajo una única área para una visión holística. ¿Qué Dirección de Apoyo sería la más adecuada para asumir esta responsabilidad de administración de riesgos integral?",
    "opciones": [
      "La Oficina de Control Interno, por su función de supervisar y evaluar los sistemas de control interno.",
      "La Dirección de Gestión de Planeación y Proyectos, por su rol en la formulación del plan estratégico y el seguimiento a la gestión.",
      "La Dirección de Gestión de Recursos y Administración de Riesgos, por ser la dependencia que combina la administración de recursos con la gestión de riesgos institucionales."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La unificación de la administración de riesgos operacionales y estratégicos bajo una única área es una función especializada. La Dirección de Gestión de Recursos y Administración de Riesgos (o su equivalente) es la dependencia que, por su propia naturaleza y nombre, está diseñada para combinar la administración de los recursos con la gestión integral de los riesgos institucionales, proporcionando una visión holística para la toma de decisiones."
  },
  {
    "id": "dom164",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un Gestor II es parte de un equipo que implementa una nueva herramienta de minería de datos para detectar inconsistencias en la información tributaria de empresas transnacionales. Los resultados preliminares muestran un alto potencial para identificar evasión de impuestos. ¿Qué pilar de la misionalidad de la DIAN se está fortaleciendo directamente con esta iniciativa de análisis avanzado?",
    "opciones": [
      "El Control Cambiario, al analizar las transacciones de divisas de empresas transnacionales.",
      "La Administración y Recaudo de Impuestos Nacionales, al mejorar la capacidad de fiscalización y detectar la evasión de impuestos por parte de empresas transnacionales.",
      "La Facilitación del Comercio Exterior, al agilizar el procesamiento de datos de las empresas transnacionales para sus operaciones de importación/exportación."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Una herramienta de minería de datos que detecta inconsistencias en la información tributaria de empresas transnacionales y ayuda a identificar evasión de impuestos fortalece directamente la Administración y Recaudo de Impuestos Nacionales. Esta iniciativa mejora la capacidad de fiscalización de la DIAN, asegurando el cumplimiento de las obligaciones tributarias y la recolección de los recursos para el Estado."
  },
  {
    "id": "dom165",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "En una Oficina Seccional de la DIAN, un funcionario se niega a atender a un ciudadano que presenta una discapacidad física, argumentando que no hay personal disponible para asistirlo y que debería haber solicitado una cita especial. ¿Qué valor institucional de la DIAN está siendo claramente vulnerado por la actitud de este funcionario?",
    "opciones": [
      "La Diligencia, al no ser eficiente en la búsqueda de soluciones alternativas para la atención del ciudadano.",
      "La Honestidad, al no transparentar la falta de personal adecuado para la atención de personas con discapacidad.",
      "El Respeto, al no tratar con dignidad y consideración al ciudadano en situación de discapacidad, y no garantizar su derecho a la atención y el servicio."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "El Respeto es un valor fundamental que implica tratar con dignidad y consideración a todas las personas, incluyendo aquellas con discapacidad. Negarse a atender a un ciudadano en situación de discapacidad, sin buscar alternativas o asistencia, vulnera directamente este valor y el principio de servicio al ciudadano que rige la misionalidad de la DIAN."
  },
  {
    "id": "dom166",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Como Gestor II, usted es consultado por un compañero sobre un dato sensible de un contribuyente que necesita para una investigación personal. El compañero insiste en que el dato no es crítico para su función laboral. ¿Cuál es la acción más ética y alineada con los valores y la misionalidad de la DIAN?",
    "opciones": [
      "Negar el acceso al dato, explicando que la información de la DIAN es confidencial y solo puede ser accedida y utilizada para fines laborales autorizados, en línea con los principios de Integridad y Honestidad.",
      "Proporcionar el dato, bajo la advertencia de que solo debe usarse para fines personales y que no se debe divulgar para proteger la confidencialidad de la información.",
      "Remitir al compañero a la Oficina de Control Interno para que solicite formalmente el acceso al dato, evitando así una responsabilidad directa."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La información de la DIAN es altamente confidencial y solo debe ser accedida y utilizada para fines laborales autorizados. Acceder a un dato sensible para una investigación personal es una violación de la Integridad y Honestidad. El Gestor II debe negar el acceso y explicar el porqué, protegiendo la confidencialidad de la información y la probidad de la entidad."
  },
  {
    "id": "dom167",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "La Dirección General de la DIAN ha recibido un requerimiento de la Corte Suprema de Justicia para acceder a información tributaria detallada de una persona natural, en el marco de una investigación penal. ¿Qué Dirección de Apoyo es la principal responsable de gestionar este tipo de requerimientos judiciales y garantizar la entrega de la información bajo los protocolos legales?",
    "opciones": [
      "La Dirección de Gestión de Fiscalización, ya que la información es para una investigación penal.",
      "La Dirección de Gestión de Tecnología y Telecomunicaciones, por ser la que tiene la custodia de todas las bases de datos con información tributaria.",
      "La Dirección de Gestión Jurídica, por su competencia en la gestión de requerimientos judiciales y la representación legal de la entidad ante las autoridades."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La Dirección de Gestión Jurídica es la responsable de gestionar los requerimientos judiciales y la representación legal de la DIAN. Es esta Dirección la que asegura que la entrega de información tributaria a la Corte Suprema de Justicia se realice bajo los protocolos legales y con la debida autorización, protegiendo así la integridad de la DIAN y el cumplimiento de la ley."
  },
  {
    "id": "dom168",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Como Gestor II, usted está en un proyecto que busca implementar un sistema de inteligencia de negocios (BI) para la Dirección de Gestión de Cobranzas, con el objetivo de identificar patrones de comportamiento de los deudores más propensos a la mora. ¿Qué pilar de la misionalidad de la DIAN se está fortaleciendo directamente con esta herramienta avanzada?",
    "opciones": [
      "La Gestión y Control Aduanero, al permitir una mejor identificación de deudas relacionadas con operaciones de comercio exterior.",
      "La Administración y Recaudo de Impuestos Nacionales, al optimizar la gestión de cobro de deudas tributarias y aduaneras, y mejorar la efectividad del recaudo.",
      "El Control Cambiario, al predecir la mora en deudas relacionadas con operaciones de divisas de los contribuyentes."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Un sistema de inteligencia de negocios para identificar patrones de mora y optimizar la gestión de cobro fortalece directamente la Administración y Recaudo de Impuestos Nacionales (y aduaneros). Su propósito es mejorar la eficiencia en la recuperación de deudas, lo cual es fundamental para asegurar los recursos financieros del Estado, que es un pilar de la misionalidad de la DIAN."
  },
  {
    "id": "dom169",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "La Dirección General de la DIAN ha recibido críticas públicas sobre la lentitud de respuesta a derechos de petición complejos. Se ha propuesto una iniciativa para mejorar los tiempos de respuesta. ¿Qué valor institucional de la DIAN es el más críticamente evaluado por la ciudadanía en esta situación y debe ser el foco de la mejora?",
    "opciones": [
      "La Honestidad, al ser transparente sobre los retrasos en la respuesta a los derechos de petición presentados por los ciudadanos.",
      "El Compromiso, al demostrar la dedicación de la entidad para responder a todos los derechos de petición sin excepción.",
      "La Diligencia, al asegurar que los derechos de petición se tramiten con prontitud, eficiencia y eficacia, cumpliendo los plazos legales y mejorando el servicio al ciudadano."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La lentitud en la respuesta a derechos de petición es una falla en la Diligencia. Este valor implica actuar con prontitud y eficiencia en el cumplimiento de las funciones y en la optimización de los recursos. Mejorar los tiempos de respuesta es fundamental para cumplir con los plazos legales y para reforzar el compromiso de la DIAN con un servicio al ciudadano ágil y efectivo, que es parte de su misionalidad."
  },
  {
    "id": "dom170",
    "tema": "Estructura Organizacional y Misionalidad de la DIAN",
    "pregunta": "Un Gestor II es parte de un equipo que audita la calidad de los datos generados por una nueva plataforma para la presentación de declaraciones de importación. Descubren que la plataforma, aunque ágil, permite ciertos formatos de datos que no cumplen con los estándares de interoperabilidad con otros sistemas de la DIAN, comprometiendo la coherencia de la información. ¿Cuál es el valor institucional que se ve más directamente afectado por esta situación?",
    "opciones": [
      "La Eficiencia, al no permitir una rápida interoperabilidad entre los sistemas de la entidad.",
      "La Justicia, al crear posibles inconsistencias que podrían llevar a fiscalizaciones incorrectas si los datos no son coherentes.",
      "La Integridad / Honestidad, al comprometer la coherencia y fiabilidad de los datos, lo cual es fundamental para la seguridad y confianza en la información que gestiona la DIAN."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La falta de coherencia y el incumplimiento de estándares de interoperabilidad de los datos afectan directamente la Integridad y la Honestidad de la información. La veracidad y fiabilidad de los datos son cruciales para la seguridad fiscal del Estado y para que la DIAN pueda cumplir su misionalidad de control y recaudo de manera efectiva. El Gestor II debe priorizar la corrección de estos problemas de calidad de datos."
  },

  {
  "id": "dom171",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Como Gestor II, usted identifica que un algoritmo de riesgo fiscal está generando falsos positivos debido a inconsistencias en datos históricos. ¿Qué instancia debe coordinar la solución integral?",
  "opciones": [
    "El Comité Científico-Técnico de Modelos Predictivos de la Subdirección de Información.",
    "El Grupo de Calidad de Datos en conjunto con el área usuaria del modelo.",
    "La Oficina de Control Interno mediante auditoría especializada."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El Comité Científico-Técnico es el único facultado para resolver problemas complejos en modelos predictivos, según el Protocolo de Modelos Analíticos DIAN (v4.2)."
},

{
  "id": "dom172",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Al implementar un data lake para información tributaria, ¿qué instancia debe validar el cumplimiento del principio de 'datos como activo estratégico'?",
  "opciones": [
    "El Comité de Transformación Digital de la Dirección General.",
    "La Junta Directiva mediante concepto previo vinculante.",
    "El Comité de Gobierno de Datos con validación de Arquitectura Empresarial."
  ],
  "respuesta_correcta_index": 2,
  "explicacion": "El Comité de Gobierno de Datos, en coordinación con Arquitectura Empresarial, evalúa alineación con los principios de gestión de datos corporativos (Política de Datos DIAN 2024, Art. 12)."
},

{
  "id": "dom173",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Se requiere integrar datos de la DIAN con el sistema de contratación estatal (SECOP) para detectar irregularidades. ¿Qué protocolo aplicar?",
  "opciones": [
    "El Convenio Marco de Interoperabilidad con la AGETIC.",
    "El Acuerdo de Niveles de Servicio para intercambio de datos con MinHacienda.",
    "El Protocolo de Integración de Fuentes Externas del Comité de Seguridad."
  ],
  "respuesta_correcta_index": 2,
  "explicacion": "Integraciones con sistemas externos requieren validación expresa del Comité de Seguridad según el Estándar DIAN-ST-007 de interoperabilidad."
},

{
  "id": "dom174",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un modelo de machine learning para detección de contrabando requiere datos sensibles de comercio exterior. ¿Qué autorización es prioritaria?",
  "opciones": [
    "Aprobación del Comité de Ética del Ministerio de Tecnologías de la Información.",
    "Visto bueno del Comité Científico-Técnico y autorización del Comité de Seguridad DIAN.",
    "Concepto favorable de la Procuraduría Delegada para Vigilancia Fiscal."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "Modelos con datos sensibles requieren doble validación técnica (Comité Científico) y de seguridad, según el Art. 24 de la Política de IA DIAN 2024."
},

{
  "id": "dom175",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "¿Qué instancia debe resolver un conflicto de competencias entre la Subdirección de Gestión Tributaria y la de Gestión Aduanera sobre tratamiento de datos?",
  "opciones": [
    "El Comité de Gobernanza de Datos mediante resolución técnica.",
    "La Secretaría General de la DIAN mediante acto administrativo formal.",
    "La Dirección General previo concepto de la Oficina Jurídica."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El Comité de Gobernanza de Datos es el órgano técnico competente para dirimir conflictos sobre gestión de datos (Reglamento Operativo DIAN 2024, Cap. 8)."
},

{
  "id": "dom176",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Al diseñar una API para consulta de datos fiscales por entidades públicas, ¿qué normativa es determinante?",
  "opciones": [
    "El Estándar Técnico de Interoperabilidad DIAN-ETI-005.",
    "La Circular Conjunta 001 de 2023 MinTIC-DIAN.",
    "Los Lineamientos de Seguridad API del Esquema de Ordenamiento Territorial."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El Estándar DIAN-ETI-005 establece requisitos técnicos y de seguridad específicos para APIs de datos fiscales (Resolución 078 de 2023)."
},

{
  "id": "dom177",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Una sentencia judicial ordena eliminar datos históricos de contribuyentes. ¿Qué protocolo activar?",
  "opciones": [
    "El Procedimiento de Supresión Segura de Datos del Comité de Retención Documental.",
    "El Protocolo de Cumplimiento Judicial de la Oficina Jurídica con validación técnica.",
    "El Mecanismo de Bloqueo Condicionado del Sistema de Gestión Documental."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "Las órdenes judiciales requieren coordinación entre lo jurídico (validación) y lo técnico (implementación), según el Protocolo DIAN-JUD-004."
},

{
  "id": "dom178",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "¿Qué instancia debe evaluar el impacto regulatorio al implementar un sistema de trazabilidad fiscal con blockchain?",
  "opciones": [
    "El Comité de Innovación Tecnológica de la Subdirección de Información.",
    "La Mesa de Regulación Tributaria y Aduanera de la DIAN.",
    "El Grupo de Estudios Fiscales del Ministerio de Hacienda."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "La Mesa de Regulación es el órgano especializado en análisis de impactos normativos de nuevas tecnologías (Acuerdo DIAN 015 de 2024)."
},

{
  "id": "dom179",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un modelo predictivo sugiere patrones de evasión en sectores económicos específicos. ¿Qué instancia debe validar su uso para fiscalización?",
  "opciones": [
    "El Comité Científico-Técnico con aval de la Subdirección de Gestión Tributaria.",
    "La Oficina de Control Interno mediante auditoría de algoritmos.",
    "La Superintendencia de Industria y Comercio para evitar sesgos sectoriales."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Los modelos predictivos para fiscalización requieren validación técnica (Comité) y operativa (Subdirección competente), según Política DIAN-ML-002."
},

{
  "id": "dom180",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Al desarrollar un sistema de scoring fiscal, ¿qué marco normativo es prioritario para evitar sesgos algorítmicos?",
  "opciones": [
    "La Ley Estatutaria 1581 de 2012 sobre protección de datos personales.",
    "Los Lineamientos de IA Responsable del CONPES 3975 de 2023.",
    "El Estándar Internacional ISO/IEC 24027:2021 sobre sesgos en IA."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "El CONPES 3975 establece el marco nacional vinculante para desarrollo de sistemas de IA en entidades públicas colombianas."
},

{
  "id": "dom181",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "¿Qué instancia debe aprobar la destrucción de datos de operaciones aduaneras después de 10 años?",
  "opciones": [
    "El Comité de Evaluación Documental con concepto previo del Archivo General.",
    "La Subdirección de Gestión Aduanera mediante resolución motivada.",
    "El Comité de Gobierno de Datos basado en análisis de valor secundario."
  ],
  "respuesta_correcta_index": 2,
  "explicacion": "La destrucción de datos corporativos requiere evaluación del Comité de Gobierno de Datos sobre posibles usos futuros (Política de Ciclo de Vida DIAN, Art. 18)."
},

{
  "id": "dom182",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un fallo del Consejo de Estado ordena reestructurar procesos de fiscalización basados en datos. ¿Qué mecanismo aplicar?",
  "opciones": [
    "El Protocolo de Adecuación Normativa de la Oficina Jurídica.",
    "El Procedimiento de Gestión de Cambios Regulatorios del Comité de Gobernanza.",
    "El Mecanismo de Cumplimiento Judicial de la Secretaría General."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "Los cambios regulatorios complejos son coordinados por el Comité de Gobernanza mediante procedimiento específico (Manual DIAN-MGC-001)."
},

{
  "id": "dom183",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Al diseñar un sistema de alertas tempranas para evasión fiscal, ¿qué parámetro es prioritario según normativa DIAN?",
  "opciones": [
    "La tasa de falsos positivos no debe superar el 5% según estándar internacional.",
    "El umbral de confianza estadística debe ser ≥99% para activar fiscalización.",
    "Los indicadores de calidad deben cumplir el Estándar DIAN-DQ-004."
  ],
  "respuesta_correcta_index": 2,
  "explicacion": "El Estándar DIAN-DQ-004 establece requisitos mínimos de calidad para sistemas de análisis de riesgo fiscal (Resolución 089 de 2023)."
},

{
  "id": "dom184",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "¿Qué instancia debe validar la exposición de métricas fiscales en el Portal de Transparencia?",
  "opciones": [
    "El Comité de Open Data de la Subdirección de Información.",
    "La Mesa de Transparencia y Acceso a la Información Pública.",
    "El Grupo de Análisis de Riesgos de la Subdirección de Gestión Tributaria."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "La Mesa de Transparencia es el órgano interdisciplinario que evalúa riesgos en publicación de información fiscal (Protocolo DIAN-TR-007)."
},

{
  "id": "dom185",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un modelo de clustering identifica patrones anómalos en declaraciones de IVA. ¿Qué área debe interpretar técnicamente los resultados?",
  "opciones": [
    "El Centro de Excelencia Analítica de la Subdirección de Información.",
    "El Grupo de Inteligencia Fiscal de la Subdirección de Gestión Tributaria.",
    "El Comité Científico de la Dirección de Innovación y Desarrollo."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El Centro de Excelencia Analítica concentra los especialistas en interpretación de modelos avanzados (Directiva DIAN 2024-015)."
},

{
  "id": "dom186",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Al integrar datos tributarios con el sistema de salud para control de evasión, ¿qué acuerdo previo es indispensable?",
  "opciones": [
    "El Convenio Marco de Interoperabilidad Sectorial aprobado por MinTIC.",
    "El Acuerdo de Niveles de Servicio validado por ambas entidades.",
    "El Convenio de Transferencia de Datos autorizado por la SIC."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Los convenios marco sectoriales establecidos por MinTIC son el instrumento jurídico para este tipo de integraciones (Decreto 1008 de 2018)."
},

{
  "id": "dom187",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "¿Qué instancia debe auditar el cumplimiento de principios éticos en un sistema de scoring fiscal?",
  "opciones": [
    "El Comité de Ética de la Inteligencia Artificial de MinTIC.",
    "La Oficina de Control Interno mediante auditoría especializada.",
    "El Comité de Gobernanza de Datos con apoyo del área jurídica."
  ],
  "respuesta_correcta_index": 2,
  "explicacion": "El Comité de Gobernanza de Datos DIAN tiene mandato expreso para auditorías éticas de sistemas analíticos (Resolución 156 de 2024)."
},

{
  "id": "dom188",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un proyecto de analítica avanzada requiere datos de 10 años para entrenar modelos. ¿Qué autorización es prioritaria?",
  "opciones": [
    "Aprobación del Comité de Retención Documental por uso secundario de datos.",
    "Concepto previo de la Procuraduría General de la Nación.",
    "Autorización del Comité Científico-Técnico y Oficina de Protección de Datos."
  ],
  "respuesta_correcta_index": 2,
  "explicacion": "El uso de datos históricos para modelos requiere validación técnica (Comité) y legal (Protección de Datos), según Art. 33 Política DIAN-IA."
},

{
  "id": "dom189",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Al detectar que un modelo de riesgo está excluyendo sectores económicos específicos, ¿qué protocolo aplicar?",
  "opciones": [
    "El Procedimiento de Reentrenamiento de Modelos del Centro de Excelencia Analítica.",
    "El Protocolo de Mitigación de Sesgos Algorítmicos del Comité de IA.",
    "El Mecanismo de Ajuste Dinámico de la Subdirección de Gestión Tributaria."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "El Protocolo de Mitigación de Sesgos es el instrumento normativo específico para estos casos (Anexo Técnico 9 de Política DIAN-IA)."
},

{
  "id": "dom190",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "¿Qué instancia debe resolver un conflicto entre la Política de Datos Abiertos y la reserva estadística fiscal?",
  "opciones": [
    "El Comité de Transparencia de la Dirección General.",
    "La Mesa Técnica de Datos Abiertos del Departamento Administrativo de la Presidencia.",
    "El Comité de Gobierno de Datos mediante ponderación de principios."
  ],
  "respuesta_correcta_index": 2,
  "explicacion": "El Comité de Gobierno de Datos tiene competencia para ponderar principios contrapuestos en gestión de datos (Reglamento DIAN 2024, Art. 45)."
},

{
  "id": "dom191",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un sistema de recomendación para auditorías sugiere focalizar PYMEs. ¿Qué análisis previo es obligatorio?",
  "opciones": [
    "Evaluación de impacto regulatorio según metodología OCDE.",
    "Estudio de proporcionalidad según tamaño y sector económico.",
    "Validación estadística de poder predictivo por segmentos."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "El principio de proporcionalidad es fundamental en fiscalización según Circular DIAN 025 de 2023 sobre enfoque diferencial."
},

{
  "id": "dom192",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Al implementar técnicas de anonymización k para datos fiscales, ¿qué estándar aplicar?",
  "opciones": [
    "El Nivel de Protección 4 del Esquema Nacional de Seguridad.",
    "El Valor k≥11 según Guía de Anonimización de MinTIC 2024.",
    "El Umbral de Riesgo Residual ≤0.01% del Estándar DIAN-PRIV-003."
  ],
  "respuesta_correcta_index": 2,
  "explicacion": "El Estándar DIAN-PRIV-003 establece parámetros técnicos específicos para anonymización de datos fiscales (Resolución 134 de 2023)."
},

{
  "id": "dom193",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "¿Qué instancia debe validar la exportación de datos agregados para investigación académica?",
  "opciones": [
    "El Comité de Ética de Investigación de la Universidad receptora.",
    "El Comité de Transferencia de Conocimiento de la Subdirección de Información.",
    "El Grupo de Publicación de Datos del Comité de Gobierno de Datos."
  ],
  "respuesta_correcta_index": 2,
  "explicacion": "El Grupo de Publicación de Datos evalúa riesgos de reidentificación en datos agregados (Protocolo DIAN-PUB-004)."
},

{
  "id": "dom194",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un modelo de detección de evasión en comercio electrónico requiere datos en tiempo real. ¿Qué restricción aplicar?",
  "opciones": [
    "Limitación a transacciones ≥100 UVT según normativa de fiscalización.",
    "Validación en entorno controlado por 6 meses antes de producción.",
    "Cifrado homomórfico para procesamiento según Estándar DIAN-SEG-009."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "Los modelos con datos sensibles en tiempo real requieren periodo de prueba en sandbox (Política DIAN-ML-003, Art. 12)."
},

{
  "id": "dom195",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Al desarrollar un sistema de trazabilidad fiscal con IoT, ¿qué marco normativo es prioritario?",
  "opciones": [
    "El Reglamento UE 2022/868 sobre gobernanza de datos.",
    "La Ley 1978 de 2019 de Economía Digital colombiana.",
    "El CONPES 3980 de 2023 sobre adopción de tecnologías 4.0."
  ],
  "respuesta_correcta_index": 2,
  "explicacion": "El CONPES 3980 establece el marco nacional para implementación de IoT en entidades públicas colombianas."
},

{
  "id": "dom196",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "¿Qué instancia debe validar la destrucción segura de datos de un sistema obsoleto de fiscalización?",
  "opciones": [
    "El Comité de Seguridad de la Información con auditoría externa.",
    "La Oficina de Archivo General previa inspección física.",
    "El Comité de Gobierno de Datos mediante protocolo técnico-jurídico."
  ],
  "respuesta_correcta_index": 2,
  "explicacion": "La destrucción de datos corporativos requiere evaluación integral por el Comité de Gobierno de Datos (Protocolo DIAN-DES-005)."
},

{
  "id": "dom197",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un sistema de recomendación para fiscalización muestra sesgo regional. ¿Qué métrica técnica es prioritaria evaluar?",
  "opciones": [
    "El índice de Gini de distribución geográfica de auditorías.",
    "La tasa de falsos negativos por departamento.",
    "El valor p en prueba de chi-cuadrado por regiones."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El índice de Gini es la métrica estándar para evaluar equidad distribucional en sistemas fiscales (Guía DIAN-MET-007)."
},

{
  "id": "dom198",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Al migrar datos históricos a un nuevo sistema de gestión tributaria, ¿qué principio es prioritario?",
  "opciones": [
    "Integridad referencial según modelo entidad-relación original.",
    "No repudio mediante firma digital de registros migrados.",
    "Trazabilidad completa mediante metadatos de procedencia."
  ],
  "respuesta_correcta_index": 2,
  "explicacion": "La trazabilidad mediante metadatos es requisito fundamental en migraciones según Estándar DIAN-MIG-002."
},

{
  "id": "dom199",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "¿Qué instancia debe aprobar la publicación de microdatos anonimizados para investigación económica?",
  "opciones": [
    "El Comité de Open Data con validación de riesgo de reidentificación.",
    "La Subdirección de Gestión Tributaria mediante resolución motivada.",
    "El Departamento Administrativo Nacional de Estadística (DANE)."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El Comité de Open Data evalúa riesgos residuales de reidentificación en microdatos (Protocolo DIAN-MIC-001)."
},

{
  "id": "dom200",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un modelo de riesgo fiscal requiere datos de terceros países. ¿Qué mecanismo legal aplicar?",
  "opciones": [
    "Acuerdo de Transferencia Internacional bajo estándares APEC.",
    "Cláusulas Contractuales Tipo aprobadas por la SIC.",
    "Certificación de país con nivel adecuado de protección."
  ],
  "respuesta_correcta_index": 2,
  "explicacion": "Las transferencias internacionales requieren certificación de adecuación según Art. 26 de la Ley 1581 de 2012 y Reglamento DIAN-EXT-003."
},

{
  "id": "dom201",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un funcionario de la Dirección de Gestión de Ingresos plantea una consulta sobre el procedimiento para la fiscalización de grandes contribuyentes. ¿Qué dependencia debe encargarse de este proceso?",
  "opciones": [
    "La Dirección de Gestión de Grandes Contribuyentes, por su experiencia específica en la fiscalización de los mayores aportantes.",
    "La Dirección de Gestión de Fiscalización, debido a su función transversal en todos los contribuyentes.",
    "La Oficina de Planeación, que debe garantizar la estrategia organizacional del proceso."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Dirección de Gestión de Grandes Contribuyentes tiene la especialización y competencias para gestionar la fiscalización de los mayores contribuyentes del sistema tributario nacional."
},
{
  "id": "dom202",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un Gestor II debe diseñar un protocolo para la coordinación interinstitucional entre la DIAN y el Ministerio de Comercio. ¿Qué dirección debe liderar este proceso?",
  "opciones": [
    "La Dirección de Gestión de Aduanas, debido a la relevancia del comercio exterior en la coordinación.",
    "La Dirección General, por su responsabilidad en la supervisión de procesos interinstitucionales.",
    "La Dirección de Gestión de Ingresos, para asegurar que las políticas fiscales se alineen con las actividades comerciales."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Dirección de Gestión de Aduanas lidera la coordinación con el Ministerio de Comercio debido a su responsabilidad en el control y la gestión de las operaciones de comercio exterior."
},
{
  "id": "dom203",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "En un análisis de desempeño, se observan dificultades en la implementación de los lineamientos de gobierno de datos en una Dirección Seccional. ¿Cuál es el primer paso a seguir para resolver esta situación?",
  "opciones": [
    "Revisar y ajustar las políticas de gestión de datos en la Oficina de Planeación.",
    "Remitir el caso a la Dirección de Gestión de Tecnología y Telecomunicaciones para coordinar soluciones tecnológicas.",
    "Solicitar la intervención de la Dirección de Gestión Organizacional para reestructurar los procesos de datos."
  ],
  "respuesta_correcta_index": 1,
  "explicacion": "La Dirección de Gestión de Tecnología y Telecomunicaciones tiene la competencia de gestionar y optimizar las infraestructuras tecnológicas, esenciales para la implementación de los lineamientos de gobierno de datos."
},
{
  "id": "dom204",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Durante la revisión de un proyecto, un funcionario plantea que la Dirección de Gestión de Ingresos debería tener mayor autonomía en la implementación de políticas fiscales. ¿Qué principio organizacional debe prevalecer para asegurar coherencia y alineación?",
  "opciones": [
    "El principio de centralización normativa, que garantiza la coherencia entre todas las direcciones.",
    "El principio de descentralización operativa, que permite mayor autonomía a las direcciones seccionales.",
    "El principio de autonomía de cada dirección, que facilita decisiones rápidas a nivel local."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La DIAN opera bajo el principio de **centralización normativa**, asegurando que las políticas fiscales sean consistentes y alineadas en toda la entidad, independientemente del nivel operativo."
},
{
  "id": "dom205",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un miembro del equipo de la Dirección de Gestión de Ingresos plantea la necesidad de una nueva estrategia de control de evasión tributaria. ¿Qué área debería liderar el diseño de esta estrategia?",
  "opciones": [
    "La Dirección de Gestión de Fiscalización, que tiene competencias en la implementación de controles fiscales.",
    "La Dirección de Gestión Organizacional, por ser responsable de los procesos internos de la entidad.",
    "La Dirección Seccional de la DIAN, dada su cercanía con los contribuyentes locales."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Dirección de Gestión de Fiscalización tiene la competencia exclusiva para desarrollar e implementar estrategias de control, seguimiento y fiscalización sobre la evasión tributaria."
},
{
  "id": "dom206",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "En el marco de la implementación de nuevas tecnologías en la DIAN, un proyecto interinstitucional requiere la participación activa de varias áreas. ¿Cuál sería el primer paso para garantizar la coordinación efectiva?",
  "opciones": [
    "Convocar a un comité interinstitucional con la participación de todas las direcciones involucradas, bajo la supervisión de la Dirección General.",
    "Remitir el proyecto a la Dirección de Gestión de Tecnología y Telecomunicaciones para su ejecución.",
    "Iniciar la implementación del proyecto directamente desde la Oficina Jurídica para asegurar el cumplimiento legal."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Dirección General debe liderar los proyectos interinstitucionales, asegurando la alineación de las diferentes dependencias de la DIAN y la coordinación con otras entidades del gobierno."
},
{
  "id": "dom207",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un equipo de trabajo en la Dirección de Gestión de Aduanas ha identificado inconsistencias en la aplicación de los procesos aduaneros internacionales. ¿Qué debe hacer el Gestor II para abordar esta situación?",
  "opciones": [
    "Solicitar una revisión por parte de la Dirección General para estandarizar los procedimientos.",
    "Remitir el caso a la Dirección de Gestión de Fiscalización para determinar posibles infracciones.",
    "Coordinar con la Oficina Jurídica para una revisión normativa que permita ajustar los procesos."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Dirección General es responsable de la supervisión de todos los procesos dentro de la DIAN, por lo que debe coordinar la estandarización de procedimientos aduaneros internacionales."
},
{
  "id": "dom208",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un funcionario de la Dirección de Gestión de Ingresos plantea la necesidad de fortalecer la infraestructura tecnológica para optimizar los procesos de recaudación. ¿Cuál es el área que debe encargarse de esta solicitud?",
  "opciones": [
    "La Subdirección de Gestión de Tecnología y Telecomunicaciones, responsable de la infraestructura tecnológica.",
    "La Dirección de Gestión de Ingresos, encargada de la gestión de la recaudación tributaria.",
    "La Dirección General, que coordina los procesos de planificación estratégica."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Subdirección de Gestión de Tecnología y Telecomunicaciones tiene la competencia para gestionar las infraestructuras tecnológicas necesarias para la optimización de procesos institucionales."
},
{
  "id": "dom209",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un funcionario pregunta cuál es la dependencia responsable de gestionar las estrategias de cultura tributaria en la DIAN. ¿Qué debe responder el Gestor II?",
  "opciones": [
    "La Oficina de Comunicaciones Estratégicas, que lidera las campañas de sensibilización pública.",
    "La Dirección de Gestión de Ingresos, por su contacto constante con los contribuyentes.",
    "La Dirección de Gestión Organizacional, por su enfoque en el comportamiento organizacional."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Oficina de Comunicaciones Estratégicas es la responsable de diseñar e implementar estrategias de comunicación, incluyendo campañas de cultura tributaria."
},
{
  "id": "dom210",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un nuevo funcionario se pregunta quién debe supervisar el cumplimiento de los principios éticos dentro de la DIAN. ¿Qué dependencia debe coordinar este proceso?",
  "opciones": [
    "La Oficina de Control Interno, encargada de la evaluación y el seguimiento de la ética institucional.",
    "La Oficina Jurídica, responsable de las asesorías legales en temas éticos.",
    "La Dirección General, al ser la máxima autoridad en la entidad."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Oficina de Control Interno supervisa el cumplimiento de los principios éticos y el correcto funcionamiento de los sistemas de control interno, asegurando que se mantenga la integridad institucional."
},
{
  "id": "dom211",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "En el contexto de un proceso de optimización de datos, ¿qué dirección debe liderar el desarrollo de la arquitectura de datos en la DIAN?",
  "opciones": [
    "La Dirección de Gestión de Tecnología y Telecomunicaciones, responsable de la infraestructura tecnológica.",
    "La Dirección de Gestión de Ingresos, que utiliza los datos para gestionar la recaudación.",
    "La Dirección General, como coordinadora de todos los procesos institucionales."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Dirección de Gestión de Tecnología y Telecomunicaciones es la encargada de gestionar la arquitectura de datos y la infraestructura tecnológica necesaria para optimizar los procesos dentro de la DIAN."
},
{
  "id": "dom212",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "En la aplicación de un nuevo proceso digital, el Gestor II debe garantizar la implementación de los estándares técnicos. ¿Qué dependencia debe ser consultada para este proceso?",
  "opciones": [
    "La Dirección de Gestión de Tecnología y Telecomunicaciones, que maneja los estándares técnicos.",
    "La Dirección de Gestión de Aduanas, debido a su enfoque en el control digital aduanero.",
    "La Oficina de Comunicaciones Estratégicas, que gestiona las comunicaciones digitales."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Dirección de Gestión de Tecnología y Telecomunicaciones gestiona los estándares técnicos y las infraestructuras digitales necesarias para la implementación de nuevos procesos dentro de la DIAN."
},
{
  "id": "dom213",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "En un proceso de revisión y actualización de políticas fiscales, ¿qué dependencia debe liderar la revisión normativa en la DIAN?",
  "opciones": [
    "La Oficina Jurídica, por su responsabilidad en la interpretación y aplicación de las normativas fiscales.",
    "La Dirección de Gestión de Ingresos, encargada de la aplicación de políticas tributarias.",
    "La Dirección General, al ser responsable de las decisiones estratégicas en la entidad."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Oficina Jurídica es la dependencia encargada de revisar y proponer modificaciones a las políticas y normativas fiscales, asegurando que se cumpla con el marco legal vigente."
},
{
  "id": "dom214",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un equipo de la Dirección de Gestión de Ingresos necesita asesoramiento sobre la aplicación de nuevos tributos. ¿Qué dependencia debe ser consultada?",
  "opciones": [
    "La Oficina Jurídica, que asesora sobre la legalidad de los nuevos tributos.",
    "La Dirección de Gestión Organizacional, que evalúa el impacto organizacional de los tributos.",
    "La Dirección de Gestión de Aduanas, que regula los impuestos a nivel de comercio exterior."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Oficina Jurídica asesora sobre la legalidad de la implementación de nuevos tributos, evaluando su cumplimiento con la normatividad vigente."
},
{
  "id": "dom215",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "En un proceso de actualización de datos para fines fiscales, ¿qué dependencia debe liderar la creación y el mantenimiento del repositorio único de datos?",
  "opciones": [
    "La Dirección de Gestión de Tecnología y Telecomunicaciones, encargada de la gestión de repositorios de datos.",
    "La Dirección General, como autoridad máxima para supervisar el acceso a los datos fiscales.",
    "La Dirección de Gestión de Ingresos, que utiliza el repositorio para la gestión de contribuyentes."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Dirección de Gestión de Tecnología y Telecomunicaciones lidera la creación y gestión de repositorios de datos, asegurando su integridad y disponibilidad para la gestión fiscal."
},
{
  "id": "dom216",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Se presenta una situación de posible fraude en una operación aduanera. ¿Qué dependencia debe intervenir primero para investigar y solucionar este incidente?",
  "opciones": [
    "La Dirección de Gestión de Aduanas, como responsable de la fiscalización en el comercio exterior.",
    "La Dirección de Gestión de Ingresos, que supervisa los ingresos fiscales relacionados.",
    "La Oficina Jurídica, que evalúa las implicaciones legales del fraude."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Dirección de Gestión de Aduanas es la competente para manejar situaciones de fraude en las operaciones aduaneras, aplicando las normativas y procedimientos establecidos."
},
{
  "id": "dom217",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un funcionario de la Dirección de Gestión de Ingresos propone un cambio en la estrategia de fiscalización que involucra nuevas tecnologías. ¿Qué dependencia debe revisar esta propuesta antes de su implementación?",
  "opciones": [
    "La Dirección de Gestión de Tecnología y Telecomunicaciones, que evalúa la viabilidad tecnológica de los cambios.",
    "La Oficina Jurídica, para verificar el cumplimiento legal de las nuevas tecnologías.",
    "La Dirección General, para asegurar que la estrategia esté alineada con la visión institucional."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Dirección de Gestión de Tecnología y Telecomunicaciones es la encargada de evaluar la viabilidad tecnológica de cualquier cambio o innovación en los procesos dentro de la DIAN."
},
{
  "id": "dom218",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "En el marco de un proyecto para mejorar el control de tributos internacionales, un funcionario plantea la necesidad de apoyo interinstitucional. ¿Cuál es el primer paso a seguir?",
  "opciones": [
    "Coordinar con la Dirección de Gestión de Ingresos y la Dirección de Gestión de Aduanas para un plan conjunto.",
    "Solicitar la intervención de la Oficina Jurídica para revisar los marcos normativos internacionales.",
    "Iniciar el proceso directamente con la Subdirección de Gestión de Tecnología para implementar las herramientas."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El control de tributos internacionales involucra tanto a la Dirección de Gestión de Ingresos como a la Dirección de Gestión de Aduanas, por lo que se debe coordinar entre ellas un plan estratégico para el control eficiente."
},
{
  "id": "dom219",
  "tema": "Estructura Organizacional y Misionalidad de la DIAN",
  "pregunta": "Un equipo de trabajo de la DIAN está desarrollando un proyecto sobre el uso de la inteligencia artificial para el control fiscal. ¿Qué dependencia debe coordinar la implementación de este proyecto?",
  "opciones": [
    "La Dirección de Gestión de Tecnología y Telecomunicaciones, por su responsabilidad en innovación tecnológica.",
    "La Dirección General, para asegurar la coherencia institucional de la estrategia.",
    "La Oficina Jurídica, para verificar las implicaciones legales del uso de la inteligencia artificial."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La Dirección de Gestión de Tecnología y Telecomunicaciones es la encargada de liderar proyectos tecnológicos innovadores como la implementación de inteligencia artificial dentro de los procesos de control fiscal."
}





 
]