[
  {
    "id": "dsg-1",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "La Dirección de Gestión de Fiscalización requiere una solución para integrar datos de facturas electrónicas y declaraciones de renta. ¿Qué enfoque de diseño de datos sería el más adecuado para esta solución?",
    "opciones": [
      "Utilizar un Data Lake para almacenar los datos en su formato original y luego analizarlos con herramientas de BI.",
      "El uso de un Almacén de Datos (Data Warehouse) para consolidar y modelar la información, y un proceso ETL para la integración de los datos de ambas fuentes.",
      "Simplemente conectar las bases de datos de facturas y declaraciones con un enlace directo."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Un Data Warehouse es ideal para consolidar datos estructurados de múltiples fuentes para fines de análisis e informes, y el proceso ETL es el método estándar para realizar esta integración de manera limpia y estandarizada."
  },
  {
    "id": "dsg-2",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Un Gestor II debe diseñar un sistema para monitorear el flujo de mercancías de alto riesgo en las aduanas. ¿Qué componente del diseño de datos es fundamental para que el sistema pueda manejar un aumento repentino en el volumen de operaciones aduaneras?",
    "opciones": [
      "La interoperabilidad, para que los sistemas se comuniquen entre sí sin problemas.",
      "La seguridad, para proteger los datos de aduanas contra el acceso no autorizado.",
      "La escalabilidad de la arquitectura, para que el sistema pueda crecer y manejar el aumento en el volumen de datos sin comprometer su rendimiento."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La escalabilidad es la capacidad de una solución para manejar un aumento en la carga de trabajo, lo cual es esencial en entornos dinámicos y de alto volumen como el control aduanero."
  },
  {
    "id": "dsg-3",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "¿Qué normativa colombiana regula el uso de la facturación electrónica en la DIAN?",
    "opciones": [
      "Decreto 1083 de 2015.",
      "Ley 1581 de 2012.",
      "Decreto 2242 de 2015 y la Resolución 019 de 2016."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "El Decreto 2242 de 2015 y la Resolución 019 de 2016 son las normativas clave que reglamentan las condiciones técnicas y tecnológicas para la facturación electrónica en Colombia."
  },
  {
    "id": "dsg-4",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Como Gestor II, se le encarga participar en el diseño de un nuevo sistema de auditoría fiscal. El diseño debe asegurar que los datos tributarios cumplan con el principio de integridad. ¿Cuál de las siguientes acciones garantiza este principio?",
    "opciones": [
      "A. Implementar un sistema de acceso con contraseñas seguras y encriptación de datos para la entidad.",
      "B. Definir reglas de validación en la captura de datos para prevenir inconsistencias y errores en los sistemas.",
      "C. Crear copias de seguridad de los datos diariamente para prevenir la pérdida de la información."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La integridad de los datos se garantiza con reglas de validación en la captura que previenen inconsistencias y errores. La encriptación y las copias de seguridad se centran en la confidencialidad y la disponibilidad, respectivamente."
  },
  {
    "id": "dsg-5",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Un analista de la Dirección de Gestión de Aduanas requiere un reporte que combine datos de importación con información de transporte. La solución de gestión de datos de la DIAN debe permitir esta combinación. ¿Qué componente del diseño de datos facilita esta combinación de información?",
    "opciones": [
      "A. La escalabilidad de la arquitectura de datos.",
      "B. La interoperabilidad entre los sistemas de la entidad.",
      "C. La encriptación de los datos para la protección de la información."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La interoperabilidad de los datos se refiere a la capacidad de los sistemas para intercambiar y utilizar la información de manera coherente. Esto es crítico para combinar datos de aduanas con información de transporte."
  },
  {
    "id": "dsg-6",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Como Gestor II, se le encarga participar en el diseño de un sistema para la gestión de datos de facturación electrónica. La normativa de la DIAN exige que estos datos se conserven por 10 años. ¿Qué componente del diseño de datos se encarga de definir cómo se archivan los datos para cumplir con este requisito legal?",
    "opciones": [
      "A. La política de seguridad de la información.",
      "B. La política de retención y archivo de datos.",
      "C. El modelado de datos de la entidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La política de retención y archivo de datos establece por cuánto tiempo se deben conservar los datos y cómo deben ser archivados o eliminados de forma segura, lo que es fundamental para cumplir con los requisitos legales de la DIAN."
  },
  {
    "id": "dsg-7",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Un analista de la Dirección de Gestión de Fiscalización necesita generar un reporte sobre las tendencias de evasión de impuestos. La solución de gestión de datos de la DIAN le permite combinar información tributaria y de aduanas en un único reporte. ¿Qué componente de la solución de gestión de datos se está utilizando en este momento?",
    "opciones": [
      "A. El Almacén de Datos (Data Warehouse), que consolida la información para el análisis.",
      "B. El Lago de Datos (Data Lake), que almacena la información sin procesar para la entidad.",
      "C. El Repositorio de Documentos, que guarda los archivos PDF de las declaraciones de la entidad."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El Almacén de Datos (Data Warehouse) es un repositorio central de datos, diseñado para el análisis y la elaboración de informes. Es la herramienta adecuada para combinar información de múltiples fuentes para generar un reporte."
  },
  {
    "id": "dsg-8",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "En la DIAN, los datos de los contribuyentes son un activo valioso y sensible. ¿Qué normativa colombiana, además de las políticas internas, regula la protección de estos datos personales?",
    "opciones": [
      "A. El Decreto 2242 de 2015 sobre facturación electrónica.",
      "B. La Ley 1581 de 2012 sobre protección de datos personales.",
      "C. La Ley 1955 de 2019 sobre el Plan Nacional de Desarrollo."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Ley 1581 de 2012 es la normativa colombiana que establece las disposiciones generales para la protección de datos personales, lo que es fundamental para la gestión de la información de los contribuyentes en la DIAN."
  },
  {
    "id": "dsg-9",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Un Gestor II está desarrollando un proceso para la anonimización de datos tributarios para un reporte público. ¿Qué principio fundamental del diseño de soluciones se está aplicando en esta situación para proteger la identidad de los contribuyentes?",
    "opciones": [
      "A. El principio de usabilidad de los datos.",
      "B. El principio de seguridad de los datos.",
      "C. El principio de interoperabilidad de los sistemas."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La anonimización de los datos es una medida de seguridad que protege la confidencialidad de la información de los contribuyentes. Esta acción se enmarca en el principio de seguridad de los datos del diseño de soluciones de gestión de datos."
  },
  {
    "id": "dsg-10",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "En la DIAN, un nuevo proyecto de fiscalización requiere un sistema que pueda manejar un crecimiento exponencial en el volumen de datos de facturación electrónica. ¿Qué característica del diseño de la solución es la más importante para que el sistema pueda manejar este crecimiento sin comprometer su rendimiento?",
    "opciones": [
      "A. El modelado de datos, que define la estructura de la información de la entidad.",
      "B. La escalabilidad de la arquitectura de datos, que permite el crecimiento de la solución de la entidad.",
      "C. La gobernanza de datos, que asegura la calidad y el uso correcto de la información."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La escalabilidad de la arquitectura de datos es la capacidad de la solución para manejar un crecimiento exponencial en el volumen de datos y usuarios. Esta característica es vital en la DIAN para gestionar el aumento de la facturación electrónica."
  },
  {
    "id": "dsg-11",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "PJS: Un analista de la DIAN está desarrollando un modelo predictivo para identificar patrones de evasión fiscal. Para ello, necesita combinar datos de declaraciones de renta, facturación electrónica y registros aduaneros, los cuales provienen de diferentes sistemas con estructuras distintas. ¿Qué tipo de solución de integración de datos es la más adecuada para este caso?",
    "opciones": [
      "A. Una solución de modelado de datos.",
      "B. Una solución ETL (Extract, Transform, Load).",
      "C. Una solución de seguridad de datos."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Una solución ETL (Extract, Transform, Load) es la más adecuada para este caso. Este proceso permite extraer datos de diferentes fuentes, transformarlos para que sean consistentes y coherentes, y cargarlos en un destino único, como un almacén de datos, para el análisis."
  },
  {
    "id": "dsg-12",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "PJS: Un Gestor II está diseñando un sistema de información para el control aduanero. La política de gobernanza de la DIAN exige que se definan roles y responsabilidades para la gestión de los datos. ¿Qué rol se encarga de definir las políticas de uso y seguridad de los datos de aduanas, y es el responsable máximo del conjunto de datos?",
    "opciones": [
      "A. El Data Custodian, que es el responsable técnico del almacenamiento.",
      "B. El Data Owner, que es la máxima autoridad sobre los datos.",
      "C. El Data Steward, que implementa las políticas del Data Owner."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El Data Owner es el responsable máximo de la calidad, seguridad y uso de un conjunto de datos, lo que incluye la definición de políticas. En el contexto de la DIAN, la Dirección de Gestión de Aduanas podría ser el Data Owner de los datos de aduanas."
  },
  {
    "id": "dsg-13",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "PJS: Un Gestor II, en su rol de mantenimiento de la integridad de los datos, identifica que un registro de una declaración de impuestos tiene un valor que no cumple con las reglas del negocio de la DIAN. ¿Qué tipo de política de calidad de datos se está violando en esta situación, y qué se busca proteger con su corrección?",
    "opciones": [
      "A. La política de Completitud, ya que el campo no tiene un valor válido para la entidad.",
      "B. La política de Validez, ya que los datos del registro no cumplen con las reglas del negocio, protegiendo la fiabilidad de la información.",
      "C. La política de Consistencia, ya que los datos del registro no son coherentes con otros datos de la entidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La política de Validez de los datos se encarga de asegurar que los datos cumplan con las reglas del negocio. Un valor que no cumple con estas reglas es una violación de esta política, y su corrección protege la fiabilidad de la información, que es crucial para la fiscalización."
  },
  {
    "id": "dsg-14",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "PJS: Un Gestor II está desarrollando un reporte para la Dirección General que combina información tributaria y de aduanas. El reporte debe ser auditable, es decir, debe poder rastrear el origen, las transformaciones y los cambios de cada dato. ¿Qué componente del diseño de soluciones de gestión de datos se está utilizando para lograr este objetivo?",
    "opciones": [
      "A. La gobernanza de datos de la entidad.",
      "B. El linaje de datos de la entidad.",
      "C. La interoperabilidad de los sistemas de la entidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El linaje de datos es el rastro de la vida de un dato, desde su origen hasta su uso final. Este componente es fundamental para la transparencia y la auditoría, ya que permite rastrear la fuente, las transformaciones y los cambios de un dato en el reporte."
  },
  {
    "id": "dsg-15",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "PJS: Un Gestor II, en el marco de la implementación de un nuevo sistema de información para la gestión de aduanas, debe definir los procedimientos de anonimización para un conjunto de datos tributarios que será usado para un reporte estadístico. ¿Qué política de gobierno de datos se debe priorizar al definir estos procedimientos?",
    "opciones": [
      "A. La política de seguridad de la información.",
      "B. La política de privacidad y confidencialidad.",
      "C. La política de calidad de datos."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La anonimización de los datos es un procedimiento que se enmarca en la política de privacidad y confidencialidad. Esta política es la que establece las reglas para el manejo de la información que identifica a personas, garantizando el cumplimiento de leyes como el habeas data."
  },
  {
    "id": "dsg-16",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "PJS: Un Gestor II está desarrollando un proceso para la anonimización de datos tributarios para un reporte público. La política de privacidad de la DIAN, basada en el Habeas Data, es estricta al respecto. Si el proceso de anonimización falla y la identidad de un contribuyente se revela, ¿qué principio de la política de privacidad se ha vulnerado, y cuál es la consecuencia más grave para la entidad?",
    "opciones": [
      "A. El principio de Calidad de Datos, ya que la información no es precisa y completa en el reporte público.",
      "B. El principio de Confidencialidad, ya que se reveló la identidad de un contribuyente, lo que compromete la confianza ciudadana en la DIAN.",
      "C. El principio de Oportunidad, ya que la información no fue anonimizada en tiempo real para el reporte público."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El principio de Confidencialidad de la política de privacidad se encarga de proteger la información personal de los contribuyentes. Una falla en el proceso de anonimización que revela la identidad de un contribuyente vulnera este principio, comprometiendo la confianza de los ciudadanos en la DIAN, lo que es la consecuencia más grave para la misionalidad de la entidad."
  },
  {
    "id": "dsg-17",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "PJS: Un Gestor II, en el marco de la implementación de la Arquitectura Digital de la DIAN, se encuentra con una base de datos que tiene un campo 'NIT' con valores numéricos y alfanuméricos. El nuevo estándar de la Arquitectura Digital establece que el NIT debe ser un valor numérico. ¿Qué acción debe tomar el Gestor II para conciliar la necesidad de estandarización con la validez de los datos históricos?",
    "opciones": [
      "A. Modificar todos los valores alfanuméricos a un valor numérico por defecto, ya que el estándar de la Arquitectura Digital es prioritario en la entidad.",
      "B. Proponer al Data Owner de la información una estrategia para migrar los datos históricos y definir un proceso de validación para los nuevos registros, asegurando que se cumpla con el estándar de la Arquitectura Digital sin comprometer la integridad de la información.",
      "C. Eliminar todos los registros con valores alfanuméricos en el campo 'NIT', ya que no cumplen con el nuevo estándar y no se pueden utilizar para la toma de decisiones de la entidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Arquitectura Digital de la DIAN se basa en la interoperabilidad de los sistemas y la consistencia de los datos. El Gestor II debe proponer una estrategia que concilie la necesidad de estandarización con la validez de los datos históricos. La migración de los datos históricos y la validación de los nuevos registros es la acción más adecuada para asegurar que se cumpla con el estándar de la Arquitectura Digital sin comprometer la integridad de la información."
  },
  {
    "id": "dsg-18",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Un Gestor II, en el diseño de un sistema de información para la gestión de aduanas, se encuentra con la necesidad de integrar datos de una nueva plataforma de logística de terceros. El contrato con el proveedor establece un formato de datos no estándar que genera inconsistencias al ser combinado con los datos de la DIAN. ¿Qué acción debe tomar el Gestor II para resolver este problema y cumplir con el Gobierno de Datos de la DIAN?",
    "opciones": [
      "A. Aceptar el formato no estándar de los datos de terceros y procesarlos en la etapa de Almacenamiento.",
      "B. Proponer un proceso de transformación (ETL) para convertir el formato de los datos de terceros al estándar de la DIAN antes de ser almacenados.",
      "C. Rechazar el formato no estándar de los datos de terceros, ya que la política de la DIAN prohíbe la integración de datos no estandarizados."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La solución más adecuada es utilizar un proceso de transformación (ETL) para convertir el formato de los datos de terceros al estándar de la DIAN antes de ser almacenados. Esto garantiza la integridad y la consistencia de los datos en el repositorio de la entidad."
  },
  {
    "id": "dsg-19",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "En la DIAN, se está desarrollando un nuevo sistema de información para el control de la evasión de impuestos. La solución requiere el uso de datos tributarios, aduaneros y cambiarios. Para asegurar la seguridad de la información, la normativa de la DIAN exige que se implementen controles de acceso basados en roles. ¿Qué componente del diseño de datos se está aplicando en esta situación?",
    "opciones": [
      "A. El modelado de datos, que define las relaciones entre los datos de la entidad.",
      "B. La gobernanza de datos, que define los roles y responsabilidades para la gestión de los datos.",
      "C. La arquitectura de datos, que define la estructura y el flujo de la información."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La gobernanza de datos es el marco de gestión que establece los roles y responsabilidades para el uso y manejo de la información. El control de acceso basado en roles es un componente clave de la gobernanza de datos para garantizar la seguridad de la información."
  },
  {
    "id": "dsg-20",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Un Gestor II debe diseñar un sistema para monitorear el flujo de mercancías de alto riesgo en las aduanas. La solución debe ser escalable para manejar un aumento repentino en el volumen de operaciones aduaneras. ¿Qué componente del diseño de la solución es el más importante para que el sistema pueda manejar este crecimiento sin comprometer su rendimiento?",
    "opciones": [
      "A. La escalabilidad de la arquitectura de datos.",
      "B. La interoperabilidad entre los sistemas de la entidad.",
      "C. La encriptación de los datos para la protección de la información."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La escalabilidad de la arquitectura de datos es la capacidad de la solución para manejar un crecimiento exponencial en el volumen de datos y usuarios. Esta característica es vital en la DIAN para gestionar el aumento de las operaciones aduaneras sin comprometer el rendimiento del sistema."
  },
  {
    "id": "dsg-21",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Un analista de la Dirección de Gestión de Fiscalización necesita generar un reporte que combine información de facturación electrónica y declaraciones de renta. El Gestor II detecta que los datos de ambas fuentes tienen una estructura diferente. ¿Qué componente del diseño de datos es el más adecuado para resolver este problema y permitir la generación del reporte?",
    "opciones": [
      "A. La gobernanza de datos, para definir los roles y responsabilidades para la gestión de los datos.",
      "B. La integración de datos (ETL), para transformar los datos de ambas fuentes a un formato único.",
      "C. La seguridad de datos, para proteger la confidencialidad de la información."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La integración de datos (ETL) es el proceso de combinar datos de diferentes fuentes en un único destino. Este proceso es el más adecuado para resolver el problema de la estructura diferente de los datos de facturación electrónica y declaraciones de renta, permitiendo la generación del reporte."
  },
  {
    "id": "dsg-22",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Un Gestor II, en el diseño de un sistema de información para el control aduanero, se encuentra con la necesidad de almacenar información de importadores y exportadores. La política de retención de datos de la DIAN establece que los registros deben conservarse por 10 años. ¿Qué componente del diseño de datos se encarga de definir cómo se archivan los datos para cumplir con este requisito legal?",
    "opciones": [
      "A. La política de seguridad de la información.",
      "B. La política de retención y archivo de datos.",
      "C. El modelado de datos de la entidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La política de retención y archivo de datos establece por cuánto tiempo se deben conservar los datos y cómo deben ser archivados o eliminados de forma segura, lo que es fundamental para cumplir con los requisitos legales de la DIAN."
  },
  {
    "id": "dsg-23",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "En un Data Warehouse para la Dirección de Gestión de Fiscalización, se propone un modelo de datos desnormalizado para optimizar la velocidad de los reportes. Sin embargo, esto podría generar redundancia de datos, lo que contraviene la política de integridad. ¿Qué acción debe tomar el Gestor II para resolver este conflicto, priorizando la misionalidad de la DIAN?",
    "opciones": [
      "A. Continuar con el diseño desnormalizado, ya que la velocidad de los reportes es un factor crítico para la fiscalización, y gestionar la integridad con procesos de limpieza de datos periódicos.",
      "B. Proponer un diseño híbrido, donde se mantenga la integridad de los datos en la base de datos principal y se utilicen vistas materializadas desnormalizadas para la optimización de reportes, asegurando la coherencia en la entidad.",
      "C. Rechazar completamente el diseño desnormalizado, ya que la integridad de los datos es la prioridad absoluta y no se puede comprometer en ningún caso."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Un diseño híbrido es una solución estratégica que concilia la necesidad de velocidad de los reportes (para la misionalidad de fiscalización) con el principio de integridad de los datos. Esta acción protege la fiabilidad de la información sin sacrificar la eficiencia operativa, que es un pilar de la gestión moderna de la DIAN."
  },
  {
    "id": "dsg-24",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "La DIAN ha adoptado un nuevo estándar de codificación para la facturación electrónica (UBL 2.1) que modifica la estructura de los archivos XML. El equipo de captura de datos ha implementado el cambio, pero el equipo de análisis de datos no ha actualizado sus sistemas. ¿Qué componente del diseño de soluciones está fallando en este escenario?",
    "opciones": [
      "A. La gobernanza de datos, por no definir los roles y responsabilidades para la gestión de los datos de la entidad.",
      "B. La interoperabilidad, ya que la falta de un formato estándar impide que los sistemas de captura y análisis se comuniquen y utilicen los datos de manera coherente en la entidad.",
      "C. El linaje de datos, por no documentar la fuente de los datos de la facturación electrónica en la entidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La interoperabilidad se refiere a la capacidad de los sistemas para intercambiar y utilizar la información de manera coherente. La falta de un formato estándar para la facturación electrónica impide que los sistemas de captura y análisis se comuniquen, lo que genera una falla en la interoperabilidad."
  },
  {
    "id": "dsg-25",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Como Gestor II, se le asigna la tarea de diseñar un sistema de monitoreo en tiempo real del flujo de mercancías en las aduanas, con el objetivo de detectar contrabando. La solución requiere una alta escalabilidad para manejar un volumen masivo de datos. ¿Qué tipo de plataforma de gestión de datos es la más adecuada para este sistema?",
    "opciones": [
      "A. Un Sistema de Gestión de Bases de Datos Relacionales (DBMS), ya que la información del flujo de mercancías es estructurada y debe ser consistente.",
      "B. Un Sistema de Gestión de Bases de Datos No Relacionales (NoSQL), ya que la solución requiere una alta escalabilidad para manejar grandes volúmenes de datos en tiempo real.",
      "C. Un Repositorio de Documentos, ya que la solución requiere la gestión de archivos de aduanas en la entidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Un Sistema de Gestión de Bases de Datos No Relacionales (NoSQL) es el más adecuado para este sistema. Este tipo de plataforma de gestión de datos es flexible y escalable, lo que permite manejar un volumen masivo de datos en tiempo real, lo cual es crucial para la detección de contrabando en la DIAN."
  },
  {
    "id": "dsg-26",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Un Gestor II, en su rol de mantenimiento de la integridad de los datos, identifica que un proceso de anonimización de datos tributarios para un reporte público está fallando, revelando información personal de los contribuyentes. ¿Qué principio fundamental del diseño de soluciones se está violando en esta situación, y cuál es la consecuencia más grave para la entidad?",
    "opciones": [
      "A. El principio de usabilidad, ya que la anonimización es incompleta y el reporte no es útil para los analistas de la entidad.",
      "B. El principio de seguridad de datos, ya que se violó la confidencialidad de la información, lo que compromete la confianza ciudadana en la DIAN y genera riesgos legales.",
      "C. El principio de interoperabilidad, ya que la anonimización es incompleta y el reporte no puede ser combinado con otros datos de la entidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Una falla en el proceso de anonimización de datos que revela la identidad de los contribuyentes es una violación del principio de seguridad de los datos, ya que compromete la confidencialidad de la información. La consecuencia más grave para la DIAN es la pérdida de la confianza ciudadana y los riesgos legales, como lo establece la Ley 1581 de 2012."
  },
  {
    "id": "dsg-27",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "La Dirección de Gestión de Fiscalización ha solicitado un reporte analítico que combine datos de facturación electrónica y registros aduaneros para la detección de contrabando. La solución requiere el uso de datos históricos de ambas fuentes, pero los datos de aduanas se encuentran en un formato no estructurado y los de facturación electrónica en un formato estructurado. ¿Qué tipo de arquitectura de datos es la más adecuada para resolver este problema?",
    "opciones": [
      "A. Una arquitectura de datos basada en un Data Warehouse, que combina datos estructurados y no estructurados en un único repositorio.",
      "B. Una arquitectura de datos basada en un Data Lake, que almacena los datos en su formato original y permite la transformación y el análisis de la información de forma flexible.",
      "C. Una arquitectura de datos basada en un Repositorio de Documentos, que almacena los datos en su formato original y permite la búsqueda de la información."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Una arquitectura de datos basada en un Data Lake es la más adecuada para este problema. Un Data Lake es un repositorio que almacena datos en su formato nativo, sin transformarlos, lo que permite la combinación de datos estructurados y no estructurados, como los de aduanas y facturación electrónica, para el análisis."
  },
  {
    "id": "dsg-28",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Un Gestor II, en el diseño de un nuevo sistema de información para el control aduanero, se encuentra con la necesidad de almacenar información de importadores y exportadores. La política de retención de datos de la DIAN establece que los registros deben conservarse por 10 años, pero la política de seguridad de la información exige que se eliminen después de 5 años para reducir el riesgo de fuga. ¿Qué acción debe tomar el Gestor II para resolver este conflicto?",
    "opciones": [
      "A. Priorizar la política de retención de 10 años, ya que la normativa legal de la entidad es la más importante.",
      "B. Priorizar la política de seguridad de 5 años, ya que la protección de la información es la prioridad de la entidad.",
      "C. Consultar con el Data Owner de la información para encontrar un equilibrio entre ambas políticas, asegurando que se cumpla con la normativa de la entidad sin comprometer la integridad de la información."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La política de retención de datos se rige por los requisitos legales y regulatorios. Si una política interna de la DIAN contraviene la normativa legal, se genera un riesgo legal y de cumplimiento. La acción correcta es priorizar la política de retención de 10 años para cumplir con la normativa de la entidad."
  },
  {
    "id": "dsg-29",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Un Gestor II, en el diseño de un nuevo sistema de información para el control aduanero, se encuentra con la necesidad de almacenar información de importadores y exportadores. La política de retención de datos de la DIAN establece que los registros deben conservarse por 10 años. ¿Qué componente del diseño de datos se encarga de definir cómo se archivan los datos para cumplir con este requisito legal?",
    "opciones": [
      "A. La política de seguridad de la información.",
      "B. La política de retención y archivo de datos.",
      "C. El modelado de datos de la entidad."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La política de retención y archivo de datos establece por cuánto tiempo se deben conservar los datos y cómo deben ser archivados o eliminados de forma segura, lo que es fundamental para cumplir con los requisitos legales de la DIAN."
  },
  {
    "id": "dsg-30",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Un analista de la Dirección de Gestión de Fiscalización necesita generar un reporte que combine información de facturación electrónica y declaraciones de renta. El Gestor II detecta que los datos de ambas fuentes tienen una estructura diferente. ¿Qué componente del diseño de datos es el más adecuado para resolver este problema y permitir la generación del reporte?",
    "opciones": [
      "A. La gobernanza de datos, para definir los roles y responsabilidades para la gestión de los datos.",
      "B. La integración de datos (ETL), para transformar los datos de ambas fuentes a un formato único.",
      "C. La seguridad de datos, para proteger la confidencialidad de la información."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La integración de datos (ETL) es el proceso de combinar datos de diferentes fuentes en un único destino. Este proceso es el más adecuado para resolver el problema de la estructura diferente de los datos de facturación electrónica y declaraciones de renta, permitiendo la generación del reporte."
  },
  {
    "id": "dsg-31",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Un Gestor II debe diseñar un sistema para monitorear el flujo de mercancías de alto riesgo en las aduanas. La solución debe ser escalable para manejar un aumento repentino en el volumen de operaciones aduaneras. ¿Qué componente del diseño de la solución es el más importante para que el sistema pueda manejar este crecimiento sin comprometer su rendimiento?",
    "opciones": [
      "A. La escalabilidad de la arquitectura de datos.",
      "B. La interoperabilidad entre los sistemas de la entidad.",
      "C. La encriptación de los datos para la protección de la información."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La escalabilidad de la arquitectura de datos es la capacidad de la solución para manejar un crecimiento exponencial en el volumen de datos y usuarios. Esta característica es vital en la DIAN para gestionar el aumento de las operaciones aduaneras sin comprometer el rendimiento del sistema."
  },
  {
    "id": "dsg-32",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "En la DIAN, se está desarrollando un nuevo sistema de información para el control de la evasión de impuestos. La solución requiere el uso de datos tributarios, aduaneros y cambiarios. Para asegurar la seguridad de la información, la normativa de la DIAN exige que se implementen controles de acceso basados en roles. ¿Qué componente del diseño de datos se está aplicando en esta situación?",
    "opciones": [
      "A. El modelado de datos, que define las relaciones entre los datos de la entidad.",
      "B. La gobernanza de datos, que define los roles y responsabilidades para la gestión de los datos.",
      "C. La arquitectura de datos, que define la estructura y el flujo de la información."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La gobernanza de datos es el marco de gestión que establece los roles y responsabilidades para el uso y manejo de la información. El control de acceso basado en roles es un componente clave de la gobernanza de datos para garantizar la seguridad de la información."
  },
  {
    "id": "dsg-33",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "En la DIAN, un analista debe diseñar un sistema para integrar datos de facturas electrónicas provenientes de múltiples contribuyentes. ¿Qué estándar debe priorizar para garantizar interoperabilidad?",
    "opciones": [
      "A. Formato XML genérico sin especificación.",
      "B. UBL 2.1, según el Decreto 2242 de 2015.",
      "C. PDF con firma digital."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El Decreto 2242 de 2015 establece el uso obligatorio del estándar UBL 2.1 para facturas electrónicas en Colombia, asegurando consistencia y interoperabilidad."
  },
  {
    "id": "dsg-34",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Al diseñar un almacén de datos para auditorías fiscales, ¿cuál es la práctica recomendada para garantizar la trazabilidad de los datos?",
    "opciones": [
      "A. Eliminar registros antiguos para optimizar espacio.",
      "B. Implementar linaje de datos (data lineage) según DAMA-DMBOK.",
      "C. Almacenar solo datos agregados sin detalle."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El linaje de datos (DAMA-DMBOK) permite rastrear el origen y transformaciones de los datos, esencial para auditorías y cumplimiento normativo en la DIAN."
  },
  {
    "id": "dsg-35",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "¿Qué componente es crítico en la arquitectura de datos de la DIAN para manejar el aumento de declaraciones tributarias en época de renta?",
    "opciones": [
      "A. Escalabilidad horizontal en la nube.",
      "B. Uso exclusivo de servidores físicos locales.",
      "C. Bases de datos no relacionales para todos los casos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La escalabilidad horizontal en la nube permite ajustar recursos según demanda, clave para procesos masivos como declaraciones de renta (Resolución 019 de 2016)."
  },
  {
    "id": "dsg-36",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Un equipo de la DIAN debe proteger datos personales de contribuyentes. ¿Qué normativa es obligatoria considerar?",
    "opciones": [
      "A. Ley 1581 de 2012 (Protección de Datos Personales).",
      "B. Decreto 1074 de 2015 (Comercio Electrónico).",
      "C. Circular 002 de 2020 (Servicio al Cliente)."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La Ley 1581 de 2012 regula el tratamiento de datos personales en Colombia, aplicable a la DIAN para información de contribuyentes."
  },
  {
    "id": "dsg-37",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "¿Qué herramienta de integración de datos sería más adecuada para consolidar información tributaria desde múltiples sistemas regionales de la DIAN?",
    "opciones": [
      "A. Procesamiento manual en hojas de cálculo.",
      "B. ETL (Extract, Transform, Load) con validaciones automatizadas.",
      "C. Correo electrónico con archivos adjuntos."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Los procesos ETL automatizados garantizan precisión y eficiencia en la integración de datos distribuidos, alineado con buenas prácticas de gestión (DAMA-DMBOK)."
  },
  {
    "id": "dsg-38",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Para garantizar la seguridad de los datos en un sistema de la DIAN, ¿qué medida es esencial según el Manual de Seguridad de la Información de la entidad?",
    "opciones": [
      "A. Encriptación de datos sensibles en reposo y tránsito.",
      "B. Almacenamiento en dispositivos USB sin protección.",
      "C. Uso de contraseñas genéricas para todos los usuarios."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El Manual de Seguridad de la DIAN exige encriptación de datos sensibles, conforme a estándares como ISO 27001."
  },
  {
    "id": "dsg-39",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Al diseñar un lago de datos para facturas electrónicas, ¿qué tipo de datos debe incluirse prioritariamente?",
    "opciones": [
      "A. Solo metadatos de las facturas.",
      "B. Datos estructurados (ej. XML UBL 2.1) y no estructurados (ej. imágenes de firmas).",
      "C. Únicamente registros de errores."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Un lago de datos en la DIAN debe almacenar tanto datos estructurados (facturas UBL) como no estructurados para análisis integral (Decreto 2242 de 2015)."
  },
  {
    "id": "dsg-40",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "¿Qué marco de referencia es recomendable para la gobernanza de datos en la DIAN?",
    "opciones": [
      "A. Marco SCRUM para desarrollo ágil.",
      "B. DAMA-DMBOK para gestión de datos.",
      "C. ITIL para gestión de servicios TI."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "DAMA-DMBOK es el marco estándar para gobernanza de datos, incluyendo calidad, seguridad y cumplimiento en entornos como la DIAN."
  },
  {
    "id": "dsg-41",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "¿Cuál es el propósito principal de un almacén de datos (data warehouse) en la DIAN?",
    "opciones": [
      "A. Almacenar datos temporales para procesos ETL.",
      "B. Consolidar datos históricos para análisis y reporting fiscal.",
      "C. Reemplazar bases de datos transaccionales en tiempo real."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Los almacenes de datos permiten análisis históricos y generación de reportes fiscales, clave para la toma de decisiones en la DIAN."
  },
  {
    "id": "dsg-42",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Según la Resolución 019 de 2016, ¿qué aspecto debe auditarse periódicamente en los sistemas de gestión de datos de la DIAN?",
    "opciones": [
      "A. Solo el rendimiento de las bases de datos.",
      "B. Controles de acceso y cumplimiento de políticas de seguridad.",
      "C. Diseño de interfaces gráficas."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Resolución 019 de 2016 exige auditorías de controles de acceso y seguridad, alineadas con estándares como ISO 27001."
  },
  {
    "id": "dsg-43",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "¿Qué técnica de modelado de datos es más adecuada para representar las relaciones entre contribuyentes y sus declaraciones tributarias?",
    "opciones": [
      "A. Modelo relacional con claves foráneas.",
      "B. Modelo jerárquico en árbol.",
      "C. Modelo de documentos NoSQL."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El modelo relacional es óptimo para datos estructurados con relaciones claras (ej. contribuyente-declaración), usado en sistemas tributarios."
  },
  {
    "id": "dsg-44",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "En un proyecto de migración de datos a la nube en la DIAN, ¿qué factor es prioritario según el Manual de Seguridad de la entidad?",
    "opciones": [
      "A. Costo económico exclusivamente.",
      "B. Certificación del proveedor en ISO 27001.",
      "C. Velocidad de transferencia sin encriptación."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La DIAN exige proveedores con certificaciones de seguridad (ej. ISO 27001) para migraciones a la nube, según su Manual de Seguridad."
  },
  {
    "id": "dsg-45",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "¿Qué proceso asegura la calidad de los datos al integrar información del RUT (Registro Único Tributario) con otros sistemas de la DIAN?",
    "opciones": [
      "A. Validación manual aleatoria.",
      "B. Limpieza y estandarización automatizada (ETL).",
      "C. Eliminación de registros duplicados sin verificación."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Los procesos ETL incluyen limpieza y estandarización automatizada, clave para garantizar calidad en integraciones de datos (DAMA-DMBOK)."
  },
  {
    "id": "dsg-46",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "¿Qué tipo de base de datos es más adecuado para consultas complejas sobre historial fiscal de contribuyentes?",
    "opciones": [
      "A. Base de datos relacional (ej. Oracle, SQL Server).",
      "B. Base de datos de grafos.",
      "C. Almacén de claves-valor (Redis)."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "Las bases relacionales son ideales para consultas complejas con joins entre tablas, comunes en sistemas tributarios."
  },
  {
    "id": "dsg-47",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "¿Qué norma internacional es referente para la gestión de riesgos en datos financieros, aplicable a la DIAN?",
    "opciones": [
      "A. ISO 9001 (Calidad).",
      "B. BCBS 239 (Gestión de Riesgos en Datos Financieros).",
      "C. GDPR (Protección de Datos en UE)."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El estándar BCBS 239 del Comité de Basilea es clave para gestión de riesgos en datos financieros, relevante para la DIAN."
  },
  {
    "id": "dsg-48",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "La DIAN necesita implementar un sistema para detectar patrones de evasión fiscal mediante análisis de grandes volúmenes de datos. ¿Qué arquitectura de datos es más adecuada?",
    "opciones": [
      "A. Data Warehouse tradicional con procesamiento por lotes (batch).",
      "B. Arquitectura Lambda (procesamiento batch + stream en tiempo real).",
      "C. Base de datos relacional sin capacidades de análisis."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La arquitectura Lambda combina batch (para datos históricos) y stream (para datos en tiempo real), ideal para detectar anomalías fiscales de manera proactiva (DAMA-DMBOK)."
  },
  {
    "id": "dsg-49",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "¿Qué componente de un sistema de gestión de datos en la DIAN es crítico para cumplir con el principio de 'seguridad por diseño' establecido en el Manual de Seguridad de la entidad?",
    "opciones": [
      "A. Encriptación end-to-end desde el diseño inicial.",
      "B. Controles de acceso implementados solo en producción.",
      "C. Registros de auditoría opcionales."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La 'seguridad por diseño' exige medidas como encriptación end-to-end desde las fases iniciales, conforme al Manual de Seguridad de la DIAN e ISO 27001."
  },
  {
    "id": "dsg-50",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Al diseñar un proceso ETL para integrar datos de la UGPP con los sistemas de la DIAN, ¿qué técnica minimiza riesgos de inconsistencias?",
    "opciones": [
      "A. Validación de datos con reglas empresariales (ej. cruce de NITs).",
      "B. Carga directa sin transformaciones.",
      "C. Procesamiento manual de discrepancias."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La validación con reglas empresariales (ej. comparar NITs entre sistemas) asegura consistencia, clave para procesos como reportes a la UGPP (Resolución 019 de 2016)."
  },
  {
    "id": "dsg-51",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "¿Qué estándar de gobernanza de datos es aplicable para garantizar la calidad de la información en el Registro Único Tributario (RUT)?",
    "opciones": [
      "A. Principios de DCAM (Data Management Capability Assessment Model).",
      "B. Framework COBIT para TI.",
      "C. Metodología SCRUM."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "DCAM es un modelo especializado en evaluación de capacidades de gestión de datos, alineado con DAMA-DMBOK, usado para garantizar calidad en sistemas como el RUT."
  },
  {
    "id": "dsg-52",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "En un proyecto de migración a la nube de los sistemas de la DIAN, ¿qué estrategia de migración de datos prioriza la continuidad operativa?",
    "opciones": [
      "A. Migración en frío (offline) sin sincronización.",
      "B. Migración híbrida (faseada) con sincronización bidireccional.",
      "C. Reemplazo total sin pruebas previas."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La migración híbrida faseada minimiza riesgos, permitiendo sincronización entre sistemas antiguos y nuevos, clave para servicios críticos como declaraciones tributarias."
  },
  {
    "id": "dsg-53",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "¿Qué tipo de modelo de datos permite representar mejor las relaciones complejas entre empresas, socios y transacciones en la DIAN?",
    "opciones": [
      "A. Modelo relacional normalizado.",
      "B. Modelo de grafos (ej. Neo4j).",
      "C. Modelo documental (JSON)."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Los modelos de grafos son ideales para relaciones complejas (ej. redes de socios comerciales), útiles en investigaciones de evasión fiscal."
  },
  {
    "id": "dsg-54",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Para garantizar el cumplimiento del Decreto 2242 de 2015 en facturación electrónica, ¿qué componente es esencial en el diseño del sistema?",
    "opciones": [
      "A. Validador de firmas digitales y estructura UBL 2.1.",
      "B. Almacenamiento en PDF sin metadatos.",
      "C. Procesamiento offline sin registro de auditoría."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El Decreto 2242 exige validación de firmas digitales y estructura UBL 2.1 para facturas electrónicas, con auditoría (Resolución 019 de 2016)."
  },
  {
    "id": "dsg-55",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "¿Qué enfoque de integración de datos es más adecuado para consolidar información en tiempo real de los sistemas aduaneros (SIISCOMEX) con los tributarios?",
    "opciones": [
      "A. ETL tradicional con procesamiento por lotes.",
      "B. ELT con streaming (ej. Apache Kafka).",
      "C. Integración manual vía correo electrónico."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "ELT con streaming permite integración en tiempo real, necesaria para cruzar datos aduaneros y tributarios (ej. subvaluación de importaciones)."
  },
  {
    "id": "dsg-56",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Según la Ley 1581 de 2012, ¿qué debe incluirse en el diseño de un sistema de la DIAN que maneje datos personales de contribuyentes?",
    "opciones": [
      "A. Mecanismos para ejercicio de derechos Habeas Data.",
      "B. Almacenamiento indefinido sin políticas de retención.",
      "C. Acceso público sin autenticación."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La Ley 1581 exige garantizar derechos de acceso, rectificación y supresión (Habeas Data), mediante autenticación y políticas claras."
  },
  {
    "id": "dsg-57",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "¿Qué técnica de modelado optimiza el desempeño de consultas sobre declaraciones de renta históricas en la DIAN?",
    "opciones": [
      "A. Particionamiento por rangos (ej. por año fiscal).",
      "B. Normalización extrema hasta 5FN.",
      "C. Uso exclusivo de índices no agrupados."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El particionamiento por rangos (ej. año fiscal) mejora performance en consultas sobre grandes volúmenes de datos históricos (DAMA-DMBOK)."
  },
  {
    "id": "dsg-58",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "En el contexto de la DIAN, ¿qué tipo de almacén de datos permite análisis avanzados de evolución tributaria por sector económico?",
    "opciones": [
      "A. Data Mart especializado en dimensiones fiscales.",
      "B. Base de datos transaccional sin historial.",
      "C. Almacén de documentos NoSQL."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "Un Data Mart con dimensiones como sector económico, región y período fiscal facilita análisis específicos (ej. crecimiento de recaudos por industria)."
  },
  {
    "id": "dsg-59",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "¿Qué estándar internacional es relevante para la gestión de riesgos operacionales en sistemas de datos de la DIAN?",
    "opciones": [
      "A. ISO 27001 (Seguridad de la Información).",
      "B. PCI DSS (Seguridad de pagos).",
      "C. GDPR (Protección de datos en UE)."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "ISO 27001 es el estándar aplicable para gestión de riesgos operacionales en sistemas fiscales, según el Manual de Seguridad de la DIAN."
  },
  {
    "id": "dsg-60",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Para mejorar la interoperabilidad entre la DIAN y otras entidades (ej. UGPP), ¿qué tecnología es clave?",
    "opciones": [
      "A. APIs REST con autenticación OAuth 2.0.",
      "B. Intercambio de archivos planos vía FTP.",
      "C. Comunicación vía redes sociales."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "APIs REST con OAuth 2.0 permiten integración segura y escalable entre entidades, conforme a estándares de gobierno digital (Decreto 1008 de 2018)."
  },
  {
    "id": "dsg-61",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "¿Qué práctica de gobernanza de datos ayuda a la DIAN a cumplir con el principio de 'calidad de datos' en el RUT?",
    "opciones": [
      "A. Metadatos estandarizados y diccionarios de datos.",
      "B. Eliminación periódica de registros sin revisión.",
      "C. Validación manual aleatoria."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "Metadatos y diccionarios de datos estandarizados (DAMA-DMBOK) aseguran consistencia y calidad en sistemas como el RUT."
  },
  {
    "id": "dsg-62",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Al diseñar un lago de datos para la DIAN, ¿qué estrategia equilibra costos y accesibilidad?",
    "opciones": [
      "A. Almacenamiento en frío (cold storage) para datos antiguos.",
      "B. Replicación completa en tres zonas geográficas.",
      "C. Eliminación de datos después de 6 meses."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El cold storage reduce costos para datos antiguos poco accedidos, manteniéndolos disponibles para auditorías (Resolución 019 de 2016)."
  },
  {
    "id": "dsg-63",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "¿Qué enfoque de seguridad es obligatorio para datos clasificados como 'confidenciales' en la DIAN?",
    "opciones": [
      "A. Encriptación AES-256 y controles de acceso RBAC.",
      "B. Almacenamiento en servidores sin firewall.",
      "C. Compartir credenciales entre equipos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El Manual de Seguridad de la DIAN exige encriptación AES-256 y RBAC (Role-Based Access Control) para datos confidenciales."
  },
  {
    "id": "dsg-64",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "En un proyecto de inteligencia fiscal, ¿qué técnica de análisis de datos detectaría patrones de evasión complejos?",
    "opciones": [
      "A. Regresión lineal simple.",
      "B. Redes neuronales con aprendizaje no supervisado.",
      "C. Consultas SQL básicas."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Las redes neuronales identifican patrones no evidentes (ej. fraude fiscal), mediante técnicas de machine learning no supervisado."
  },
  {
    "id": "dsg-65",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "¿Qué componente de arquitectura de datos soporta mejor el análisis de flujos comerciales en aduanas?",
    "opciones": [
      "A. Stream processing (ej. Apache Flink).",
      "B. Tablas hash en memoria.",
      "C. Archivos CSV estáticos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El stream processing analiza datos en tiempo real (ej. importaciones/exportaciones), clave para control aduanero (SIISCOMEX)."
  },
  {
    "id": "dsg-66",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "¿Qué normativa exige a la DIAN implementar medidas técnicas para evitar la alteración no autorizada de datos tributarios?",
    "opciones": [
      "A. Ley 527 de 1999 (Comercio Electrónico).",
      "B. Resolución 019 de 2016 (Seguridad de la Información).",
      "C. Decreto 1074 de 2015 (Reglamentario del comercio)."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La Resolución 019 de 2016 de la DIAN establece controles técnicos para integridad de datos, alineados con ISO 27001."
  },
  {
    "id": "dsg-67",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Para optimizar el rendimiento en consultas masivas de declaraciones tributarias, ¿qué técnica de indexación es recomendable?",
    "opciones": [
      "A. Índices compuestos en campos frecuentemente consultados (ej. NIT + período).",
      "B. Índices en todas las columnas sin planificación.",
      "C. Deshabilitar índices para ahorrar espacio."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "Los índices compuestos en campos clave (NIT + período fiscal) aceleran consultas sin sobrecargar el sistema (DAMA-DMBOK)."
  },
  {
    "id": "dsg-68",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Para diseñar un sistema de detección de fraude fiscal en tiempo real que procese 1M+ transacciones diarias con latencia <100ms, ¿qué arquitectura es viable considerando normativas DIAN?",
    "opciones": [
      "A. Microservicios con Kafka Streams + modelo de ML ops en edge computing.",
      "B. Monolito con base de datos relacional y triggers SQL.",
      "C. Procesamiento por lotes nocturnos con Hadoop."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "Kafka Streams permite procesamiento en tiempo real con baja latencia, y edge computing reduce carga en centros de datos. El Decreto 2242 exige validación inmediata de transacciones (Resolución 019 de 2016). ML ops facilita actualización continua de modelos antifraude."
  },
  {
    "id": "dsg-69",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Al implementar un data mesh para la DIAN, ¿qué principio contradiría el Decreto 2242 si no se gestiona adecuadamente?",
    "opciones": [
      "A. Autonomía de dominios sin gobernanza centralizada.",
      "B. Catalogación automatizada de metadatos.",
      "C. Contratos de datos estandarizados."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La autonomía absoluta de dominios puede violar el Decreto 2242 si no hay control centralizado sobre validación de facturas electrónicas. Se requiere equilibrio entre federación y gobernanza (DAMA-DMBOK)."
  },
  {
    "id": "dsg-70",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "¿Qué técnica de anonymización preservaría la utilidad analítica de datos de contribuyentes mientras cumple con BCBS 239 y GDPR?",
    "opciones": [
      "A. K-anonymity con supresión de outliers.",
      "B. Tokenización irreversible con preservación de distribuciones estadísticas.",
      "C. Enmascaramiento completo de todos los campos."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "La tokenización irreversible mantiene distribuciones para análisis agregados (BCBS 239) mientras protege identidades (GDPR). K-anonymity puede dejar vulnerabilidades, y el enmascaramiento completo destruye valor analítico."
  },
  {
    "id": "dsg-71",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "En una migración a Zero Trust Architecture para los sistemas de la DIAN, ¿qué componente es crítico para datos clasificados como 'Secreto Fiscal'?",
    "opciones": [
      "A. PEP (Policy Enforcement Point) con MFA basado en riesgo.",
      "B. Firewall perimetral tradicional.",
      "C. VPN con acceso completo una vez autenticado."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "Zero Trust exige PEPs que aplican autenticación continua (MFA basado en riesgo) para cada solicitud de acceso a datos sensibles, según NIST SP 800-207 y Manual de Seguridad DIAN."
  },
  {
    "id": "dsg-72",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Para garantizar compliance con BCBS 239 en reportes de riesgo fiscal, ¿qué característica debe tener un data warehouse?",
    "opciones": [
      "A. Lineage granular hasta nivel de campo con timestamped changes.",
      "B. Almacenamiento columnar sin historial de modificaciones.",
      "C. Particionamiento solo por entidad federada."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "BCBS 239 exige trazabilidad absoluta (lineage) de datos usados en reportes de riesgo. Los timestamped changes permiten reconstrucción forense de decisiones."
  },
  {
    "id": "dsg-73",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "¿Qué patrón de diseño resolvería el problema de inconsistencia en datos maestros de contribuyentes entre SIISCOMEX y RUT?",
    "opciones": [
      "A. Event Sourcing con stream processing para sincronización eventual.",
      "B. Copias independientes con reconciliación manual.",
      "C. Base de datos única sin redundancia."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "Event Sourcing garantiza consistencia eventual mediante flujos de eventos auditables, clave para sistemas distribuidos como SIISCOMEX y RUT (Patrón de Arquitectura Delta)."
  },
  {
    "id": "dsg-74",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Al diseñar un sistema para el nuevo impuesto a plásticos de un solo uso (Ley 2232 de 2022), ¿qué modelo de datos soportaría mejor la trazabilidad desde producción hasta declaración?",
    "opciones": [
      "A. Grafo de conocimiento con ontología industrial.",
      "B. Tablas relacionales normalizadas en 5FN.",
      "C. Documentos JSON anidados."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "Un grafo con ontología representa relaciones complejas (productor→distribuidor→declarante) mejor que modelos relacionales o documentales, permitiendo consultas transversales."
  },
  {
    "id": "dsg-75",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Para cumplir con el principio de 'Privacy by Design' en un sistema de fiscalización de la DIAN, ¿qué enfoque es inviable según GDPR?",
    "opciones": [
      "A. Pseudonimización con llaves gestionadas por el área de auditoría.",
      "B. Minimización de datos con retention policies automáticas.",
      "C. Procesamiento paralelo en múltiples jurisdicciones sin DPIAs."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "GDPR exige Data Protection Impact Assessments (DPIAs) para procesamiento transfronterizo. Las otras opciones son mejores prácticas de Privacy by Design."
  },
  {
    "id": "dsg-76",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "En la implementación de un sistema de análisis predictivo para evasión IVA, ¿qué problema ético podría surgir si no se gestiona el bias algorítmico?",
    "opciones": [
      "A. Discriminación involuntaria contra sectores económicos específicos.",
      "B. Mayor carga computacional en servidores.",
      "C. Reducción en la precisión de modelos estadísticos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El bias en ML puede perpetuar sesgos históricos (ej. focalizar auditorías en PYMEs), violando principios de equidad tributaria. Requiere técnicas como adversarial debiasing."
  },
  {
    "id": "dsg-77",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "¿Qué tecnología permitiría a la DIAN realizar joins entre datos aduaneros (SIISCOMEX) y tributarios sin replicación masiva?",
    "opciones": [
      "A. Virtualización de datos con query federation.",
      "B. ETL tradicional con almacenamiento centralizado.",
      "C. Replicación completa en data lake."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La virtualización (ej. Denodo) ejecuta queries federadas sobre sistemas origen, evitando replicación. Cumple con principios de minimización de datos (Ley 1581)."
  },
  {
    "id": "dsg-78",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Para garantizar non-repudiation en transacciones de facturación electrónica, ¿qué componente es esencial?",
    "opciones": [
      "A. Sellado de tiempo (RFC 3161) con autoridad certificadora.",
      "B. Hash criptográfico sin firma digital.",
      "C. Registro en base de datos relacional."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El sellado temporal (timestamping) con autoridad certificada prueba existencia e integridad de documentos en momento específico, requerido por Decreto 2242 para facturación."
  },
  {
    "id": "dsg-79",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "En un proyecto de DataOps para la DIAN, ¿qué práctica violaría el Manual de Seguridad de la entidad?",
    "opciones": [
      "A. Deployment automático de pipelines sin validación humana.",
      "B. Uso de contenedores efímeros para transformaciones.",
      "C. Monitoreo continuo de calidad con métricas."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El Manual de Seguridad DIAN exige controles humanos para despliegues en sistemas críticos (Cap. 5.2). DataOps debe adaptarse a normativas locales."
  },
  {
    "id": "dsg-80",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "¿Qué arquitectura soportaría mejor el análisis de grafos para detectar redes de evasión en declaraciones de renta?",
    "opciones": [
      "A. Neo4j con Apache Spark para procesamiento distribuido.",
      "B. Oracle RDBMS con índices bitmap.",
      "C. Data Warehouse tradicional con star schema."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "Neo4j es especializado en grafos, y Spark permite escalar análisis a millones de relaciones. RDBMS y star schemas son ineficientes para queries de conectividad."
  },
  {
    "id": "dsg-81",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Para implementar RBAC en el sistema de gestión tributaria, ¿qué modelo evitaría la proliferación de permisos?",
    "opciones": [
      "A. ABAC (Attribute-Based Access Control) con políticas dinámicas.",
      "B. Roles jerárquicos con herencia y separación de deberes.",
      "C. Asignación directa de permisos a usuarios."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Los roles jerárquicos con SoD (Separation of Duties) simplifican gestión y previenen conflictos (ej. mismo usuario no puede registrar y auditar). ABAC introduce complejidad innecesaria en este contexto."
  },
  {
    "id": "dsg-82",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "En la implementación de un data lake para la DIAN, ¿qué estrategia de metadata garantizaría compliance con BCBS 239?",
    "opciones": [
      "A. Catalogación automatizada con business glossary vinculado a términos regulatorios.",
      "B. Metadatos técnicos sin contexto semántico.",
      "C. Documentación offline en formatos no estructurados."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "BCBS 239 exige metadata que vincule datos con requisitos regulatorios. Un business glossary automatizado es clave para trazabilidad."
  },
  {
    "id": "dsg-83",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "¿Qué técnica de machine learning sería más efectiva para predecir errores en declaraciones de IVA, considerando datos desbalanceados?",
    "opciones": [
      "A. SMOTE + XGBoost con focal loss.",
      "B. Regresión logística sin ajuste.",
      "C. K-means clustering no supervisado."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "SMOTE balancea clases minoritarias (errores), y XGBoost con focal loss maneja desbalance. K-means no sirve para problemas supervisados, y logística sin ajuste tiene bajo recall."
  },
  {
    "id": "dsg-84",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Para diseñar un sistema de alertas tempranas de contrabando, ¿qué arquitectura combina mejor bajas latencias y análisis complejos?",
    "opciones": [
      "A. Lambda Architecture con capa speed (Flink) y batch (Spark).",
      "B. Kappa Architecture con procesamiento único por stream.",
      "C. Arquitectura monolítica con stored procedures."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "Kappa Architecture simplifica Lambda al usar solo stream processing (ej. Flink o Kafka Streams) para ambos escenarios, con stateful processing para análisis complejos."
  },
  {
    "id": "dsg-85",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Al implementar un sistema de reconciliación automática de pagos, ¿qué patrón garantiza idempotencia ante fallos de red?",
    "opciones": [
      "A. Transactional Outbox con patron Saga.",
      "B. Polling periódico sin manejo de duplicados.",
      "C. ACID en base de datos origen."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "Transactional Outbox + Saga maneja fallos distribuidos manteniendo idempotencia. ACID sola no resuelve integración entre sistemas, y el polling puede duplicar operaciones."
  },
  {
    "id": "dsg-86",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "¿Qué tecnología permitiría a la DIAN realizar análisis de sentiment en redes sociales para detección de subvaluación, cumpliendo GDPR?",
    "opciones": [
      "A. Procesamiento en-edge con federated learning.",
      "B. Scraping masivo sin consentimiento.",
      "C. Almacenamiento permanente de datos crudos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "Federated learning procesa datos descentralizadamente (en-edge), minimizando transferencia y almacenamiento de datos personales, cumpliendo GDPR. Scraping masivo viola privacidad."
  },
  {
    "id": "dsg-87",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "En una estrategia de multi-cloud para sistemas críticos de la DIAN, ¿qué componente es imprescindible según ISO 27001?",
    "opciones": [
      "A. Cifrado homomórfico para datos en tránsito entre nubes.",
      "B. Secret management unificado con rotación automática.",
      "C. Balanceadores de carga sin encriptación."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "ISO 27001 control A.9.2.1 exige gestión centralizada de credenciales con rotación periódica en entornos multi-cloud. El cifrado homomórfico es aún experimental para producción."
  },
  {
    "id": "dsg-88",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "En un proyecto para la integración de datos tributarios y aduaneros, ¿qué componente de la arquitectura de datos se debe priorizar para garantizar la eficiencia del proceso?",
    "opciones": [
      "A. El modelo de datos relacional, que facilita la estructura y relación entre los datos.",
      "B. El almacén de datos (Data Warehouse), que centraliza y optimiza el análisis de grandes volúmenes de datos.",
      "C. El sistema de gestión de bases de datos (DBMS), que administra la almacenamiento y recuperación de datos."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El Data Warehouse es esencial para consolidar los datos de distintas fuentes en un repositorio centralizado, permitiendo un análisis eficiente, lo que es clave para la integración de datos en la DIAN."
  },
  {
    "id": "dsg-89",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Un equipo de trabajo ha decidido aplicar el enfoque de ETL para integrar datos de contribuyentes desde diversas fuentes. ¿Qué aspecto debe asegurarse en el proceso de Transformación?",
    "opciones": [
      "A. Que los datos se almacenen en su formato original para evitar modificaciones.",
      "B. Que los datos sean transformados en formatos estandarizados y se validen contra reglas de calidad antes de su carga.",
      "C. Que los datos se omitan si no cumplen con los criterios de calidad establecidos."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "En el proceso de Transformación de ETL, los datos deben ser estandarizados y validados contra las reglas de calidad para asegurar su integridad y consistencia antes de ser cargados en el sistema final."
  },
  {
    "id": "dsg-90",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "En el contexto de la DIAN, ¿cuál es la principal ventaja de utilizar un Lago de Datos (Data Lake) en lugar de un Data Warehouse para almacenar grandes volúmenes de datos no estructurados?",
    "opciones": [
      "A. Los Data Lakes permiten almacenar datos estructurados, semi-estructurados y no estructurados, facilitando el análisis posterior.",
      "B. Los Data Lakes son más fáciles de integrar con sistemas de gestión de bases de datos tradicionales.",
      "C. Los Data Lakes no requieren procedimientos de limpieza ni validación de los datos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "Los Data Lakes son ideales para almacenar datos no estructurados y semi-estructurados, lo que permite a la DIAN integrar una variedad de fuentes de datos de diferentes tipos antes de realizar un análisis más detallado."
  },
  {
    "id": "dsg-91",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "En el proceso de diseño de una solución de gestión de datos para la DIAN, ¿qué estándar se debe aplicar para asegurar la interoperabilidad entre sistemas de la DIAN y otras entidades gubernamentales?",
    "opciones": [
      "A. Estándares de ISO 27001, que regula la seguridad de la información.",
      "B. Estándares de ISO 8000, que establece buenas prácticas en la calidad de los datos.",
      "C. Estándares de interoperabilidad de datos, como los definidos en el marco de Gobierno Digital del MinTIC."
    ],
    "respuesta_correcta_index": 2,
    "explicacion": "La interoperabilidad entre sistemas exige el cumplimiento de estándares de interoperabilidad de datos como los establecidos en el marco de Gobierno Digital del MinTIC, permitiendo el intercambio y la comprensión adecuada de los datos entre entidades."
  },
  {
    "id": "dsg-92",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "La DIAN decide implementar un modelo de gobernanza de datos para asegurar la calidad y seguridad de sus datos tributarios. ¿Qué principio debe ser aplicado al gestionar el acceso y uso de los datos?",
    "opciones": [
      "A. El principio de responsabilidad y transparencia, donde se asignan roles claros para el acceso y uso de los datos.",
      "B. El principio de centralización, donde todos los datos deben ser accesibles desde una única plataforma.",
      "C. El principio de flexibilidad, donde los usuarios pueden modificar los datos según sea necesario para su análisis."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El principio de responsabilidad y transparencia es fundamental en la gobernanza de datos. Asegura que el acceso a los datos esté claramente definido y auditado, lo que ayuda a mantener la seguridad y calidad en su uso."
  },
  {
    "id": "dsg-93",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "En la implementación de un sistema de gestión de bases de datos (DBMS) para la DIAN, ¿qué aspecto debe ser considerado al seleccionar el modelo de datos adecuado?",
    "opciones": [
      "A. El modelo de datos debe ser relacional, para garantizar consultas rápidas y precisas de los registros tributarios.",
      "B. El modelo de datos debe ser jerárquico, para facilitar la visualización de los registros en forma de árbol.",
      "C. El modelo de datos debe ser no relacional, ya que se necesita mayor flexibilidad para almacenar grandes volúmenes de datos no estructurados."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El modelo relacional es ampliamente utilizado en la gestión de datos tributarios y aduaneros, pues permite estructurar la información en tablas interconectadas, lo que facilita las consultas y la integridad de los datos."
  },
  {
    "id": "dsg-94",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "En el contexto de la DIAN, ¿qué herramienta es más adecuada para automatizar el proceso de carga y transformación de datos provenientes de múltiples fuentes externas e internas?",
    "opciones": [
      "A. Una plataforma ETL (Extract, Transform, Load) que permita la automatización del proceso de integración de datos.",
      "B. Un sistema de gestión de bases de datos relacional (RDBMS) para almacenar los datos sin necesidad de transformación.",
      "C. Una herramienta de business intelligence (BI) para realizar los análisis, sin procesar previamente los datos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "Las plataformas ETL (Extract, Transform, Load) son esenciales para la automated data integration, permitiendo transformar y cargar datos de diferentes fuentes en un almacén de datos centralizado para su posterior análisis."
  },
  {
    "id": "dsg-95",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Un sistema de auditoría fiscal requiere integrar datos de contribuyentes de diferentes bases de datos, con distintos formatos y estructuras. ¿Qué solución de gestión de datos debe aplicarse para asegurar que la información se unifique correctamente?",
    "opciones": [
      "A. Implementar un proceso de ETL (Extract, Transform, Load) para limpiar, transformar y cargar los datos en un almacén de datos común.",
      "B. Usar un sistema de business intelligence (BI) para realizar los análisis sin necesidad de estandarizar los datos.",
      "C. Cargar directamente los datos desde los sistemas originales sin realizar ningún proceso intermedio."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El proceso ETL es clave para la integración de datos, ya que permite transformar y estandarizar datos provenientes de diferentes fuentes antes de almacenarlos en un repositorio centralizado, asegurando calidad y consistencia."
  },
  {
    "id": "dsg-96",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "En la DIAN, se requiere implementar una solución para almacenar grandes volúmenes de datos de contribuyentes, que incluyen información no estructurada (archivos, correos electrónicos). ¿Qué tipo de sistema de almacenamiento es más adecuado?",
    "opciones": [
      "A. Utilizar un Lago de Datos (Data Lake) que permita almacenar tanto datos estructurados como no estructurados de manera flexible.",
      "B. Usar un Data Warehouse tradicional, que solo es adecuado para datos estructurados.",
      "C. Implementar un sistema de almacenamiento en la nube sin establecer políticas de seguridad claras."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "Un Lago de Datos permite almacenar grandes volúmenes de datos en diversos formatos, tanto estructurados como no estructurados, lo que es ideal para la diversidad de datos que maneja la DIAN."
  },
  {
    "id": "dsg-97",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "En la DIAN, se implementa un sistema de gobernanza de datos para gestionar los datos de contribuyentes. ¿Qué principio debe aplicarse para garantizar que el acceso a estos datos sea adecuado y conforme a la normativa?",
    "opciones": [
      "A. El principio de responsabilidad sobre el dato, donde se asignan roles y permisos claros para el acceso a los datos.",
      "B. El principio de acceso ilimitado, que permite que todos los usuarios accedan a los datos sin restricciones.",
      "C. El principio de automatización, donde los datos son procesados sin intervención humana."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El principio de responsabilidad sobre el dato asegura que solo los usuarios autorizados puedan acceder a ciertos datos, lo que es fundamental para la seguridad y el cumplimiento normativo."
  },
  {
    "id": "dsg-98",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "La DIAN decide actualizar su arquitectura de datos para mejorar la integración de datos tributarios y aduaneros. ¿Qué componente debe revisarse primero para asegurar la eficiencia del nuevo diseño?",
    "opciones": [
      "A. La interoperabilidad de los sistemas existentes con la nueva infraestructura de datos.",
      "B. El tipo de soporte técnico disponible para el personal que gestionará el sistema.",
      "C. La cantidad de almacenamiento disponible para la nueva base de datos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La interoperabilidad entre los sistemas existentes y la nueva infraestructura es crucial para asegurar una integración fluida y eficiente de los datos tributarios y aduaneros, lo que mejora la calidad del análisis y la toma de decisiones."
  },
  {
    "id": "dsg-99",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Un equipo de trabajo desea mejorar la seguridad de los datos de contribuyentes que almacenan en un sistema de gestión de bases de datos. ¿Qué estándar debe seguir para garantizar la protección de estos datos?",
    "opciones": [
      "A. Implementar ISO 27001, que regula la seguridad de la información.",
      "B. Utilizar estándares de ISO 9001 relacionados con la calidad del servicio.",
      "C. Implementar políticas de acceso libre a los datos para todos los usuarios autorizados."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La norma ISO 27001 establece un marco para gestionar la seguridad de la información, lo que garantiza la protección y confidencialidad de los datos sensibles en la DIAN."
  },
  {
    "id": "dsg-100",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "La DIAN necesita migrar datos históricos de contribuyentes a un nuevo sistema. ¿Qué enfoque de gestión de datos debe aplicarse para garantizar la calidad y consistencia durante la migración?",
    "opciones": [
      "A. Utilizar ETL para extraer, transformar y cargar los datos a la nueva plataforma asegurando calidad y consistencia.",
      "B. Realizar la migración sin realizar transformaciones de los datos para mantener su originalidad.",
      "C. Realizar la migración de forma manual para evitar errores automáticos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El proceso ETL es esencial para garantizar que los datos sean correctamente transformados y validados antes de ser cargados en la nueva plataforma, asegurando su consistencia y calidad."
  },
  {
    "id": "dsg-101",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "La DIAN decide implementar un nuevo sistema de facturación electrónica para contribuyentes. ¿Qué componente debe ser prioritario en el diseño de esta solución?",
    "opciones": [
      "A. Asegurar que el sistema sea compatible con los estándares de interoperabilidad establecidos en el Decreto 2242 de 2015.",
      "B. Garantizar que el sistema esté disponible sin conexión a internet para garantizar su accesibilidad.",
      "C. Fomentar la digitalización del sistema solo en el aspecto administrativo sin involucrar las auditorías fiscales."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El Decreto 2242 de 2015 establece los estándares técnicos y operacionales para la implementación de la facturación electrónica. La interoperabilidad es crucial para garantizar que el sistema esté alineado con otros sistemas nacionales e internacionales."
  },
  {
    "id": "dsg-102",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Un sistema de gestión de datos para la DIAN debe ser capaz de procesar grandes volúmenes de transacciones aduaneras. ¿Qué característica es clave para asegurar que el sistema sea escalable?",
    "opciones": [
      "A. El sistema debe poder manejar un crecimiento de volumen de datos sin afectar el rendimiento, utilizando una arquitectura distribuida.",
      "B. El sistema debe limitar la cantidad de datos procesados mensualmente para evitar sobrecarga.",
      "C. El sistema debe contar con un único servidor central para controlar todos los procesos de datos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "Una arquitectura distribuida permite que el sistema maneje el crecimiento del volumen de datos de manera eficiente, garantizando escalabilidad y rendimiento continuo."
  },
  {
    "id": "dsg-103",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "La DIAN debe integrar datos de contribuyentes con diferentes sistemas externos. ¿Qué estándar de interoperabilidad se debe seguir para garantizar un intercambio eficiente y seguro de datos?",
    "opciones": [
      "A. Los datos deben seguir el estándar OGD (Open Government Data) para garantizar la reutilización de la información.",
      "B. Los datos deben cumplir con el ISO 27001 para asegurar la seguridad de la información en el intercambio.",
      "C. Los datos deben ser convertidos a CSV para su integración en plataformas externas."
    ],
    "respuesta_correcta_index": 1,
    "explicacion": "El ISO 27001 es el estándar internacional para gestionar la seguridad de la información, asegurando que los datos intercambiados sean protegidos y tratados de manera adecuada."
  },
  {
    "id": "dsg-104",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "En el proceso de modelado de datos para la DIAN, ¿qué técnica es más adecuada para organizar la información de los contribuyentes y asegurar su fácil acceso?",
    "opciones": [
      "A. El uso de modelos relacionales, con tablas interconectadas para organizar y acceder fácilmente a los datos.",
      "B. La creación de modelos jerárquicos, con una estructura en árbol para clasificar los contribuyentes.",
      "C. La implementación de modelos no relacionales, para almacenar los datos en formato no estructurado."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El modelo relacional es el más adecuado para organizar datos interrelacionados, como los registros tributarios de los contribuyentes, lo que facilita su acceso, consulta y gestión."
  },
  {
    "id": "dsg-105",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Al diseñar un sistema para almacenar datos de aduanas, ¿qué debe garantizarse respecto a la seguridad de la información?",
    "opciones": [
      "A. Se debe garantizar que los datos sean encriptados, que los accesos sean controlados y que se cumpla con la política de protección de datos personales.",
      "B. Se debe permitir el acceso libre a todos los funcionarios de la DIAN para mejorar la eficiencia del proceso.",
      "C. Se debe almacenar los datos en un sistema centralizado sin aplicar medidas de seguridad adicionales."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La seguridad de los datos es crucial, especialmente para la protección de datos personales y sensibles. Los datos deben estar encriptados, y el acceso debe ser restringido según roles, conforme a la Ley 1581 de 2012."
  },
  {
    "id": "dsg-106",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Para mejorar la eficiencia en la gestión de datos tributarios, la DIAN implementa un Data Warehouse. ¿Qué ventaja clave aporta esta solución?",
    "opciones": [
      "A. Facilita el análisis de datos históricos y la creación de reportes complejos de manera rápida y precisa.",
      "B. Permite la integración en tiempo real de los datos de contribuyentes con otras entidades.",
      "C. Reduce el volumen de datos almacenados para cumplir con las normativas de seguridad."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "Un Data Warehouse es esencial para consolidar y optimizar el análisis de grandes volúmenes de datos históricos, lo que facilita la toma de decisiones estratégicas y la generación de reportes complejos."
  },
  {
    "id": "dsg-107",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Al diseñar un sistema de facturación electrónica en la DIAN, ¿qué componente del sistema es esencial para garantizar la interoperabilidad con otras plataformas gubernamentales?",
    "opciones": [
      "A. El sistema debe utilizar estándares de interoperabilidad, como los definidos en el marco de Gobierno Digital.",
      "B. El sistema debe permitir la importación de datos desde plataformas externas sin validación previa.",
      "C. El sistema debe ser capaz de exportar datos sin importar el formato o estructura."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La interoperabilidad es clave para el éxito de la facturación electrónica. El uso de estándares de interoperabilidad establecidos en el marco de Gobierno Digital garantiza que el sistema pueda integrarse correctamente con otras plataformas gubernamentales."
  },
  {
    "id": "dsg-108",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Al integrar datos de facturación electrónica de contribuyentes, ¿qué es necesario para asegurar que los datos sean consistentes y estén listos para el análisis?",
    "opciones": [
      "A. Los datos deben ser transformados y limpiados para cumplir con los estándares de calidad antes de ser cargados en el sistema de análisis.",
      "B. Los datos deben ser enviados directamente al repositorio sin validación previa para acelerar el proceso.",
      "C. Los datos deben ser validados por los contribuyentes antes de su integración en el sistema de análisis."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El proceso de transformación y limpieza de datos es crucial para garantizar que los datos sean precisos, consistentes y adecuados para análisis y toma de decisiones."
  },
  {
    "id": "dsg-109",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Al implementar un sistema de gestión de datos tributarios, ¿qué componente es necesario para asegurar la accesibilidad de los datos por parte de los usuarios autorizados?",
    "opciones": [
      "A. Implementar un sistema de gestión de identidades y acceso (IAM) que controle y audite el acceso a los datos.",
      "B. Garantizar que todos los datos sean accesibles sin restricciones para mejorar la eficiencia operativa.",
      "C. Almacenar los datos en formato físico para evitar problemas de acceso electrónico."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El gestor de identidades y acceso (IAM) es fundamental para controlar y auditar quién puede acceder a los datos, lo que garantiza la seguridad y cumplimiento normativo."
  },
  {
    "id": "dsg-110",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Un funcionario plantea implementar un sistema de datos abiertos para mejorar la transparencia. ¿Qué política debe seguirse para cumplir con las normativas de protección de datos personales?",
    "opciones": [
      "A. Los datos deben ser anonimizados o desidentificados antes de su publicación para proteger la privacidad.",
      "B. Los datos deben ser publicados sin restricción para facilitar el acceso público.",
      "C. Los datos deben ser almacenados en un Data Warehouse y no deben ser accesibles públicamente."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La anonimización o desidentificación de los datos personales es esencial para garantizar que la publicación de datos abiertos cumpla con la Ley 1581 de 2012 sobre protección de datos personales."
  },
  {
    "id": "dsg-111",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Para asegurar la calidad de los datos utilizados en los procesos de auditoría fiscal, ¿qué acción debe realizar el Gestor II?",
    "opciones": [
      "A. Implementar un sistema de validación de calidad de datos en cada punto del ciclo de vida del dato.",
      "B. Confiar en los datos generados por los contribuyentes sin validación adicional.",
      "C. Realizar auditorías mensuales solo al finalizar el año fiscal."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La validación continua de calidad de los datos es esencial para garantizar que los datos utilizados en los procesos de auditoría sean precisos, completos y confiables."
  },
  {
    "id": "dsg-112",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Al diseñar una solución para la gestión de datos aduaneros, ¿qué característica del sistema es clave para asegurar su eficiencia en la transparencia y trazabilidad?",
    "opciones": [
      "A. Implementar un sistema de linaje de datos que rastree el origen y movimiento de los datos a lo largo del sistema.",
      "B. Utilizar un sistema de almacenamiento en nubes privadas para reducir costos operativos.",
      "C. Eliminar el linaje de los datos para facilitar su procesamiento rápido."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El linaje de datos permite rastrear el origen y el recorrido de los datos en el sistema, lo que es esencial para garantizar la transparencia y la trazabilidad de las operaciones aduaneras."
  },
  {
    "id": "dsg-113",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Un sistema de gestión de datos en la DIAN debe cumplir con la normativa de protección de datos personales. ¿Qué acción debe tomarse para cumplir con el Decreto 2242 de 2015 y la Ley 1581 de 2012?",
    "opciones": [
      "A. Implementar un sistema de encriptación de datos y control de accesos basado en roles.",
      "B. Permitir el acceso libre a los datos fiscales para los funcionarios de la DIAN.",
      "C. Almacenar los datos de los contribuyentes solo en formato físico."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "El encriptado de datos y el control de acceso basado en roles son medidas clave para cumplir con las normativas de protección de datos y garantizar la seguridad de la información personal de los contribuyentes."
  },
  {
    "id": "dsg-114",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Para asegurar que los datos tributarios sean accesibles y procesables, ¿qué tipo de estructura de almacenamiento es más adecuada para la DIAN?",
    "opciones": [
      "A. Utilizar un almacén de datos relacional para facilitar consultas rápidas y organizadas.",
      "B. Usar almacenamiento en la nube sin estructuras definidas para flexibilidad.",
      "C. Almacenar los datos solo en archivos Excel para evitar complejidad."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "Un almacén de datos relacional organiza los datos de manera eficiente, lo que facilita las consultas rápidas y asegura la integridad y accesibilidad de los datos fiscales en la DIAN."
  },

  {
    "id": "dsg-114",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "La DIAN necesita integrar datos de facturas electrónicas y declaraciones de renta en DataR para auditorías fiscales, pero los sistemas fuente tienen formatos heterogéneos (XML, JSON, CSV). Como Gestor II, ¿qué estrategia recomiendas para garantizar la interoperabilidad?",
    "opciones": [
      "A. Implementar un proceso ETL que normalice los datos a un formato relacional antes de cargarlos en DataR.",
      "B. Almacenar los datos en su formato nativo en un lago de datos sin transformación previa.",
      "C. Usar una API para consultar datos directamente desde los sistemas fuente sin integración."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La opción A es correcta porque un proceso ETL (Extract, Transform, Load) normaliza datos heterogéneos (XML, JSON, CSV) a un formato relacional, asegurando interoperabilidad y consistencia en DataR, conforme al marco DAMA-DMBOK y la Arquitectura Digital de la DIAN. La opción B, aunque flexible, dificulta consultas estructuradas, y la opción C no garantiza la integración centralizada requerida para auditorías, según el Decreto 927 de 2023."
},
{
    "id": "dsg-115",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Durante una auditoría fiscal en la DIAN, se detecta que los datos de transacciones en DataR tienen duplicados, afectando la integridad. ¿Qué acción debería tomar el Gestor II para resolver este problema?",
    "opciones": [
      "A. Diseñar un proceso ETL con una etapa de deduplicación basada en claves primarias y hash.",
      "B. Eliminar todos los datos duplicados manualmente para evitar errores.",
      "C. Ignorar los duplicados, ya que no afectan los reportes finales."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La opción A es correcta porque un proceso ETL con deduplicación utiliza claves primarias y funciones hash para identificar y eliminar duplicados, garantizando la integridad de datos en DataR, según el Manual de Políticas de Seguridad de la DIAN. La opción B es ineficiente para grandes volúmenes de datos, y la opción C compromete la calidad de los reportes, incumpliendo el Decreto 927 de 2023."
},
{
    "id": "dsg-116",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "La DIAN implementa un lago de datos para almacenar facturas electrónicas históricas. El Gestor II debe garantizar que los datos sean accesibles para auditorías durante 10 años, pero con costos optimizados. ¿Qué diseño recomienda?",
    "opciones": [
      "A. Usar almacenamiento en frío para datos de más de 2 años, con acceso bajo demanda.",
      "B. Replicar todos los datos en tres zonas geográficas para alta disponibilidad.",
      "C. Eliminar datos después de 5 años para reducir costos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La opción A es correcta porque el almacenamiento en frío (ej., AWS S3 Glacier) reduce costos para datos históricos mientras mantiene accesibilidad para auditorías, cumpliendo el artículo 632 del Estatuto Tributario (retención por 5-10 años). La opción B aumenta costos innecesariamente, y la opción C viola normativas de retención, según el Decreto 927 de 2023."
},
{
    "id": "dsg-117",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Un sistema de la DIAN genera reportes lentos debido a consultas en DataR con un volumen de 10 millones de facturas electrónicas. ¿Qué solución de diseño propone el Gestor II para mejorar el rendimiento?",
    "opciones": [
      "A. Crear índices en las columnas usadas en las condiciones WHERE y JOIN de las consultas.",
      "B. Migrar todos los datos a una base de datos NoSQL para mayor flexibilidad.",
      "C. Aumentar la capacidad de almacenamiento para soportar más datos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La opción A es correcta porque los índices optimizan consultas SQL en columnas de búsqueda y unión, mejorando el rendimiento en DataR, según las mejores prácticas de DAMA-DMBOK. La opción B no garantiza mejor rendimiento para consultas estructuradas, y la opción C no aborda la causa del problema, según la Arquitectura Digital de la DIAN."
},
{
    "id": "dsg-118",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Para cumplir con la Ley 1581 de 2012 sobre protección de datos personales en DataR, el Gestor II debe diseñar una solución que garantice la confidencialidad. ¿Qué medida es más adecuada?",
    "opciones": [
      "A. Implementar enmascaramiento de datos en campos sensibles como NIT y nombres.",
      "B. Almacenar todos los datos en texto plano para facilitar consultas.",
      "C. Limitar el acceso a DataR solo a usuarios externos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La opción A es correcta porque el enmascaramiento de datos protege información personal (NIT, nombres) sin afectar su uso en reportes, cumpliendo la Ley 1581 de 2012 y el estándar ISO 27001. La opción B expone datos sensibles, y la opción C restringe el acceso interno necesario para auditorías, según el Manual de Políticas de Seguridad de la DIAN."
},
{
    "id": "dsg-119",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "La DIAN requiere integrar datos de facturación electrónica (XML UBL 2.1) con declaraciones de renta en DataR. El Gestor II detecta que los datos XML tienen estructuras inconsistentes. ¿Qué solución propone?",
    "opciones": [
      "A. Diseñar un proceso ELT que cargue los datos XML y los transforme en DataR.",
      "B. Convertir todos los datos XML a CSV antes de cargarlos.",
      "C. Rechazar los datos XML inconsistentes sin procesarlos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La opción A es correcta porque un proceso ELT (Extract, Load, Transform) carga datos XML en DataR y los transforma para garantizar consistencia, según el estándar UBL 2.1 y el Decreto 2242 de 2015. La opción B pierde metadatos del XML, y la opción C descarta datos válidos, afectando auditorías, según la Resolución 067 de 2024."
},
{
    "id": "dsg-120",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "En DataR, un proceso ETL tarda demasiado en cargar datos de facturas electrónicas debido a un volumen de 50 millones de registros. ¿Qué optimización recomienda el Gestor II?",
    "opciones": [
      "A. Implementar particionamiento de tablas por fecha de emisión en DataR.",
      "B. Aumentar la capacidad de almacenamiento en el servidor.",
      "C. Ejecutar el ETL en una base de datos NoSQL."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La opción A es correcta porque el particionamiento de tablas por fecha reduce el tiempo de procesamiento al limitar las consultas a subconjuntos de datos, según DAMA-DMBOK. La opción B no mejora el rendimiento del ETL, y la opción C no es adecuada para datos estructurados de facturas, según la Arquitectura Digital de la DIAN."
},
{
    "id": "dsg-121",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "La DIAN necesita rastrear el origen de datos en DataR para una auditoría tributaria. ¿Qué diseño asegura el linaje de datos?",
    "opciones": [
      "A. Implementar un sistema de metadatos que registre el origen y transformaciones de los datos.",
      "B. Almacenar todos los datos en un solo archivo para facilitar el rastreo.",
      "C. Usar una base de datos NoSQL sin metadatos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La opción A es correcta porque un sistema de metadatos registra el linaje de datos, desde su origen hasta su uso, cumpliendo con las políticas de Gobernanza de Datos de la DIAN (Resolución 067 de 2024). La opción B complica el rastreo, y la opción C no garantiza trazabilidad, según DAMA-DMBOK."
},
{
    "id": "dsg-122",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "El Gestor II debe diseñar una solución para garantizar la escalabilidad de DataR ante un aumento de facturas electrónicas. ¿Qué estrategia es más adecuada?",
    "opciones": [
      "A. Usar una base de datos relacional con particionamiento horizontal y sharding.",
      "B. Almacenar los datos en archivos CSV en la nube.",
      "C. Limitar el almacenamiento a datos del último año."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La opción A es correcta porque el particionamiento horizontal y sharding distribuyen los datos para manejar grandes volúmenes, asegurando escalabilidad, según la Arquitectura Digital de la DIAN. La opción B no soporta consultas complejas, y la opción C viola el artículo 632 del Estatuto Tributario (retención de 5-10 años)."
},
{
    "id": "dsg-123",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Para cumplir con el estándar ISO 27001, la DIAN debe proteger datos sensibles en DataR. ¿Qué diseño propone el Gestor II?",
    "opciones": [
      "A. Implementar cifrado de datos en reposo y en tránsito.",
      "B. Almacenar datos en texto plano para facilitar auditorías.",
      "C. Restringir el acceso a DataR a un solo usuario."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La opción A es correcta porque el cifrado de datos en reposo y en tránsito protege la confidencialidad, cumpliendo con ISO 27001 y el Manual de Políticas de Seguridad de la DIAN. La opción B expone datos sensibles, y la opción C limita la operatividad, incumpliendo las necesidades de auditoría."
},
{
    "id": "dsg-124",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Un proceso ETL en DataR genera errores al cargar datos de facturas electrónicas debido a valores nulos en campos obligatorios. ¿Qué solución propone el Gestor II?",
    "opciones": [
      "A. Diseñar una etapa de validación en el ETL para rechazar registros con valores nulos.",
      "B. Permitir valores nulos en todos los campos para evitar errores.",
      "C. Eliminar los campos obligatorios del modelo de datos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La opción A es correcta porque una etapa de validación en el ETL rechaza registros con valores nulos, asegurando la integridad de datos en DataR, según el Decreto 927 de 2023. La opción B compromete la calidad de los datos, y la opción C viola el estándar UBL 2.1 para facturas electrónicas."
},
{
    "id": "dsg-125",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "La DIAN necesita un sistema para integrar datos de contribuyentes desde múltiples fuentes externas. ¿Qué diseño asegura una visión 360° del contribuyente?",
    "opciones": [
      "A. Implementar un modelo de datos relacional con una tabla central de contribuyentes y relaciones foráneas.",
      "B. Almacenar los datos en archivos JSON sin un modelo unificado.",
      "C. Usar una base de datos NoSQL para todos los datos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La opción A es correcta porque un modelo relacional con una tabla central y relaciones foráneas unifica los datos de contribuyentes, facilitando una visión 360°, según DAMA-DMBOK. La opción B dificulta la integración, y la opción C no garantiza relaciones estructuradas, según la Arquitectura Digital de la DIAN."
},
{
    "id": "dsg-126",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Para cumplir con la Resolución 000165 de 2023 sobre facturación electrónica, el Gestor II debe diseñar un sistema que valide XML UBL 2.1. ¿Qué solución propone?",
    "opciones": [
      "A. Implementar un esquema de validación XML en el proceso ETL antes de cargar datos en DataR.",
      "B. Cargar los datos XML sin validación para agilizar el proceso.",
      "C. Convertir los XML a texto plano antes de procesarlos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La opción A es correcta porque un esquema de validación XML asegura que los datos cumplan con el estándar UBL 2.1, según la Resolución 000165 de 2023. La opción B compromete la integridad, y la opción C pierde metadatos esenciales, incumpliendo el Decreto 2242 de 2015."
},
{
    "id": "dsg-127",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "El Gestor II detecta que los reportes en DataR son inconsistentes debido a datos desactualizados. ¿Qué diseño mejora la calidad de los datos?",
    "opciones": [
      "A. Implementar un proceso de gobernanza de datos con actualizaciones periódicas automatizadas.",
      "B. Permitir que los usuarios editen los datos manualmente.",
      "C. Eliminar los datos desactualizados sin reemplazo."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La opción A es correcta porque la gobernanza de datos con actualizaciones automatizadas asegura la calidad y consistencia, según el Manual de Políticas de Seguridad de la DIAN. La opción B introduce errores humanos, y la opción C elimina datos necesarios para auditorías, según el Decreto 927 de 2023."
},
{
    "id": "dsg-128",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "La DIAN necesita un sistema para procesar 100 millones de facturas electrónicas al mes. ¿Qué diseño asegura escalabilidad y rendimiento?",
    "opciones": [
      "A. Usar un lago de datos con particionamiento por mes y consultas optimizadas en SQL.",
      "B. Almacenar los datos en una base de datos relacional sin particionamiento.",
      "C. Usar una base de datos NoSQL para todas las facturas."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La opción A es correcta porque un lago de datos con particionamiento por mes reduce el tiempo de consulta y soporta grandes volúmenes, según DAMA-DMBOK. La opción B no es escalable para 100 millones de registros, y la opción C complica consultas estructuradas, según la Arquitectura Digital de la DIAN."
},
{
    "id": "dsg-129",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Para cumplir con el GDPR en el tratamiento de datos personales en DataR, ¿qué diseño propone el Gestor II?",
    "opciones": [
      "A. Implementar anonimización de datos personales antes de cargarlos en DataR.",
      "B. Almacenar datos personales en texto plano para auditorías.",
      "C. Limitar el acceso a DataR solo a usuarios internos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La opción A es correcta porque la anonimización protege datos personales, cumpliendo con el GDPR y la Ley 1581 de 2012. La opción B expone datos sensibles, y la opción C no aborda el tratamiento de datos, según el Manual de Políticas de Seguridad de la DIAN."
},
{
    "id": "dsg-130",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Un proceso ETL en DataR falla al cargar datos de declaraciones de renta debido a formatos inconsistentes. ¿Qué solución propone el Gestor II?",
    "opciones": [
      "A. Diseñar un esquema de transformación que estandarice los formatos antes de cargar.",
      "B. Cargar los datos sin transformación para evitar retrasos.",
      "C. Rechazar todas las declaraciones con formatos inconsistentes."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La opción A es correcta porque un esquema de transformación estandariza los datos, asegurando consistencia en DataR, según el Decreto 927 de 2023. La opción B compromete la calidad de los datos, y la opción C descarta datos válidos, afectando auditorías."
},
{
    "id": "dsg-131",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "La DIAN necesita auditar facturas electrónicas de 5 años atrás. ¿Qué diseño asegura el acceso eficiente a estos datos históricos?",
    "opciones": [
      "A. Usar almacenamiento en frío con un sistema de recuperación optimizado para auditorías.",
      "B. Mantener todos los datos en almacenamiento en caliente para acceso inmediato.",
      "C. Eliminar los datos históricos para reducir costos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La opción A es correcta porque el almacenamiento en frío con recuperación optimizada reduce costos y asegura acceso para auditorías, cumpliendo el artículo 632 del Estatuto Tributario. La opción B es costosa, y la opción C viola normativas de retención."
},
{
    "id": "dsg-132",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "El Gestor II debe diseñar un sistema para garantizar la trazabilidad de datos en DataR. ¿Qué solución propone?",
    "opciones": [
      "A. Implementar un sistema de metadatos con linaje de datos automatizado.",
      "B. Usar una base de datos sin metadatos para simplificar el diseño.",
      "C. Almacenar los datos en archivos CSV con nombres descriptivos."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La opción A es correcta porque un sistema de metadatos con linaje automatizado registra el origen y transformaciones de los datos, asegurando trazabilidad, según la Resolución 067 de 2024. La opción B no permite rastreo, y la opción C es ineficiente para auditorías."
},
{
    "id": "dsg-133",
    "tema": "Diseño de Soluciones de Gestión de Datos",
    "pregunta": "Para integrar datos de contribuyentes en DataR desde sistemas externos con APIs, ¿qué diseño asegura la interoperabilidad?",
    "opciones": [
      "A. Implementar un middleware que estandarice los datos de las APIs en un formato relacional.",
      "B. Almacenar los datos de las APIs directamente en DataR sin transformación.",
      "C. Limitar la integración a datos de una sola fuente externa."
    ],
    "respuesta_correcta_index": 0,
    "explicacion": "La opción A es correcta porque un middleware estandariza los datos de APIs, asegurando interoperabilidad y consistencia en DataR, según DAMA-DMBOK. La opción B introduce inconsistencias, y la opción C limita la visión 360° del contribuyente, incumpliendo las funciones del Gestor II."
},
{
  "id": "dsg-134",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "La DIAN desea integrar datos de contribuyentes desde múltiples fuentes en tiempo real, incluyendo datos tributarios, aduaneros y de facturación electrónica. ¿Qué diseño arquitectónico garantiza la escalabilidad y disponibilidad en este proceso?",
  "opciones": [
    "A. Implementar una arquitectura basada en **microservicios** que permita escalar y gestionar cada fuente de datos de forma independiente.",
    "B. Utilizar un **Data Warehouse tradicional** que centralice todos los datos de forma estática.",
    "C. Depender de un único servidor que almacene todas las fuentes de datos para minimizar los costos operativos."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La opción A es correcta, ya que una arquitectura de **microservicios** permite la **escalabilidad** y flexibilidad necesarias para integrar fuentes de datos en tiempo real, algo fundamental para la DIAN con sus grandes volúmenes de datos. Las opciones B y C son menos eficientes en cuanto a escalabilidad y disponibilidad."
},
{
  "id": "dsg-135",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "En un proceso de **integración de datos** aduaneros, la DIAN debe garantizar la **seguridad** de los datos durante su transferencia. ¿Qué estrategia debería aplicarse para asegurar esta seguridad?",
  "opciones": [
    "A. Utilizar **cifrado SSL/TLS** durante la transferencia de los datos para garantizar su confidencialidad e integridad.",
    "B. Transferir los datos sin cifrado, ya que la seguridad de los servidores internos es suficiente.",
    "C. Almacenar los datos de manera local en los sistemas de origen sin ningún protocolo de seguridad durante su transferencia."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El uso de **cifrado SSL/TLS** es una práctica recomendada para asegurar la **confidencialidad** e **integridad** de los datos durante su transferencia, protegiendo así la información sensible en cumplimiento de normativas de seguridad."
},
{
  "id": "dsg-136",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "En el diseño de un sistema ETL para la DIAN, se planea transformar grandes volúmenes de datos de contribuyentes. ¿Qué enfoque debe seguir el Gestor II para optimizar el proceso y evitar una sobrecarga del sistema?",
  "opciones": [
    "A. Aplicar **procesamiento paralelo** para dividir las tareas de transformación en múltiples hilos de ejecución, mejorando la eficiencia.",
    "B. Utilizar **procesos secuenciales** sin considerar la carga del sistema para evitar complejidad.",
    "C. Aumentar la capacidad de los servidores sin optimizar el proceso de transformación."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El **procesamiento paralelo** es fundamental para **optimizar el rendimiento** en la transformación de grandes volúmenes de datos, permitiendo que el sistema se distribuya de manera eficiente. Las opciones B y C no garantizan la optimización ni la escalabilidad."
},
{
  "id": "dsg-137",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "Al integrar datos de contribuyentes en el **Data Warehouse** de la DIAN, se detecta que algunos datos están desactualizados. ¿Qué acción debe tomar el Gestor II para garantizar que los datos sean útiles para los reportes fiscales?",
  "opciones": [
    "A. Aplicar un proceso de **carga incremental** para actualizar solo los datos más recientes y corregir los desactualizados.",
    "B. Ignorar los datos desactualizados y proceder con los datos disponibles.",
    "C. Eliminar todos los datos históricos y reemplazarlos por los registros más recientes."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El uso de **carga incremental** asegura que solo los datos más recientes o modificados sean actualizados, lo que mejora la **eficiencia** del proceso y garantiza que los **reportes fiscales** estén basados en datos actualizados."
},
{
  "id": "dsg-138",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "En el diseño de una solución de **facturación electrónica** para la DIAN, ¿qué componente debe garantizarse para asegurar la **interoperabilidad** con otros sistemas del gobierno y empresas?",
  "opciones": [
    "A. Implementar un **middleware** que traduzca los datos a los formatos estándar requeridos por el gobierno y las empresas.",
    "B. Utilizar un sistema de **carga directa de datos** sin necesidad de adaptadores o estándares de comunicación.",
    "C. Limitar la integración a sistemas internos para evitar complejidad técnica."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El **middleware** permite traducir los datos a un formato estándar, asegurando que los sistemas internos de la DIAN puedan **interoperar** eficazmente con los sistemas de otras entidades gubernamentales y empresas, como exige el **Decreto 2242 de 2015** sobre facturación electrónica."
},
{
  "id": "dsg-139",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "La DIAN requiere integrar datos históricos de contribuyentes en un **Data Lake** para análisis a gran escala. ¿Qué ventaja clave ofrece un **Data Lake** en este contexto?",
  "opciones": [
    "A. Almacenar datos **sin procesar** en su formato original permite realizar análisis avanzados a gran escala.",
    "B. Los **Data Lakes** son más fáciles de gestionar que los **Data Warehouses** debido a su simplicidad.",
    "C. Los **Data Lakes** son más adecuados para almacenar solo datos estructurados y preprocesados."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Los **Data Lakes** permiten almacenar grandes volúmenes de datos **sin procesar**, lo que facilita el análisis a gran escala y la exploración de datos no estructurados, lo que es esencial para el análisis de grandes volúmenes de datos históricos de contribuyentes."
},
{
  "id": "dsg-140",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "El **Gestor II** está diseñando una solución para automatizar el proceso de generación de reportes fiscales basados en datos de contribuyentes. ¿Qué enfoque debe aplicar para garantizar la **calidad** de los reportes?",
  "opciones": [
    "A. Aplicar **validaciones de calidad de datos** durante la fase de transformación para asegurar la precisión de los reportes.",
    "B. Realizar validaciones solo después de que los datos hayan sido cargados en el sistema de reporte.",
    "C. Ignorar las validaciones si el tiempo de procesamiento es limitado."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Las **validaciones de calidad de datos** deben realizarse durante la fase de **transformación** para asegurar que los **reportes fiscales** se basen en datos precisos y confiables antes de ser generados."
},
{
  "id": "dsg-141",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "La DIAN necesita integrar datos de contribuyentes y facturación electrónica en tiempo real. ¿Qué componente debe garantizarse en el diseño de esta solución para asegurar la **interoperabilidad**?",
  "opciones": [
    "A. Establecer un **sistema de comunicación en tiempo real** que cumpla con los estándares de interoperabilidad definidos por el Gobierno Digital.",
    "B. Utilizar sistemas **cerrados** que solo se integren con plataformas internas de la DIAN.",
    "C. Limitar la integración a las plataformas gubernamentales y no incluir a las empresas privadas."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Para **interoperabilidad** en tiempo real, es necesario utilizar un sistema que cumpla con los estándares de comunicación definidos en el **Gobierno Digital** y otros marcos normativos, permitiendo la integración eficiente con otras entidades y empresas."
},
{
  "id": "dsg-142",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "En el diseño de una solución ETL para la DIAN, ¿cómo se puede garantizar que el proceso sea **escalable** a medida que aumenta el volumen de datos de contribuyentes?",
  "opciones": [
    "A. Implementar una arquitectura **distribuida** que permita manejar grandes volúmenes de datos mediante múltiples nodos.",
    "B. Utilizar un solo servidor centralizado para almacenar todos los datos, aunque esto limite el rendimiento.",
    "C. Reducir el volumen de datos almacenados y procesados para mejorar la eficiencia del sistema."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Una **arquitectura distribuida** permite **escalar** el proceso de ETL a medida que el volumen de datos crece, garantizando el rendimiento y la capacidad de manejar grandes volúmenes de datos sin sobrecargar el sistema."
},
{
  "id": "dsg-143",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "Al diseñar un sistema para la **facturación electrónica**, la DIAN necesita asegurar que los datos sean **precisos** y **consistentes**. ¿Qué acción debe tomarse para asegurar que los datos sean de alta calidad?",
  "opciones": [
    "A. Implementar **reglas de calidad de datos** durante las fases de extracción, transformación y carga (ETL) para garantizar su consistencia.",
    "B. Ignorar la calidad de los datos y proceder con la carga para evitar demoras.",
    "C. Dejar que los usuarios finales validen los datos antes de la carga."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Es crucial **implementar reglas de calidad de datos** durante todo el proceso ETL para garantizar que los datos sean **precisos y consistentes** antes de ser cargados en el sistema de facturación electrónica."
},
{
  "id": "dsg-144",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "La DIAN está implementando un **Data Warehouse** para analizar grandes volúmenes de datos de contribuyentes. ¿Qué característica debe tener esta solución para garantizar la **alta disponibilidad** de los datos?",
  "opciones": [
    "A. Implementar una **infraestructura redundante** y **copias de seguridad automáticas** para garantizar que los datos estén siempre disponibles.",
    "B. Almacenar los datos en un servidor único y hacer las copias de seguridad manualmente.",
    "C. Utilizar solo almacenamiento local y no realizar copias de seguridad."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Una **infraestructura redundante** y **copias de seguridad automáticas** aseguran que los datos estén siempre disponibles, incluso en caso de fallos en el sistema, lo cual es esencial para mantener la **disponibilidad** en el **Data Warehouse**."
},
{
  "id": "dsg-145",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "En la integración de datos de contribuyentes, la DIAN se enfrenta a problemas de **rendimiento** debido a un alto volumen de registros. ¿Qué estrategia debe aplicar el Gestor II para mejorar el rendimiento del sistema ETL?",
  "opciones": [
    "A. Implementar un **procesamiento por lotes** para dividir los datos en bloques manejables y mejorar el rendimiento.",
    "B. Aumentar la capacidad de almacenamiento sin revisar el proceso de transformación.",
    "C. Eliminar los registros de menor relevancia para reducir el volumen de datos."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El **procesamiento por lotes** es una estrategia efectiva para mejorar el **rendimiento** del sistema ETL al manejar los datos en bloques más pequeños y procesarlos de manera más eficiente."
},
{
  "id": "dsg-146",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "En el proceso de integración de datos de contribuyentes, se presentan **errores de integridad** de los datos. ¿Qué debe hacer el Gestor II para asegurar que los datos sean correctos antes de su carga?",
  "opciones": [
    "A. Aplicar **reglas de validación** y **verificación de integridad** en la fase de transformación antes de la carga.",
    "B. Cargar los datos sin aplicar reglas de validación para evitar retrasos.",
    "C. Eliminar los registros con errores y proceder con los datos restantes."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Las **reglas de validación** y la **verificación de integridad** son esenciales durante la fase de **transformación** para garantizar que los datos sean correctos y completos antes de ser cargados en el sistema."
},

{
  "id": "dsg-147",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "La DIAN está implementando un proceso ETL para **gestionar datos aduaneros**. Durante la fase de **extracción**, los datos de una fuente externa tienen un formato inconsistente. ¿Qué debe hacer el Gestor II en la fase de transformación?",
  "opciones": [
    "A. Transformar los datos a un formato estándar que se ajuste a los requisitos del sistema de destino.",
    "B. Dejar los datos con su formato original para evitar errores durante la transformación.",
    "C. Eliminar los registros con formato inconsistente y proceder con los datos correctos."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El **Gestor II** debe **transformar los datos** a un formato estándar que se ajuste a los requisitos del sistema de destino. Esto es esencial para mantener la **coherencia** y **consistencia** de los datos a lo largo del proceso ETL."
},
{
  "id": "dsg-148",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "La DIAN quiere automatizar la generación de **reportes fiscales** utilizando herramientas ETL. Para garantizar que los datos sean correctos y consistentes, ¿qué enfoque debe seguir el Gestor II?",
  "opciones": [
    "A. Aplicar reglas de **validación de calidad** durante las fases de extracción y transformación para asegurar la precisión de los reportes.",
    "B. Ignorar los errores en los datos y proceder con la carga para cumplir con los plazos.",
    "C. Dejar que los usuarios finales realicen la validación de los datos antes de generar los reportes."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Las **reglas de validación de calidad** son esenciales durante el proceso de **extracción** y **transformación** para garantizar que los datos sean precisos y confiables antes de ser utilizados para generar **reportes fiscales**."
},
{
  "id": "dsg-149",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "El proceso ETL en la DIAN está transformando datos de contribuyentes provenientes de múltiples sistemas. Los registros tienen valores nulos. ¿Qué debe hacer el Gestor II para garantizar la integridad de los datos durante la transformación?",
  "opciones": [
    "A. Aplicar **reglas de tratamiento de valores nulos** para asegurar que los campos obligatorios sean completados o eliminados si es necesario.",
    "B. Ignorar los valores nulos y proceder con la carga de los datos tal como están.",
    "C. Eliminar los registros con valores nulos y proceder con los registros completos."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Durante la **transformación**, es esencial aplicar **reglas de tratamiento de valores nulos** para garantizar que los datos sean completos y consistentes antes de su carga, especialmente en campos obligatorios."
},
{
  "id": "dsg-150",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "En la DIAN, se realiza un proceso ETL para cargar datos aduaneros en un **Data Warehouse**. Para garantizar que los datos sean cargados de manera eficiente, ¿qué estrategia debe aplicar el Gestor II?",
  "opciones": [
    "A. Implementar una **carga incremental** para cargar solo los datos nuevos o actualizados, mejorando el rendimiento.",
    "B. Cargar todos los datos de una sola vez para agilizar el proceso.",
    "C. Cargar los datos directamente desde las fuentes sin ninguna transformación o validación."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La **carga incremental** es clave para **mejorar el rendimiento** del proceso ETL, ya que solo se cargan los datos nuevos o actualizados, evitando la sobrecarga del sistema con grandes volúmenes de datos."
},
{
  "id": "dsg-151",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "Al realizar un proceso ETL de integración de datos tributarios, el **Gestor II** detecta que los datos de varias fuentes no son consistentes. ¿Qué debe hacer durante la fase de transformación?",
  "opciones": [
    "A. Aplicar reglas de **normalización** y **estandarización** para garantizar que todos los datos sean consistentes antes de la carga.",
    "B. Permitir que los datos inconsistentes sean cargados y corregirlos después.",
    "C. Eliminar los registros con inconsistencias y proceder solo con los datos válidos."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La **normalización** y **estandarización** son esenciales en la fase de **transformación** para garantizar que todos los datos sean consistentes y compatibles con el sistema de destino."
},
{
  "id": "dsg-152",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "En el proceso de ETL de la DIAN, se detecta que algunos registros de **facturación electrónica** contienen errores debido a un cambio en la estructura de los datos. ¿Qué debe hacer el Gestor II?",
  "opciones": [
    "A. Actualizar las reglas de transformación para que los datos se alineen con la nueva estructura antes de cargar los datos.",
    "B. Ignorar los errores y proceder con la carga de los datos para cumplir con los plazos.",
    "C. Eliminar los registros con errores y proceder solo con los registros correctos."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El **Gestor II** debe **actualizar las reglas de transformación** para que los datos se alineen con la nueva estructura de manera que sean consistentes y válidos antes de ser cargados en el sistema."
},
{
  "id": "dsg-153",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "La DIAN está implementando un sistema ETL para cargar grandes volúmenes de datos de contribuyentes. ¿Qué debe hacer el Gestor II para mejorar el rendimiento del proceso de transformación?",
  "opciones": [
    "A. Optimizar las transformaciones utilizando **consultas más eficientes** y **procesamiento paralelo**.",
    "B. Aumentar la capacidad de almacenamiento sin revisar las transformaciones.",
    "C. Realizar las transformaciones de manera manual para agilizar el proceso."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La **optimización de las transformaciones** y el **procesamiento paralelo** son prácticas recomendadas para mejorar el **rendimiento** del proceso ETL, especialmente cuando se manejan grandes volúmenes de datos."
},
{
  "id": "dsg-154",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "En un proceso ETL, el **Gestor II** ha identificado que los datos de contribuyentes provenientes de diferentes sistemas tienen **formatos inconsistentes**. ¿Qué acción debe tomar durante la fase de transformación?",
  "opciones": [
    "A. Aplicar reglas de **normalización** para garantizar que los datos sean consistentes y compatibles entre todos los sistemas.",
    "B. Cargar los datos tal como están y hacer las correcciones después de la carga.",
    "C. Eliminar los registros con formatos incompatibles y proceder con los datos restantes."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La **normalización** es esencial para **uniformizar** los datos provenientes de diferentes sistemas, lo que garantiza que sean consistentes y compatibles con el sistema de destino."
},
{
  "id": "dsg-155",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "Al cargar datos de contribuyentes en el **Data Warehouse**, el proceso ETL presenta problemas debido a un volumen elevado de registros. ¿Qué estrategia debe aplicar el Gestor II?",
  "opciones": [
    "A. Implementar **procesamiento en lotes** para dividir los datos y mejorar el rendimiento de la carga.",
    "B. Cargar todos los datos de una vez para agilizar el proceso.",
    "C. Cargar solo una pequeña muestra de datos y esperar a completar la carga."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El **procesamiento en lotes** permite dividir el volumen de datos en partes más pequeñas, lo que mejora el **rendimiento** y evita la sobrecarga del sistema durante la carga masiva de datos."
},
{
  "id": "dsg-156",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "En un proceso de integración de datos para la DIAN, el **Gestor II** detecta que algunos campos de datos no se corresponden con los estándares de calidad. ¿Qué debe hacer durante la fase de transformación?",
  "opciones": [
    "A. Aplicar **reglas de validación** para corregir los datos y asegurar que cumplan con los estándares de calidad antes de la carga.",
    "B. Permitir que los datos sean cargados tal como están, ya que no afectan el análisis.",
    "C. Eliminar los registros incorrectos y proceder con los datos válidos."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El **Gestor II** debe aplicar **reglas de validación de calidad de datos** durante la **transformación** para garantizar que los datos sean correctos y cumplan con los estándares antes de ser cargados."
},
{
  "id": "dsg-157",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "Al realizar un proceso ETL, el **Gestor II** se da cuenta de que algunos datos de facturación electrónica no están siendo transformados correctamente debido a un error en las reglas de negocio. ¿Qué debe hacer?",
  "opciones": [
    "A. Revisar y corregir las **reglas de transformación** para alinear los datos con las reglas de negocio correctas.",
    "B. Ignorar los errores de transformación y proceder con la carga de los datos.",
    "C. Eliminar los registros con errores y proceder con los datos correctos."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El **Gestor II** debe revisar y corregir las **reglas de transformación** para garantizar que los datos sean consistentes con las **reglas de negocio** antes de ser cargados en el sistema."
},
{
  "id": "dsg-158",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "La DIAN está implementando un sistema ETL para la **facturación electrónica**. ¿Qué enfoque debe adoptar el Gestor II para garantizar la **interoperabilidad** entre sistemas internos y externos?",
  "opciones": [
    "A. Utilizar un **middleware** que permita la traducción de los datos a un formato común entre los sistemas de la DIAN y los externos.",
    "B. Utilizar solo los formatos nativos de cada sistema sin realizar ninguna adaptación.",
    "C. Limitar la integración a sistemas internos para evitar complejidad técnica."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El uso de un **middleware** garantiza que los datos puedan **intercambiarse de manera coherente** entre los sistemas internos y externos de la DIAN, cumpliendo con los estándares de **interoperabilidad**."
},

{
  "id": "dsg-159",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "En el diseño de un proceso ETL para la DIAN, se requiere garantizar que los datos de contribuyentes sean consistentes entre diferentes sistemas. ¿Qué acción debe tomar el Gestor II durante la fase de **transformación**?",
  "opciones": [
    "A. Aplicar un conjunto de **reglas de normalización** para asegurar que los datos sean consistentes entre los diferentes sistemas.",
    "B. Dejar que los datos sean procesados sin transformación y corregir las inconsistencias más tarde.",
    "C. Ignorar las inconsistencias entre los sistemas, ya que no afectan significativamente los análisis."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Es crucial aplicar **reglas de normalización** en la fase de **transformación** para garantizar que los datos sean consistentes y puedan ser procesados correctamente en todos los sistemas involucrados."
},
{
  "id": "dsg-160",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "La DIAN está implementando un sistema ETL para integrar datos aduaneros. Se detecta que algunos registros contienen **valores erróneos** debido a un error en la extracción de datos. ¿Qué debe hacer el Gestor II durante la fase de transformación?",
  "opciones": [
    "A. Revisar los registros erróneos, aplicar las **reglas de validación** para corregir los valores y luego cargar los datos.",
    "B. Ignorar los valores erróneos y proceder con la carga de los datos para cumplir con los plazos.",
    "C. Eliminar los registros con valores erróneos y cargar solo los registros correctos."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Es esencial que el **Gestor II** aplique **reglas de validación** para corregir los valores erróneos antes de proceder con la carga de datos, garantizando la calidad y la precisión de los datos."
},
{
  "id": "dsg-161",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "En un proceso ETL en la DIAN, el **Gestor II** nota que los datos de contribuyentes extraídos contienen **valores nulos** en campos importantes. ¿Qué acción debe tomar durante la fase de transformación?",
  "opciones": [
    "A. Aplicar **reglas de tratamiento de valores nulos**, como asignar un valor predeterminado o eliminar los registros con valores nulos.",
    "B. Permitir que los valores nulos sean cargados tal como están y hacer las correcciones después de la carga.",
    "C. Ignorar los valores nulos, ya que no afectan el análisis de los datos."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Durante la fase de **transformación**, es importante **tratar los valores nulos** para asegurarse de que los datos sean completos y consistentes antes de ser cargados en el sistema final."
},
{
  "id": "dsg-162",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "Durante la implementación de un proceso ETL para la DIAN, el sistema presenta problemas de **sincronización de datos** entre varias bases de datos. ¿Qué debe hacer el Gestor II para asegurar que los datos sean consistentes y estén sincronizados?",
  "opciones": [
    "A. Implementar un **sistema de sincronización en tiempo real** entre todas las bases de datos para garantizar la consistencia de los datos.",
    "B. Sincronizar los datos manualmente después de cada proceso de carga.",
    "C. Ignorar la sincronización en tiempo real y cargar los datos de manera secuencial."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El uso de un sistema de **sincronización en tiempo real** garantiza que los datos estén **siempre actualizados y consistentes** entre las bases de datos, lo que es crucial en sistemas de gran volumen como los de la DIAN."
},
{
  "id": "dsg-163",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "En el proceso de integración de datos tributarios, la DIAN debe asegurarse de que la **seguridad** de los datos de contribuyentes esté protegida. ¿Qué medida debe implementarse para garantizar esta seguridad durante la transformación de datos?",
  "opciones": [
    "A. Implementar **cifrado de datos** durante la transformación y garantizar el acceso restringido a los datos sensibles.",
    "B. Dejar los datos sin cifrado, ya que la seguridad del sistema es suficiente.",
    "C. Realizar la transformación sin considerar medidas de seguridad, ya que los datos se encuentran en un entorno controlado."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El **cifrado de datos** durante la **transformación** es una medida esencial para proteger los datos sensibles y cumplir con las normativas de **seguridad de la información**, como lo exige el **Manual de Seguridad de la Información de la DIAN**."
},
{
  "id": "dsg-164",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "En un proceso de **carga** de datos en el **Data Warehouse** de la DIAN, se presentan inconsistencias en los registros debido a la **falta de integración entre sistemas**. ¿Qué debe hacer el Gestor II para resolver este problema?",
  "opciones": [
    "A. Implementar un proceso de **integración de datos** que unifique las fuentes y garantice que los datos sean consistentes antes de la carga.",
    "B. Cargar los datos tal como están, sin realizar la integración de los sistemas.",
    "C. Eliminar los registros inconsistentes y proceder con los datos válidos."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El **Gestor II** debe implementar un proceso de **integración de datos** para asegurar que todas las fuentes de datos estén alineadas y los registros sean consistentes antes de ser cargados en el sistema final."
},
{
  "id": "dsg-165",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "La DIAN desea mejorar la **eficiencia** de un proceso ETL para integrar datos de contribuyentes. ¿Qué acción debe tomar el Gestor II para optimizar este proceso?",
  "opciones": [
    "A. Aplicar **transformaciones optimizadas** y dividir el proceso en **lotes pequeños** para evitar cuellos de botella.",
    "B. Aumentar la capacidad de hardware sin optimizar el proceso ETL.",
    "C. Mantener el proceso de transformación sin cambios y esperar a que el rendimiento mejore con el tiempo."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La **optimización de transformaciones** y el **procesamiento por lotes** son prácticas recomendadas para mejorar la **eficiencia** en el proceso ETL, permitiendo que el sistema procese los datos de manera más rápida y eficiente."
},
{
  "id": "dsg-166",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "En el diseño de un sistema ETL para la DIAN, se debe garantizar que la **interoperabilidad** entre los sistemas de facturación electrónica sea eficiente. ¿Qué debe hacerse para lograrlo?",
  "opciones": [
    "A. Implementar un **middleware** que permita la **traducción de datos** entre los diferentes sistemas internos y externos.",
    "B. Utilizar los **formatos nativos** de cada sistema sin realizar adaptaciones o transformaciones.",
    "C. Limitar la integración a un solo sistema de facturación electrónica para evitar complejidad."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El uso de un **middleware** es fundamental para asegurar que los datos puedan ser **traducidos** y compartidos entre diferentes sistemas, asegurando la **interoperabilidad** entre los sistemas de la DIAN y externos."
},
{
  "id": "dsg-167",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "En la fase de **transformación** de un proceso ETL, se presentan inconsistencias en la **integridad referencial** entre diferentes tablas. ¿Qué debe hacer el Gestor II para resolver este problema?",
  "opciones": [
    "A. Implementar **reglas de integridad referencial** para asegurar que las relaciones entre las tablas sean consistentes antes de proceder con la carga.",
    "B. Ignorar las inconsistencias de integridad referencial y continuar con la carga de datos.",
    "C. Eliminar los registros inconsistentes y proceder con los datos restantes."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Las **reglas de integridad referencial** deben ser implementadas para garantizar que las relaciones entre las tablas sean correctas antes de proceder con la **carga de datos**, asegurando la coherencia y consistencia de los datos."
},
{
  "id": "dsg-168",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "La DIAN está implementando un proceso ETL para integrar datos de contribuyentes. Se detecta que algunos datos contienen **valores nulos** en campos obligatorios. ¿Qué debe hacer el Gestor II en la fase de transformación?",
  "opciones": [
    "A. Aplicar **reglas de manejo de valores nulos**, como reemplazar los valores nulos con valores predeterminados o eliminar los registros si no pueden completarse.",
    "B. Ignorar los valores nulos y proceder con la carga de los datos.",
    "C. Dejar los valores nulos sin modificación y realizar la corrección posterior en el Data Warehouse."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Durante la fase de **transformación**, es importante **aplicar reglas de manejo de valores nulos** para garantizar que los datos sean completos y no afecten la calidad de los informes y análisis."
},
{
  "id": "dsg-169",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "El Gestor II debe implementar una solución ETL para cargar datos de contribuyentes en el **Data Warehouse**. ¿Qué estrategia debe aplicar para optimizar el rendimiento en la fase de carga?",
  "opciones": [
    "A. Utilizar **carga incremental** para cargar solo los registros nuevos o actualizados, reduciendo el volumen de datos cargados.",
    "B. Cargar todos los datos de una sola vez para maximizar el rendimiento del sistema.",
    "C. Cargar los datos directamente desde la fuente sin aplicar ningún filtro."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La **carga incremental** es una estrategia eficiente para **reducir el volumen de datos** procesados en cada ciclo, mejorando el rendimiento y evitando sobrecargar el sistema."
},
{
  "id": "dsg-170",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "En el diseño de un sistema ETL para la DIAN, se requiere que los datos sean accesibles y consistentes. ¿Qué enfoque debe seguir el Gestor II para garantizar la **integridad de los datos** durante todo el proceso ETL?",
  "opciones": [
    "A. Aplicar **reglas de validación** y **transformación** en todas las fases (extracción, transformación, carga) para asegurar la integridad de los datos.",
    "B. Permitir que los datos sean procesados sin validaciones, ya que la carga directa es más rápida.",
    "C. Cargar los datos directamente y hacer las correcciones después en el Data Warehouse."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El **Gestor II** debe aplicar **reglas de validación** y **transformación** durante todo el proceso ETL para garantizar que los datos sean consistentes y precisos, cumpliendo con los requisitos de calidad y consistencia."
},

{
  "id": "dsg-171",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "Durante un proceso ETL en la DIAN, los registros extraídos de contribuyentes contienen **valores atípicos** en algunos campos. ¿Qué estrategia debe aplicar el Gestor II durante la fase de transformación?",
  "opciones": [
    "A. Aplicar **reglas de tratamiento de valores atípicos** para asegurar que los datos sean consistentes antes de la carga.",
    "B. Eliminar los registros con valores atípicos y proceder con los demás datos.",
    "C. Dejar los valores atípicos tal como están, ya que no afectan los resultados finales del análisis."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El **Gestor II** debe aplicar **reglas de tratamiento de valores atípicos** en la fase de **transformación** para asegurar que los datos sean **coherentes** y no afecten la calidad del análisis y los informes."
},
{
  "id": "dsg-172",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "La DIAN está implementando un sistema ETL para integrar datos de contribuyentes y generar reportes fiscales. ¿Qué estrategia debe seguir el Gestor II para garantizar que el proceso de carga sea **seguro** y **cumpla con la normativa de protección de datos personales**?",
  "opciones": [
    "A. Implementar **cifrado de datos** en cada fase del proceso ETL para proteger los datos sensibles durante su transferencia y almacenamiento.",
    "B. Cargar los datos sin cifrado, ya que la seguridad del sistema es suficiente.",
    "C. Dejar que los datos sean validados por los usuarios finales antes de su carga, para reducir el riesgo de errores."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El **cifrado de datos** en cada fase del proceso ETL es necesario para cumplir con la **normativa de protección de datos personales** (Ley 1581 de 2012) y garantizar que los datos sean seguros y confidenciales durante su manipulación."
},
{
  "id": "dsg-173",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "El **Gestor II** está diseñando un proceso ETL para integrar los datos de contribuyentes, pero la calidad de los datos es deficiente. ¿Qué enfoque debe adoptar para mejorar la calidad de los datos en la fase de transformación?",
  "opciones": [
    "A. Aplicar **reglas de validación de calidad de datos** para corregir errores, eliminar duplicados y estandarizar la información.",
    "B. Dejar que los datos sean procesados sin modificaciones y aplicar las correcciones después de la carga.",
    "C. Ignorar los problemas de calidad de los datos y continuar con el proceso ETL."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Aplicar **reglas de validación de calidad de datos** es clave para garantizar que los datos sean **correctos, completos y consistentes** antes de ser cargados en el sistema final, mejorando la calidad de los reportes fiscales."
},
{
  "id": "dsg-174",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "En el proceso de **extracción de datos** de múltiples fuentes para un proceso ETL, el **Gestor II** observa que algunos de los datos contienen **información obsoleta**. ¿Qué debe hacer en la fase de transformación?",
  "opciones": [
    "A. **Actualizar o eliminar** los registros obsoletos durante la fase de transformación antes de cargarlos en el sistema.",
    "B. Ignorar los datos obsoletos y proceder con la carga de los datos restantes.",
    "C. Cargar los datos obsoletos tal como están para evitar retrasos en el proceso."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El **Gestor II** debe **actualizar o eliminar** los registros obsoletos para asegurar que los datos cargados sean **relevantes y actuales**, lo que es esencial para la toma de decisiones precisas en la DIAN."
},
{
  "id": "dsg-175",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "Durante el proceso de **transformación**, el sistema de ETL de la DIAN detecta que algunos datos tienen **errores de formato**. ¿Qué acción debe tomar el Gestor II para asegurar que los datos sean consistentes antes de la carga?",
  "opciones": [
    "A. **Normalizar los formatos** de los datos durante la fase de transformación para que sean consistentes con los estándares del sistema de destino.",
    "B. Ignorar los errores de formato y cargar los datos sin modificaciones.",
    "C. Dejar que los usuarios finales modifiquen los datos antes de la carga."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La **normalización de los formatos** es esencial para asegurar que los datos sean **coherentes** con los **estándares del sistema** antes de ser cargados, lo que facilita el análisis posterior."
},
{
  "id": "dsg-176",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "La DIAN está implementando un sistema ETL para integrar datos de contribuyentes y generar reportes fiscales. ¿Qué estrategia debe aplicar el Gestor II para **optimizar** el rendimiento del proceso de transformación?",
  "opciones": [
    "A. Optimizar las consultas de transformación, aplicar **procesamiento paralelo** y reducir la complejidad de las reglas de negocio.",
    "B. Continuar con el proceso sin optimización, ya que los datos no son de gran volumen.",
    "C. Aumentar la capacidad del servidor sin cambiar el diseño del proceso de transformación."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La **optimización de las consultas** y el **procesamiento paralelo** permiten distribuir el trabajo, mejorar la **eficiencia** del proceso ETL y reducir los tiempos de transformación de grandes volúmenes de datos."
},
{
  "id": "dsg-177",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "En un proceso ETL de la DIAN, el **Gestor II** observa que el tiempo de carga de datos es muy largo. ¿Qué acción debe tomar para mejorar la **eficiencia** del proceso de carga?",
  "opciones": [
    "A. Implementar **carga incremental** para cargar solo los datos nuevos o modificados, en lugar de cargar todos los datos de una vez.",
    "B. Aumentar la capacidad de los servidores sin cambiar el enfoque de carga de datos.",
    "C. Continuar con el proceso de carga sin modificaciones, confiando en el rendimiento del sistema."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La **carga incremental** mejora significativamente el rendimiento al procesar solo los datos nuevos o modificados, lo que reduce el **tiempo de carga** y la **sobrecarga del sistema**."
},
{
  "id": "dsg-178",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "En un sistema ETL que está extrayendo datos de múltiples fuentes externas, el Gestor II detecta que algunos registros contienen **errores de integridad** referencial. ¿Qué debe hacer durante la fase de transformación?",
  "opciones": [
    "A. Aplicar **reglas de integridad referencial** para garantizar que las relaciones entre los datos sean correctas antes de cargar los datos.",
    "B. Ignorar los errores de integridad referencial y continuar con el proceso de carga.",
    "C. Eliminar los registros problemáticos y proceder con los datos restantes."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Las **reglas de integridad referencial** son esenciales para garantizar que los datos estén correctamente relacionados entre sí antes de ser cargados en el sistema, evitando incoherencias y errores en los análisis posteriores."
},
{
  "id": "dsg-179",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "En la fase de **transformación** de un proceso ETL, los datos de contribuyentes contienen **valores nulos** en campos clave. ¿Qué debe hacer el Gestor II durante esta fase?",
  "opciones": [
    "A. Aplicar reglas de **tratamiento de valores nulos**, como reemplazar los valores nulos con valores predeterminados o eliminar los registros con valores nulos.",
    "B. Dejar los valores nulos tal como están y proceder con la carga de los datos.",
    "C. Ignorar los registros con valores nulos y proceder solo con los datos completos."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Es fundamental aplicar **reglas de tratamiento de valores nulos** para asegurar que los datos sean completos y consistentes antes de ser cargados en el sistema."
},
{
  "id": "dsg-180",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "La DIAN desea mejorar la **seguridad** de los datos en su proceso ETL. ¿Qué medida de seguridad debe aplicar el Gestor II para proteger los datos durante la transferencia?",
  "opciones": [
    "A. Implementar **cifrado SSL/TLS** para asegurar que los datos sean transferidos de manera segura entre los sistemas.",
    "B. Transferir los datos sin cifrado, ya que los sistemas internos de la DIAN son lo suficientemente seguros.",
    "C. Almacenar los datos sin cifrado y aplicar medidas de seguridad solo en el almacenamiento final."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El uso de **cifrado SSL/TLS** garantiza que los datos sean **protegidos** durante su transferencia, cumpliendo con las normativas de **seguridad** y **protección de datos personales** (Ley 1581 de 2012)."
},
{
  "id": "dsg-181",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "En la DIAN, el proceso ETL de integración de datos de contribuyentes está presentando problemas de **rendimiento** debido al volumen de datos. ¿Qué acción debe tomar el Gestor II?",
  "opciones": [
    "A. Implementar **optimización de consultas** y **procesamiento paralelo** para mejorar el rendimiento del proceso ETL.",
    "B. Ignorar el problema de rendimiento y continuar con el proceso ETL como está.",
    "C. Aumentar la capacidad de almacenamiento y procesar los datos sin optimización."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La **optimización de consultas** y el **procesamiento paralelo** son fundamentales para mejorar el **rendimiento** del sistema ETL, especialmente cuando se manejan grandes volúmenes de datos."
},
{
  "id": "dsg-182",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "En un proceso ETL de la DIAN, el Gestor II detecta que algunos datos de contribuyentes están **duplicados** durante la fase de transformación. ¿Qué debe hacer para evitar que los duplicados afecten los análisis posteriores?",
  "opciones": [
    "A. Implementar un **proceso de deduplicación** para eliminar los registros duplicados antes de la carga.",
    "B. Permitir que los duplicados sean cargados y hacer las correcciones después de la carga.",
    "C. Eliminar los registros duplicados manualmente después de la carga."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La **deduplicación** es crucial para asegurar que los datos cargados sean **únicos** y no afecten la integridad de los informes o análisis posteriores."
},
{
  "id": "dsg-183",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "En la DIAN, el proceso de carga de datos es lento debido a la **alta complejidad** de las transformaciones. ¿Qué debe hacer el Gestor II para mejorar la eficiencia del proceso de transformación?",
  "opciones": [
    "A. Simplificar y optimizar las **reglas de transformación** para que el proceso sea más rápido y eficiente.",
    "B. Aumentar la capacidad de procesamiento del sistema sin optimizar las transformaciones.",
    "C. Ignorar la complejidad de las transformaciones y continuar con el proceso tal como está."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La **optimización de las reglas de transformación** es clave para mejorar la **eficiencia** del proceso ETL y reducir los tiempos de procesamiento de los datos."
},


{
  "id": "dsg-184",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "En un proceso ETL de la DIAN, se detecta que algunos registros de contribuyentes tienen **valores faltantes** en campos clave. ¿Qué acción debe tomar el Gestor II durante la fase de transformación?",
  "opciones": [
    "A. Reemplazar los valores faltantes con valores predeterminados o estimados, de acuerdo con las reglas de negocio.",
    "B. Ignorar los valores faltantes y continuar con el proceso de carga.",
    "C. Eliminar los registros con valores faltantes y proceder con los registros completos."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El **Gestor II** debe aplicar reglas para **reemplazar los valores faltantes** de acuerdo con las reglas de negocio, garantizando que los datos sean completos y consistentes antes de la carga."
},
{
  "id": "dsg-185",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "La DIAN está implementando un proceso ETL para generar reportes de contribuyentes. ¿Qué estrategia debe aplicar el Gestor II para **mejorar la calidad de los datos** durante la transformación?",
  "opciones": [
    "A. Aplicar **reglas de validación** y **transformación** para corregir errores y mejorar la consistencia de los datos.",
    "B. Permitir que los datos sean cargados sin validación para no retrasar el proceso.",
    "C. Realizar la validación y transformación solo después de que los datos sean cargados."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La **validación** y **transformación de los datos** son fundamentales para **mejorar la calidad** de los datos antes de su carga, asegurando que los reportes sean precisos y confiables."
},
{
  "id": "dsg-186",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "Al diseñar una solución ETL para la DIAN, el Gestor II identifica que algunos procesos de **extracción de datos** están siendo lentos debido a la sobrecarga en el sistema de origen. ¿Qué estrategia debería aplicar?",
  "opciones": [
    "A. Realizar la extracción en **horarios de baja demanda** o **optimizando las consultas** para mejorar el rendimiento.",
    "B. Ignorar la lentitud y continuar con el proceso ETL durante las horas pico.",
    "C. Aumentar la capacidad de los servidores sin optimizar el proceso de extracción."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Realizar la **extracción en horarios de baja demanda** y **optimizar las consultas** son estrategias clave para mejorar el rendimiento del proceso ETL y reducir la sobrecarga del sistema de origen."
},
{
  "id": "dsg-187",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "La DIAN está utilizando una herramienta ETL para integrar datos de contribuyentes. ¿Qué acción debe tomar el Gestor II para garantizar la **interoperabilidad** de los datos entre los sistemas internos y externos?",
  "opciones": [
    "A. Implementar un **middleware** que convierta los datos a un formato común, asegurando la interoperabilidad entre sistemas internos y externos.",
    "B. Utilizar los **formatos nativos** de cada sistema sin realizar ninguna adaptación o transformación.",
    "C. Limitar la integración solo a sistemas internos para evitar complejidad."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El uso de un **middleware** permite que los datos sean **convertidos** y compartidos entre diferentes sistemas, garantizando la **interoperabilidad** y el cumplimiento de estándares de intercambio de datos."
},
{
  "id": "dsg-188",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "En un proceso ETL en la DIAN, el **Gestor II** observa que los datos extraídos tienen **valores inconsistentes** en algunas columnas clave. ¿Qué debe hacer durante la fase de transformación?",
  "opciones": [
    "A. Aplicar **reglas de validación de datos** y **transformación** para corregir los valores inconsistentes antes de la carga.",
    "B. Dejar que los valores inconsistentes sean cargados sin modificaciones.",
    "C. Eliminar los registros con valores inconsistentes y proceder con los registros correctos."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Las **reglas de validación** y **transformación** deben aplicarse durante la fase de **transformación** para garantizar que los datos sean consistentes y correctos antes de ser cargados en el sistema de destino."
},
{
  "id": "dsg-189",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "Al diseñar un proceso ETL para la **facturación electrónica** en la DIAN, ¿qué medida debe implementarse para garantizar la **calidad y precisión** de los datos de los contribuyentes?",
  "opciones": [
    "A. Aplicar **reglas de validación** durante la **extracción** y **transformación** de datos para asegurar que los datos sean precisos y estén completos.",
    "B. Permitir que los datos sean extraídos y transformados sin validación, ya que no afecta los resultados finales.",
    "C. Eliminar todos los registros con errores de facturación y proceder con los datos correctos."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Aplicar **reglas de validación** durante la **extracción** y **transformación** asegura que los datos sean **precisos y completos**, lo que es crucial para la **generación de reportes fiscales** y el cumplimiento de la **facturación electrónica**."
},
{
  "id": "dsg-190",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "En un proceso ETL de la DIAN, los datos de contribuyentes están siendo cargados en un **Data Warehouse**. ¿Qué estrategia debe aplicar el Gestor II para asegurar que el proceso de **carga** se realice de manera eficiente?",
  "opciones": [
    "A. Utilizar **procesamiento por lotes** para cargar los datos en intervalos pequeños y garantizar un mejor rendimiento.",
    "B. Cargar todos los datos de una vez para aprovechar al máximo la capacidad del sistema.",
    "C. Eliminar los registros innecesarios y cargar solo los datos más relevantes."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El **procesamiento por lotes** es una estrategia eficiente para cargar datos en intervalos pequeños, lo que mejora el rendimiento y reduce el tiempo de carga al evitar la sobrecarga del sistema."
},
{
  "id": "dsg-191",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "La DIAN está integrando datos de contribuyentes a través de un sistema ETL. Durante la fase de transformación, se presenta una **incompatibilidad de formatos** entre diferentes fuentes de datos. ¿Qué debe hacer el Gestor II?",
  "opciones": [
    "A. Implementar un proceso de **normalización** para unificar los formatos de datos antes de cargarlos en el sistema de destino.",
    "B. Dejar los datos tal como están y proceder con la carga sin realizar ninguna transformación.",
    "C. Eliminar los registros con formatos incompatibles y proceder con los datos correctos."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La **normalización** es clave para unificar los formatos de datos y garantizar que todos los datos sean compatibles con el sistema de destino, asegurando la **coherencia y consistencia** de la información."
},
{
  "id": "dsg-192",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "Durante la fase de **transformación** en un proceso ETL, el **Gestor II** observa que algunos campos de datos contienen **valores atípicos**. ¿Qué debe hacer en este caso?",
  "opciones": [
    "A. Aplicar **reglas de tratamiento de valores atípicos** para asegurar que los datos sean válidos y coherentes antes de la carga.",
    "B. Dejar los valores atípicos tal como están y proceder con la carga.",
    "C. Eliminar los registros con valores atípicos y proceder con los datos restantes."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Es importante aplicar **reglas de tratamiento de valores atípicos** para garantizar que los datos sean **válidos y coherentes** antes de ser cargados en el sistema de destino."
},
{
  "id": "dsg-193",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "La DIAN está implementando un proceso ETL para **analizar grandes volúmenes de datos** de contribuyentes. ¿Qué estrategia debe adoptar el Gestor II para garantizar la **escalabilidad** del sistema?",
  "opciones": [
    "A. Implementar una **arquitectura distribuida** que permita procesar grandes volúmenes de datos de manera eficiente.",
    "B. Utilizar un solo servidor para procesar todos los datos, lo que reducirá la complejidad del sistema.",
    "C. Reducir el volumen de datos cargados para evitar la necesidad de escalabilidad."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Una **arquitectura distribuida** permite procesar grandes volúmenes de datos de manera más eficiente y escalable, lo que es esencial para manejar el **crecimiento** de los datos en la DIAN."
},
{
  "id": "dsg-194",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "En un proceso ETL para la integración de datos aduaneros, se presentan **problemas de rendimiento** debido a la cantidad de registros. ¿Qué acción debe tomar el Gestor II para optimizar el proceso?",
  "opciones": [
    "A. Implementar un sistema de **procesamiento en paralelo** y distribuir las cargas de trabajo entre múltiples servidores.",
    "B. Aumentar la capacidad de almacenamiento sin revisar el proceso de procesamiento de datos.",
    "C. Cargar los datos en secuencia sin optimizar el proceso."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El **procesamiento en paralelo** permite distribuir la carga de trabajo, mejorando significativamente el **rendimiento** y permitiendo manejar grandes volúmenes de datos sin afectar la eficiencia del proceso ETL."
},
{
  "id": "dsg-195",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "En el proceso de **extracción de datos** para la DIAN, el **Gestor II** detecta que la fuente de datos externa tiene **errores de formato** en algunos registros. ¿Qué debe hacer en la fase de transformación?",
  "opciones": [
    "A. Aplicar **reglas de transformación** para corregir los errores de formato y asegurar que los datos sean consistentes antes de la carga.",
    "B. Cargar los datos tal como están sin realizar ninguna corrección en el formato.",
    "C. Eliminar los registros con errores de formato y proceder con los datos correctos."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Es fundamental aplicar **reglas de transformación** para corregir los **errores de formato** durante la fase de transformación, asegurando que los datos sean consistentes y estén en el formato correcto antes de ser cargados en el sistema."
},
{
  "id": "dsg-196",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "En un proceso ETL de la DIAN, el Gestor II nota que algunos de los **datos de facturación electrónica** tienen **valores erróneos** en los campos de monto. ¿Qué acción debe tomar en la fase de transformación?",
  "opciones": [
    "A. Corregir los valores erróneos utilizando las **reglas de negocio** para asegurar que los datos sean válidos antes de la carga.",
    "B. Ignorar los valores erróneos y proceder con la carga de los datos para cumplir con los plazos.",
    "C. Eliminar los registros con valores erróneos y proceder con los registros correctos."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "El **Gestor II** debe corregir los **valores erróneos** de acuerdo con las **reglas de negocio** para asegurar que los datos sean válidos y consistentes antes de ser cargados en el sistema."
},

{
  "id": "dsg-197",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "Durante un proceso ETL en la DIAN, el **Gestor II** se da cuenta de que el sistema está tardando demasiado tiempo en procesar los datos debido a una **gran cantidad de registros**. ¿Qué debe hacer para mejorar la **eficiencia** del proceso?",
  "opciones": [
    "A. Implementar **carga incremental** para procesar solo los datos nuevos o actualizados y reducir el volumen de datos.",
    "B. Aumentar la capacidad del servidor sin optimizar el proceso de ETL.",
    "C. Continuar con el proceso sin realizar ningún cambio y esperar a que el sistema se adapte."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La **carga incremental** reduce significativamente el volumen de datos procesados, mejorando la eficiencia del sistema y evitando sobrecargas en el proceso ETL."
},
{
  "id": "dsg-198",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "En un proceso ETL de la DIAN, los datos de contribuyentes provenientes de varias fuentes no están siendo correctamente **transformados** debido a **errores en las reglas de negocio**. ¿Qué debe hacer el Gestor II para resolver este problema?",
  "opciones": [
    "A. Revisar y actualizar las **reglas de transformación** para asegurar que todos los datos se alineen con las reglas de negocio.",
    "B. Ignorar los errores y continuar con la carga de datos.",
    "C. Eliminar los registros incorrectos y proceder con los datos restantes."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Es fundamental revisar y **actualizar las reglas de transformación** para que los datos sean procesados correctamente de acuerdo con las **reglas de negocio** antes de ser cargados en el sistema."
},
{
  "id": "dsg-199",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "Al realizar un proceso ETL, el **Gestor II** detecta que algunos datos de contribuyentes están **duplicados** en la base de datos. ¿Qué acción debe tomar durante la fase de transformación?",
  "opciones": [
    "A. Implementar un proceso de **deduplicación** para eliminar los registros duplicados antes de la carga.",
    "B. Dejar los duplicados tal como están y proceder con la carga.",
    "C. Eliminar los registros duplicados manualmente después de la carga."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "La **deduplicación** es esencial para asegurar que los datos cargados sean **únicos** y no afecten la integridad de los informes o análisis posteriores."
},
{
  "id": "dsg-200",
  "tema": "Diseño de Soluciones de Gestión de Datos",
  "pregunta": "La DIAN está utilizando un proceso ETL para integrar datos de contribuyentes en su **Data Warehouse**. Durante la fase de **carga**, se presenta un error debido a la **incompatibilidad de tipos de datos** entre las fuentes. ¿Qué debe hacer el Gestor II?",
  "opciones": [
    "A. Ajustar el **mapeo de datos** para garantizar que los tipos de datos sean compatibles entre las fuentes y el sistema de destino.",
    "B. Ignorar el error de tipo de datos y proceder con la carga de datos.",
    "C. Eliminar los registros con tipos de datos incompatibles y proceder con los datos restantes."
  ],
  "respuesta_correcta_index": 0,
  "explicacion": "Es esencial revisar y **ajustar el mapeo de datos** para garantizar que los **tipos de datos** sean compatibles y evitar errores durante el proceso de carga."
}








]